{
  "MUL2319": {
    "exchange": "\"User: I've been cooped up in the hostel for too long.\",\n\"System: It's good to take a step outside once in a while.\",\n\"User: If only I didn't have so much coursework. Thankfully I'm going out with my friends for dinner next Monday.\",\n'System: Where will you be going for dinner ?',\n\"User: I have a friend that works at backstreet bistro. He's inviting us over for a special meal.\"",
    "gen_sit": "I've been cooped up in the hostel for too long. I'm going out with my friends for dinner next Monday. We'll be going to Backstreet Bistro, as my friend who works there is inviting us over for a special meal."
  },
  "MUL1740": {
    "exchange": "'User: My boyfriend just started his summer break at Cambridge university.',\n'System: Sounds like a great time to go out with your partner.',\n\"User: I'm actually heading over to his place soon.It's been a while since I last visited him.\",\n\"System: I'm sure your boyfriend missed you.\",\n\"User: I'm sure he did, since he was so busy doing coursework at Cambridge.\"",
    "gen_sit": "My boyfriend just started his summer break at Cambridge university. I'm heading over to his place soon, since it's been a while since I last visited him. He was busy doing coursework at Cambridge."
  },
  "PMUL3166": {
    "exchange": "\"User: I'm visiting the city of my alma meter this week.\",\n'System: Why the sudden trip ?',\n'User: I am invited to attend some parties in that city. I would like to explore the city before I go to the parties though.',\n\"System: It sure would've been a waste to only attend parties during your trip there.\",\n'User: I actually have a swimming exam coming up right after the week of my visit, so I will have to find a swimming pool to brush up my skills.'",
    "gen_sit": "I'm visiting the city of my alma mater this week. I'm invited to attend some parties there, but I'd like to explore the city first. I also need to find a swimming pool to practice for my upcoming exam."
  },
  "PMUL1352": {
    "exchange": "\"User: I'm making a video essay about historical museums in the country.\",\n\"System: Thai's interesting. I look forward to seeing that video essay.\",\n'User: There are a few more places that I need to go to before my essay can be finished.',\n\"System: Mind sharing what's in your plans ?\",\n\"User: I've read that Cambridge has some pretty quaint museums with unique exhibitions and history. They will fit in great in my video essay.\"",
    "gen_sit": "I'm making a video essay about historical museums in the country. I've read that Cambridge has some pretty quaint     museums with unique exhibitions and history. They will fit in great in my video essay."
  },
  "MUL0580": {
    "exchange": "\"User: Now that me and my friends have graduated, it's time that they to go back to our home countries.\",\n\"System: That's sad to hear. I hope you can keep in touch with your friends.\",\n\"User: We have added each other on social media, so it's fine. It will difficult when it's time to say goodbye to each other though.\",\n'System: At least you and your friends can still find each other on the internet.',\n\"User: I  can't  bear to see them off at the Stansted Airport when they board their plane home.\"",
    "gen_sit": "Me and my friends have graduated and it's time for them to return to their home countries. We have added each other     on social media, but it will be difficult to say goodbye when they leave from Stansted Airport."
  },
  "PMUL3766": {
    "exchange": "'User: Me and my girlfriend are going on our first date in Cambridge today.',\n'System: Sounds great ! I wish you all the best for your date.',\n\"User: I'm not sure. I tried asking my girlfriend for ideas.\",\n\"System: It's a good idea to ask your partner for ideas.\",\n\"User: We've never went boating before, so I think we can try that out this time.\"",
    "gen_sit": "Me and my girlfriend are going on our first date in Cambridge today. We've never went boating before, so I think we can try that out this time."
  },
  "PMUL3117": {
    "exchange": "'User: My company is sending me and a a few other colleagues on a business trip.',\n'System: Sounds like you are going to be busy for awhile.',\n\"User: I will be attending a two day conference, so it won't be too bad. I even get to visit my alma meter again !\",\n'System: Sounds like your business trip is a blessing in disguise. Where did you study at ?',\n'User: I studied at Cambridge. In fact,  the city the university is at is the avenue of the conference I will be attending.'",
    "gen_sit": "I will be going on a business trip with a few other colleagues. I will be attending a two day conference and get to visit my alma meter again, which is in Cambridge, where the conference is being held."
  },
  "MUL1044": {
    "exchange": "\"User: It's been around a year and a half sine I last left Cambridge after my graduation.\",\n'System: Did nostalgia pull you back to this place ?',\n\"User: I am actually returning to meet up with some old friends. I'm looking to do things that I haven't done here before.\",\n'System: What did you miss out on ?',\n\"User: I missed out on going to nightclubs since I am always swamped with course work. Now's my time to make up for lost time.\"",
    "gen_sit": "I haven't been back to Cambridge since my graduation a year and a half ago. I'm returning to meet up with some old     friends and do things I haven't done here before, like going to nightclubs."
  },
  "MUL0971": {
    "exchange": "\"User: My mom's coming to visit me before the exams begin.\",\n'System: Do you have anything planned for her ?',\n\"User: She likes to go sight-seeing around cities, so I'll bring her to do just that.\",\n'System: Sounds great. Your mom is lucky to have a son like you.',\n\"User: I know she loves museums. I don't know which one to bring her to, though.\"",
    "gen_sit": "My mom's coming to visit me before the exams begin. She likes to go sight-seeing around cities, so I'll bring her to do just that. I know she loves museums, but I'm not sure which one to bring her to."
  },
  "SNG01586": {
    "exchange": "\"User: I'm going to my first pub ever later today with my friends.\",\n'System: Where are you going for your first pub experience ?',\n\"User: My friend often frequents the Royal standard pub. I'm going to join them there.\",\n'System: Be careful not to get too much alcohol in your system !',\n\"User: Don't worry, I got an appointment afterwards, so I won't get too drunk.\"",
    "gen_sit": "I'm going to my first pub ever later today with my friends. My friend often frequents the Royal Standard Pub,     so I'll join them there. I have an appointment later, so I'll be careful not to get too drunk."
  },
  "PMUL3485": {
    "exchange": "\"User: My family's flying back to our hometown this week after a few days of visiting me.\",\n\"System: That's sad to hear. I hope they had a great time visiting you.\",\n\"User: I'm sure they did. It's only been a few days, but there is so much that I have yet to show them.\",\n\"System: There's always a next time for your family to come and visit again.\",\n\"User: It's going to be hard seeing them off at Stansted Airport this Saturday.\"",
    "gen_sit": "My family's flying back to our hometown this week after a few days of visiting me. I'm sure they had a great time, but     there's still so much I have yet to show them. I'll be seeing them off at Stansted Airport this Saturday."
  },
  "SNG0060": {
    "exchange": "'User: My friend found a great restaurant and is bringing me there for some lunch.',\n\"System: Your friend sounds like a great person. Where's he bringing you ?\",\n\"User: He says that he's bringing me to saffron brasserie for some amazing Indian cuisine.\",\n'System: If your friend is so passionate about it, the place must be excellent.',\n'User: I wanted to bring my boyfriend along, but he asked me to get him something else instead.'",
    "gen_sit": "My friend is bringing me to Saffron Brasserie for some amazing Indian cuisine for lunch. I wanted to bring my     boyfriend along, but my friend asked me to get him something else instead."
  },
  "MUL2108": {
    "exchange": "\"User: My friend's been bugging me to hang out with her since the semester ended.\",\n\"System: Why don't you pay her a visit ? You will get to hang out with her.\",\n\"User: Maybe I could do that. I'm free this Sunday anyways.\",\n'System: A change in your environment will only do you good.',\n\"User: My friend's lives near at Birmingham New Street. I'm going to pick her up there.\"",
    "gen_sit": "My friend's been bugging me to hang out with her since the semester ended. I'm free this Sunday and I'll pick her up     from Birmingham New Street."
  },
  "MUL0311": {
    "exchange": "'User: Me and a whole bunch of old college mates are going to visit our alma meter this week.',\n\"System: What's the occasion for the visit ?\",\n'User: We are going to a Alumni Party. It will be a great opportunity to do something fun for once in while !',\n'System: Sounds like you have been quite bored recently.',\n\"User: Of course. I've been living in Stevenage all my life, and there's nothing to do here.\"",
    "gen_sit": "I'm going to visit my alma mater this week with a group of old college mates. We're attending an Alumni Party,     which will be a great opportunity to have some fun. I've been feeling bored lately, as I've been living in Stevenage all my life and there's nothing to do here."
  },
  "SNG01553": {
    "exchange": "'User: My boss is sending me on a business trip on short notice.',\n'System: Are any of your plans disrupted ?',\n'User: I wanted to take the day off on Wednesday, but now my break is replaced by the business trip.',\n\"System: I'm sorry to hear that. I hope you will be properly compensated for it.\",\n'User: To be fair, taking leave on a Wednesday was a gamble. I was mostly sure that my boss has something for me up her sleeve.'",
    "gen_sit": "My boss is sending me on a business trip on short notice. My plans for a day off on Wednesday have been disrupted     and replaced by the business trip. I was aware that taking a leave on a Wednesday was a gamble, as my boss usually has     something planned for me."
  },
  "MUL1615": {
    "exchange": "'User: My team is looking to film in some market towns.',\n'System: What are you getting the footage for ?',\n'User: We are making a documentary on market towns and their heritage.',\n\"System: That's quite an interesting topic. Looking forward to the documentary's release.\",\n\"User: I've got some friends working in Bishops Stortford that I can ask for help.\"",
    "gen_sit": "My team is looking to film in some market towns for a documentary on market towns and their heritage. I have     friends working in Bishops Stortford that I can ask for help."
  },
  "SNG02029": {
    "exchange": "\"User: It's been a few days since I came to Cambridge for my vacation.\",\n'System: Did you have fun in the city ?',\n\"User: I sure did. I'm especially glad I chose Hobson house for lodging.\",\n\"System: That's good to know. That place is know to always have happy customers.\",\n\"User: I'm going to meet up with a local friend for some lunch soon. She says that she got a surprise for me.\"",
    "gen_sit": "I've been in Cambridge for a few days on vacation. I've had a great time here, especially staying at Hobson House.     I'm meeting a local friend for lunch soon and she says she has a surprise for me."
  },
  "MUL0207": {
    "exchange": "\"User: I'm going back to my hometown when this semester ends this week.\",\n'System: You must have missed your home very much while you were studying.',\n\"User: That's right. I've been staying in Cambridge ever since I moved here to study, and I haven't seen my family since.\",\n\"System: It's great that you get to go back to your hometown and catch up.\",\n\"User: It's going to be difficult leaving my friends behind though.\"",
    "gen_sit": "I'm going back to my hometown when this semester ends this week. I've been staying in Cambridge ever since I     moved here to study, and I haven't seen my family since. It's going to be difficult leaving my friends behind though."
  },
  "PMUL2338": {
    "exchange": "\"User: I've been trying to get my boyfriend into theater recently.\",\n\"System: It's great to share interests with your partner.\",\n\"User: I'm not having any luck though, seems like showing him video clips of theater play is not enough.\",\n\"System: Theater's best experienced live, I think.\",\n\"User: That is true, but we haven't got the time to go to a theater until now.\"",
    "gen_sit": "I've been trying to get my boyfriend into theater recently, but I'm not having any luck. I've tried showing him video     clips of theater plays, but it's not enough. Theater's best experienced live, but we haven't got the time to go to a theater until now."
  },
  "MUL1884": {
    "exchange": "\"User: I'm visiting my son who's studying in Cambridge. I haven't seen him in months.\",\n\"System: That's a really long time ! I'm sure he will be happy to see you.\",\n\"User: I'm really interested in the city he's been staying in too. I should get him to bring me around the place.\",\n\"System: That's a great idea, sight-seeing and spending time with your son at the same time.\",\n\"User: I heard that his University is made up of multiple colleges. It's not a system I'm familiar with.\"",
    "gen_sit": "I'm visiting my son who's studying in Cambridge. I haven't seen him in months. I'm interested in the city he's been staying in too. I should get him to bring me around the place. I heard that his University is made up of multiple colleges. It's not a system I'm familiar with."
  },
  "PMUL1018": {
    "exchange": "\"User: I've been living in Leicester for many years and I've done everything that can be done here.\",\n\"System: I guess it's time for a change in environment.\",\n\"User: I agree. That's why I'm going on an excursion with some friends this week.\",\n'System: That sounds fun ! Where will you be going ?',\n\"User: I'm not sure yet. Any where's better than this city though.\"",
    "gen_sit": "I've been living in Leicester for many years and have done everything that can be done here. I'm going on an     excursion with some friends this week, but I'm not sure where we'll be going yet."
  },
  "MUL2000": {
    "exchange": "\"User: It's been along time since I graduated from Cambridge.\",\n'System: Do you miss your old school ?',\n'User: I do, but I only ever known my college and the area around it.',\n'System: You could be missing out on  a lot.',\n'User: My friend is a member of Emmanuel college. She says she can bring me around her place when we hang out.'",
    "gen_sit": "I graduated from Cambridge a long time ago and miss my old school. I only know my college and the area     around it. My friend, a member of Emmanuel College, has invited me to hang out and explore the area with her."
  },
  "PMUL2906": {
    "exchange": "\"User: I'm bringing a friend around town this week. It's her first time here.\",\n\"System: It's nice of you to be your friend's guide.\",\n\"User: I'm not sure where to take her though, there's a lot of attractions here and we have too little time.\",\n\"System: You can try going for your friend's preferences.\",\n\"User: My friend is a architecture buff but she's never seen European buildings in person before. She will probably be content walking around the city.\"",
    "gen_sit": "I'm bringing a friend around town this week. It's her first time here. My friend is an architecture buff but she's never seen European buildings in person before. She will probably be content walking around the city."
  },
  "MUL0478": {
    "exchange": "\"User: I've been bringing  my friends around the town for a week.\",\n\"System: That's very nice of you to be their guide.\",\n\"User: I've been studying the whole time anyways, it's great to have an excuse to hang out with friends for a while.\",\n\"System: It's important to work and hard and play hard, after all.\",\n\"User: Unfortunately the exams are coming up in Cambridge, so I cant's stick around for long.\"",
    "gen_sit": "I've been bringing my friends around the town for a week. I've been studying the whole time anyways, it's great to have an excuse to hang out with friends for a while. Unfortunately, the exams are coming up in Cambridge, so I can't stick around for long."
  },
  "MUL1975": {
    "exchange": "'User: Recess week is finally coming up, which means  i get to catch a break.',\n\"System: That's great news ! How are you going to spend the week ?\",\n\"User: I'm going to go out with my boyfriend. It's been a long time since we went out together.\",\n\"System: It's good to catch up with your loved ones when the opportunity comes.\",\n'User: My boyfriend is itching to go to a concerthall lately. I should bring him to one.'",
    "gen_sit": "Recess week is coming up, which means I get to catch a break. I'm going to go out with my boyfriend. It's been a     long time since we went out together. My boyfriend is itching to go to a concert hall lately. I should bring him to one."
  },
  "SNG01839": {
    "exchange": "'User: I will be going to my alma mater to give a talk at a seminar.',\n'System: What will be your talk be about ?',\n\"User: My talk will be about coping with studying stress and study tips. I'm sure the folks at Cambridge will find it useful.\",\n'System: I heard the competition in that school is pretty intense.',\n\"User: That's true. When I was studying at Cambridge, my stress levels were through the roof.\"",
    "gen_sit": "I will be giving a talk at my alma mater, Cambridge, about coping with studying stress and study tips. I have first-hand     experience with the intense competition and stress levels at Cambridge."
  },
  "MUL1540": {
    "exchange": "\"User: I'm inviting some friends over for a double date this week.\",\n\"System: That's interesting. Why the double date ?\",\n\"User: It's been a really long time since we hung out together, so I thought we should take a break and see each other.\",\n\"System: What's keeping you from gong out with your friends ?\",\n\"User: I've been swamped with coursework, so it's difficult for me to even get out of Cambridge to see my friends.\"",
    "gen_sit": "I'm inviting some friends over for a double date this week. It's been a really long time since we hung out together, so I thought we should take a break and see each other. I've been swamped with coursework, so it's difficult for me to even get out of Cambridge to see my friends."
  },
  "PMUL3928": {
    "exchange": "'User: I love learning new things about art and history.',\n'System: You must really love museums then.',\n'User: I pretty much exhausted my museum options in my city,',\n\"System: I guess it's time for you to find a new place out of town to visit.\",\n\"User: A friend invited me over to a party at Cambridge. I heard there's lots of museums in that city.\"",
    "gen_sit": "I love learning new things about art and history. I have exhausted my museum options in my city and am looking     for a new place out of town to visit. My friend invited me to a party at Cambridge, which has lots of museums."
  },
  "MUL1034": {
    "exchange": "\"User: I've been attending a conference in Cambridge for a few days.\",\n'System: Sounds like you had quite a busy week.',\n'User: Thankfully the conference is coming to an end. I will have some time for some sight-seeing.',\n'System: I heard the city has many great places to visit.',\n\"User: I love museums. I would like to learn more about this city's history.\"",
    "gen_sit": "I've been attending a conference in Cambridge for a few days. The conference is coming to an end and I'll have some     time for sight-seeing. I love museums and would like to learn more about this city's history."
  },
  "MUL0959": {
    "exchange": "\"User: I'm on an exchange program here in Cambridge.\",\n'System: I hope the city does not disappoint.',\n'User: I love the city ! I especially love the local university environment.',\n'System: It does have a very conducive environment for students to study and live in.',\n\"User: I've heard that the school is made up of many colleges. I'm very curious about them.\"",
    "gen_sit": "I'm on an exchange program in Cambridge. I love the city and especially the local university environment.     I've heard that the school is made up of many colleges and I'm very curious about them."
  },
  "PMUL3428": {
    "exchange": "'User: I have a date with the missus on Thursday.',\n'System: Lucky you.',\n'User: Her brother told me that she really likes good food. I hope my wallet is up to it.'",
    "gen_sit": "I have a date with the missus on Thursday. Her brother told me that she really likes good food. I hope my wallet is up to it."
  },
  "PMUL0564": {
    "exchange": "\"User: So, I've been told that I can't cook.\",\n'System: Have you tried, sir? It can be easier than you think.',\n'User: My uncle was doing a perfect impression of Gordon Ramsay about the barbeque I made. He also got food poisoning.',\n'System: Oh dear.',\n\"User: Barbeque food can't be that difficult to make. Barbeque restaurants probably are filled with lazy employees.\"",
    "gen_sit": "I was told that I can't cook. My uncle criticized the barbeque I made and even got food poisoning. I think barbeque restaurants are filled with lazy employees."
  },
  "MUL0452": {
    "exchange": "'User: I say, I say, Britain is a nice place! Shame about the sun though.',\n'System: Welcome to the United Kingdom, sir.',\n\"User: I was told that the three best universities in the United Kingdom were Oxford, Cambridge and Hull. I'll check out Cambridge first.\"",
    "gen_sit": "I have just arrived in the United Kingdom. I have been advised that the three best universities in the United Kingdom are Oxford, Cambridge and Hull. I'll check out Cambridge first."
  },
  "PMUL1318": {
    "exchange": "\"User: It's a pretty day out today.\",\n'System: Agreed. It is the start of summer after all.',\n\"User: I can't wait for my upcoming vacation.\",\n\"System: I'm happy for you. You deserve a break.\",\n\"User: Side note, I'm flying first class for the first time in my life. Managed to get tickets for cheap.\",\n'System: My my what a catch!',\n'User: Have you been to Stansted airport?',\n'System: Nope. Why do you ask?',\n\"User: I'm catching my flight from there. Not entirely sure how the layout is like.\"",
    "gen_sit": "It's a pretty day out today. I can't wait for my upcoming vacation. I'm flying first class for the first time in my life. I'm catching my flight from Stansted Airport, but I'm not entirely sure how the layout is like."
  },
  "PMUL1029": {
    "exchange": "\"User: I've been laden with way too much work by my boss !\",\n'System: That sounds awful. Remember to take a break now and then !',\n'User: Fortunately I am nearly done with all the work, so I can take a nice vacation soon.',\n'System: You should do that ! You deserve the vacation.',\n\"User: There's a public holiday this Tuesday, so I will take the chance and go on my vacation on that day.\"",
    "gen_sit": "I've been laden with way too much work by my boss. Fortunately, I am nearly done with all the work, so I can take a nice     vacation soon. There's a public holiday this Tuesday, so I will take the chance and go on my vacation on that day."
  },
  "PMUL4588": {
    "exchange": "\"User: Me and some mates from my club are going out to celebrate our club's anniversary.\",\n'System: That sounds like a lot of fun ! What is your club about ?',\n'User: We are a cuisine appreciation club. Going around places to experience new cuisines is our thing.',\n\"System: That's quite an interesting club you are in. Wish I could join too.\",\n\"User: This time the theme is British food, though it's something we  are already very familiar with.\"",
    "gen_sit": "Me and some mates from my club are going out to celebrate our club's anniversary. We are a cuisine appreciation club,     and this time the theme is British food, though it's something we're already very familiar with."
  },
  "MUL0293": {
    "exchange": "'User: My boss is sending me to attend an important business meeting on short notice !',\n\"System: That's unfortunate. I hope your boss pays you extra for that.\",\n\"User: I am getting paid for some overtime, and I get to visit the city of my old University, so it's not all bad.\",\n'System: Where are you going for your business meeting ?',\n\"User: The meeting's held at Cambridge, which happens to be where I studied at. The city had so many great places to visit.\"",
    "gen_sit": "My boss is sending me to attend an important business meeting on short notice! I'm getting paid for some overtime     and I get to visit the city of my old University, so it's not all bad. The meeting's held at Cambridge, which happens to be     where I studied at. The city had so many great places to visit."
  },
  "PMUL3537": {
    "exchange": "'User: Me and some coworkers are heading to a conference held in Cambridge this week.',\n'System: Sounds like you are going to have a busy week.',\n'User: My boss just delegated the task of finding lodging to me too.',\n\"System: Hopefully your colleagues won't make too much a fuss about your decisions.\",\n\"User: I heard that city has great food and nice lodging, so at least my colleagues won't complain much in the end.\"",
    "gen_sit": "I'm heading to a conference in Cambridge this week with some colleagues. My boss delegated the task of finding     lodging to me. I heard that Cambridge has great food and nice lodging."
  },
  "MUL1517": {
    "exchange": "'User: The exams are over, and the semester is ending this week.',\n\"System: That means it's time for a vacation, isn't it ?\",\n\"User: That's right. I'm going to spend some time out of town with my girlfriend. I haven't see her in ages.\",\n\"System: It's important to catch up with loved ones. Your girlfriend must be free from studies too.\",\n\"User: She's currently working as a Researcher in Cambridge. She's still has lots of work to do, actually.\"",
    "gen_sit": "The exams are over, and the semester is ending this week. I'm going to spend some time out of town with my girlfriend.     She's currently working as a Researcher in Cambridge. She's still has lots of work to do, actually."
  },
  "MUL1338": {
    "exchange": "\"User: Hi. I'm looking to take a break from the hectic city life!\",\n\"System: Oh, I see. I'm sure we all need a break sometimes.\",\n\"User: Yes, I've been so stressed lately! My friend recommended me this restaurant, golden wok. I can't wait to try it! She said that the food there is really good!\"",
    "gen_sit": "I'm looking to take a break from the hectic city life! I've been so stressed lately! My friend recommended me this restaurant, Golden Wok. I can't wait to try it! She said that the food there is really good!"
  },
  "MUL1663": {
    "exchange": "\"User: My boyfriend is calling me over to hang out, but I can't decide on a day to go to his place.\",\n\"System: What's making the choice so difficult ?\",\n\"User: I'm not sure whether I should go to his place on a weekday or the weekends.\",\n\"System: I heard train's less crowded on weekends. Going on a weekend means you do not have to spend your leave too.\",\n\"User: You're right, it's better to go this coming Saturday. My boyfriend will have more time for me that day too.\"",
    "gen_sit": "My boyfriend is calling me over to hang out, but I'm having a hard time deciding on a day to go to his place.     I'm torn between going on a weekday or the weekends. I've decided to go this coming Saturday, as the train will be less crowded and my boyfriend will have more time for me."
  },
  "MUL0544": {
    "exchange": "'User: Hi. I want to take a short trip myself this weekend!',\n'System: That sounds exciting!',\n\"User: Yes, I'm going to town for a short trip! I want to do some shopping too! I can't wait to get away from the hectic city life.\",\n\"System: I'm sure you would enjoy yourself.\",\n\"User: I sure do hope so. I want to visit some friends too! I've been stuck at Cambridge since forever.\"",
    "gen_sit": "I want to take a short trip myself this weekend! I'm going to town for a short trip! I want to do some shopping too!     I can't wait to get away from the hectic city life. I want to visit some friends too! I've been stuck at Cambridge since     forever."
  },
  "MUL0287": {
    "exchange": "'User: I miss eating the food from Thailand.',\n'System: What makes you so fond of the food there ?',\n\"User: I guess it's because the food there is so much different from the ones I'm used to, and I love how spicy the cuisine is.\",\n'System: Have you tried the local places that serves Thai ?',\n\"User: Come to think of it, I've been too busy to explore the local restaurants for Thai food.\"",
    "gen_sit": "I miss eating Thai food. I love how different and spicy the cuisine is. However, I have not had the chance to explore local Thai restaurants because I've been too busy."
  },
  "PMUL2385": {
    "exchange": "\"User: Hi. I'm meeting my high school friend next week!\",\n'System: Wow, sounds like a reunion.',\n\"User: Yes, I haven't seen her in a very long time! I miss her so much.\",\n\"System: I'm sure you do. These are the friends that stay with us for a lifetime.\",\n\"User: I sure do treasure this friendship a lot. We're looking to have some Scottish food! I hope we would be able to catch up.\"",
    "gen_sit": "I'm meeting my high school friend next week! I haven't seen her in a very long time and I miss her so much.     We're looking to have some Scottish food! I hope we would be able to catch up."
  },
  "MUL0313": {
    "exchange": "\"User: I'll be moving to a new city this coming week.\",\n'System: How are you feeling about moving to a new place ?',\n\"User: I'm excited, but also a bit sad. I'm going to miss Cambridge, I stayed here for so long.\",\n'System: Your friends over here will miss you too,I reckon.',\n'User: The feeling is mutual. I will be bringing some of my closest friends for one last dinner in the city today.'",
    "gen_sit": "I'll be moving to a new city this coming week. I'm excited, but also a bit sad. I'm going to miss Cambridge, I     stayed here for so long. I will be bringing some of my closest friends for one last dinner in the city today."
  },
  "PMUL3174": {
    "exchange": "\"User: Hi. I'm bringing my son next week to Cambridge for a short trip! We have never been there before!\",\n\"System: Wow, what's the occasion.\",\n\"User: It's his birthday soon! I'm bringing him to an amusement park!\"",
    "gen_sit": "I'm bringing my son to Cambridge next week for a short trip. It's his birthday soon and I'm bringing him to an     amusement park!"
  },
  "MUL0426": {
    "exchange": "\"User: I've just watched an advertisement about the museum of archaeology and anthropology.\",\n\"System: That's quite an interesting topic for an advertisement.\",\n\"User: It certainly made me want to go there. I've been looking for a good place to learn more about archaeology.\",\n\"System: That's a very vast subject. What made you interested in it?\",\n\"User: I've been binging on archaeology documentaries this past week. Now I want to see some historic artifacts for myself.\"",
    "gen_sit": "I've been binging on archaeology documentaries this past week and now I want to see some historic artifacts for myself.     I've just watched an advertisement about the museum of archaeology and anthropology."
  },
  "MUL1453": {
    "exchange": "\"User: Hi. It's my grandmother's 80th birthday next week!\",\n'System: Wow, congratulations to her!',\n\"User: Yes, we're looking to bring her to a restaurant for dinner!\",\n'System: That sounds like a great plan!',\n'User: I hope she likes it. She loves Spanish food. I hope she enjoys her birthday.'",
    "gen_sit": "My grandmother's 80th birthday is next week. We're planning to take her out to a Spanish restaurant for dinner.     I hope she enjoys her birthday."
  },
  "MUL2468": {
    "exchange": "\"User: I've just moved to Cambridge for my work recently.\",\n\"System: I hope the city's been treating you well.\",\n\"User: The people here is nice and hospitable. But I've yet to experience the food here.\",\n'System: I doubt you will be disappointed by what the locals have to offer.',\n\"User: My friend works at a restaurant called Saint johns chop house. He's says its very popular these days.\"",
    "gen_sit": "I've recently moved to Cambridge for work. The people here are nice and hospitable, but I haven't tried the food     yet. My friend works at a popular restaurant called Saint John's Chop House."
  },
  "SNG02296": {
    "exchange": "'User: Hi. Recently there is this popular restaurant, gourmet burger kitchen trending on the internet!',\n'System: Wow, sounds interesting!',\n\"User: Yes, I've heard that they have delicious dishes and the queue there is really long.\",\n'System: Oh, I see. Do you love western food?',\n\"User: Yes, I sure do. I can't wait to give it a try!\"",
    "gen_sit": "I recently came across a popular restaurant, Gourmet Burger Kitchen, trending on the internet. It's known for its delicious dishes and long queues. I'm excited to try it out since I love western food."
  },
  "PMUL1968": {
    "exchange": "\"User: Hi. I have a doctor's appointment next week.\",\n'System: Oh, I see, are you feeling okay?',\n\"User: It's for an old injury acting up. But sadly my clinic isn't at Cambridge here.\",\n'System: Hope you recover soon, take care of yourself!',\n'User: Thank you! I already took time off for that. I hope that the therapy would help.'",
    "gen_sit": "I have a doctor's appointment next week for an old injury acting up. My clinic isn't at Cambridge. I've already taken time off for that. I hope that the therapy would help."
  },
  "SNG0447": {
    "exchange": "'User: Hi. Recently my favorite singers are planning to have a concert nearby.',\n'System: Wow, sounds interesting!',\n\"User: Yes, I've already bought tickets for it! My friend is a fan too, so I'm going with her.\",\n'System: You sure seem very excited to meet them!',\n\"User: I sure am! It's this Sunday! And I'll have to take a train there!\"",
    "gen_sit": "I recently bought tickets to my favorite singer's nearby concert. I'm going with my friend, who is also a fan.     We'll take the train there on Sunday."
  },
  "PMUL1133": {
    "exchange": "\"User: Hi. I'm so pumped! I've just watched my favorite football team live!\",\n'System: Wow, you must be so excited!',\n'User: Yes, I am! Together with a few friends, we have been huge fans for a long time!',\n'System: I see, did the team win?',\n\"User: Yes, they won the match! I'm so proud of them! We are looking to spend a few more days here then leave on Saturday.\"",
    "gen_sit": "I'm so pumped! I've just watched my favorite football team live with a few friends, who are also huge fans. The team won the match and we're planning to spend a few more days here before leaving on Saturday."
  },
  "MUL0448": {
    "exchange": "\"User: Hi. It's the summer holidays soon and I'm tasked to bring some of my students on a short trip!\",\n'System: Wow, that sounds like a really fun summer program!',\n\"User: Yes, it is. It's for the history club that I am in charge of.\",\n'System: Oh, I see. Are you a history teacher?',\n'User: Yes, I am! I just love history so much. I hope to bring them to explore Cambridge and learn more about the history there! I hope it would help to widen their knowledge!'",
    "gen_sit": "I am a history teacher in charge of a history club and I'm tasked to bring some of my students on a short trip!     I hope to bring them to explore Cambridge and learn more about the history there!"
  },
  "MUL1768": {
    "exchange": "\"User: Hi. I haven't visited my mom in ages and I miss her so much!\",\n\"System: Oh, I see. I'm sure she misses you too!\",\n\"User: I'm looking to visit her this Wednesday as I would finally be able to take leave from my work.\"",
    "gen_sit": "I haven't visited my mom in ages and I miss her so much! I'm looking to visit her this Wednesday as I would     finally be able to take leave from my work."
  },
  "PMUL1517": {
    "exchange": "'User: Hi. My friend has invited me to his house for a housewarming!',\n'System: Wow, that sounds exciting! Is that a new apartment?',\n\"User: Yes, it is! He lives in Broxbourne and has finally saved up enough for a new apartment! I'm so proud of him!\"",
    "gen_sit": "My friend has invited me to his new apartment in Broxbourne for a housewarming."
  },
  "MUL1603": {
    "exchange": "\"User: Hi! I'm recently hosting some guests from overseas!\",\n'System: Oh, are you a tour agent?',\n'User: Yes, I am! I help to arrange city tours for all different tourists!',\n'System: Wow, that sounds exciting!',\n\"User: I sure do love my job. The guests this time have requested to dine at La Raza specifically. I'm trying my best to arrange it.\"",
    "gen_sit": "I am a tour agent and I recently have guests from overseas. They have requested to dine at La Raza and I'm trying my best to arrange it."
  },
  "PMUL0601": {
    "exchange": "\"User: Hi. I've finally been able to get tickets for this famous musical this weekend!\",\n'System: You sure seem excited! Are you a fan of operas?',\n\"User: Yes, I am a huge fan. But sadly, London Liverpool street where I stay doesn't have any theatres.\"",
    "gen_sit": "I've finally managed to get tickets for a famous musical this weekend! I'm a huge fan of operas, but sadly,     London Liverpool Street where I stay doesn't have any theatres."
  },
  "PMUL4826": {
    "exchange": "\"User: Hi. I've recently sent my applications to multiple colleges.\",\n'System: Have you just graduated?',\n'User: Yes, I just finished high school last month! I hope I get accepted into my dream college.',\n'System: I wish you the best of luck!',\n'User: I sure need all the luck I can get. Magdalene college sure is hard to get in.'",
    "gen_sit": "I've recently sent my applications to multiple colleges. I just finished high school last month and hope to get     accepted into my dream college, Magdalene College. It's known to be quite difficult to get accepted into."
  },
  "PMUL3200": {
    "exchange": "'User: Hi. My son has just graduated high school and received his SAT results!',\n'System: Congratulations! You must be so proud of him.',\n'User: I sure am. Now, he is looking to visit some colleges before he sent his applications in. I hope he chooses one that he likes.'",
    "gen_sit": "My son has just graduated high school and received his SAT results. He is looking to visit some colleges before he sends in his applications. I hope he chooses one that he likes."
  },
  "PMUL1951": {
    "exchange": "\"User: Hi. It's Thanksgiving soon and I can't wait to visit my parents this holiday.\",\n\"System: I'm sure you will enjoy the holidays.\",\n\"User: Yes, I miss my mom's cooking so much. I can't wait to celebrate the holidays with them!\",\n\"System: Seems like she's a great cook!\",\n\"User: Nothing beats home-cooked food. I'll travel all the way to Leicester for that.\"",
    "gen_sit": "It's Thanksgiving soon and I can't wait to visit my parents this holiday. I miss my mom's cooking so much and     nothing beats home-cooked food. I'll travel all the way to Leicester for that."
  },
  "MUL1888": {
    "exchange": "\"User: Hi. I'm going on a short trip with my best friend next week!\",\n'System: Wow, that sounds exciting!',\n\"User: Yes, I sure am excited about it! We haven't been overseas for ages.\",\n\"System: I'm sure you will enjoy yourselves very much this time.\",\n\"User: I sure do hope we have a great time in Cambridge. I want to do some shopping there and most importantly see all the famous attractions. I've read so much about it online!\"",
    "gen_sit": "I'm going on a short trip with my best friend next week! We haven't been overseas for ages and we're planning to visit Cambridge. I'm looking forward to shopping and seeing all the famous attractions."
  },
  "MUL0663": {
    "exchange": "\"User: Hello. I'm in the midst of planning my trip next week!\",\n'System: Oh, sounds interesting!',\n\"User: I'm traveling together with my husband and my daughter for the first time in 5 years.\",\n'System: Wow, that sure has been a long time.',\n'User: Actually, my husband wanted to visit London Liverpool street. He saw online that it is a beautiful place.'",
    "gen_sit": "I'm in the midst of planning my trip next week! I'm traveling together with my husband and my daughter for the first time in 5 years. My husband wanted to visit London Liverpool Street as he saw online that it is a beautiful place."
  },
  "SNG0670": {
    "exchange": "\"User: Hi. I'm having a reunion dinner with my college friends!\",\n'System: Wow, that sounds like a great time for you guys to catch up.',\n\"User: Yes, we haven't seen each other in 2 years, since we are all busy with our lives.\",\n'System: 2 years sure is a long time.',\n'User: It is. Now that we all are working adults, we are looking to dine in at an Italian restaurant.'",
    "gen_sit": "I'm having a reunion dinner with my college friends! We haven't seen each other in 2 years, since we are all busy     with our lives. Now that we all are working adults, we are looking to dine in at an Italian restaurant."
  },
  "MUL1854": {
    "exchange": "'User: Hi. I have to visit my dad as soon as possible.',\n\"System: You sound urgent. What's the matter?\",\n\"User: He is sick and I'm really worried about him.\",\n'System: Oh, I see. That sure is an important matter.',\n\"User: Yes, but sadly I live at birmingham new street which is pretty far from him. I can't visit him as often as I'd like to.\"",
    "gen_sit": "I have to visit my dad as soon as possible. He is sick and I'm really worried about him. I live at Birmingham New Street which is pretty far from him. I can't visit him as often as I'd like to."
  },
  "PMUL2320": {
    "exchange": "\"User: Hi. This semester, I've been tasked with a very difficult project.\",\n'System: Oh, what is it about?',\n'User: I have to write a research paper about general history.',\n'System: Wow, that sounds like a difficult task.',\n\"User: Yes, it is. I'll like to get a head start on my paper, so I'm looking to go to a museum today. I hope I get a good grade for it.\"",
    "gen_sit": "I have been tasked with a difficult project this semester. I have to write a research paper about general history. I'm planning to visit a museum today to get a head start on my research, and I hope to get a good grade for it."
  },
  "PMUL3464": {
    "exchange": "\"User: Hi. I'm a blogger and I've recently been really interested in food.\",\n'System: Wow, that sure is an interesting job.',\n'User: Yes, I love my job so much. I get to share all the good things with others!',\n\"System: I'm sure everyone appreciates your reviews.\",\n'User: I sure do hope so. I want to try some fusion food for my next recommendation blog post.'",
    "gen_sit": "I am a blogger and have recently been really interested in food. I love my job and want to try some fusion food for my next recommendation blog post."
  },
  "MUL0244": {
    "exchange": "\"User: Hi. I haven't seen a movie in a long time.\",\n'System: Oh, have you been really busy?',\n\"User: Yes, my work has been piling up forever. There is a new movie released recently. I heard that it's good.\",\n\"System: I heard that it's good too!\",\n\"User: I'll be sure to catch it when I visit Cambridge next week then. It's the only off day I have.\"",
    "gen_sit": "I haven't seen a movie in a long time because my work has been piling up forever. There is a new movie released     recently. I heard that it's good. I'll be sure to catch it when I visit Cambridge next week then. It's the only off day I have."
  },
  "SNG0551": {
    "exchange": "'User: Hi. My friend from overseas is coming to visit me this weekend.',\n\"System: I see. What's the occasion?\",\n\"User: She recently got married and she's traveling for her honeymoon trip!\",\n'System: Congratulations to her!',\n'User: Thank you. She wants to try the dishes at city stop restaurant. She said that she read really good reviews about it online!'",
    "gen_sit": "My friend from overseas is coming to visit me this weekend. She recently got married and is traveling for her     honeymoon trip. She wants to try the dishes at City Stop Restaurant, which she read has good reviews online."
  },
  "MUL1589": {
    "exchange": "'User: It was a really productive week in Cambridge.',\n'System: Glad to hear that. Perhaps time for a break?',\n\"User: Definitely. I need to reward myself with a good ol' treat.\",\n\"System: It's good to pamper yourself once in a while.\",\n\"User: I couldn't agree more.\"",
    "gen_sit": "I had a productive week in Cambridge. I believe it's time for a break and I'm thinking of rewarding myself with a treat.     I couldn't agree more."
  },
  "PMUL2306": {
    "exchange": "'User: My pen pal finally wrote back to me.',\n'System: Oh is that so? What did she say?',\n'User: She was telling me about her experience while she was here in Cambridge.',\n'System: Oh cool.',\n\"User: Turns out, she went to this place called mumford theatre. I can't believe I've never heard of it.\",\n\"System: In your defense, it's impossible to know everything.\",\n'User: Now that is true. I feel like I should visit that place too before writing back.'",
    "gen_sit": "My pen pal finally wrote back to me. She told me about her experience while she was here in Cambridge.     She went to a place called Mumford Theatre, which I haven't heard of. Now I feel like I should visit that place too     before writing back."
  },
  "MUL0368": {
    "exchange": "'User: The weather in Cambridge sure is amazing.',\n'System: At this time of year? Definitely.',\n'User: To be honest, I wish I lived here.',\n'System: You could always move.',\n\"User: That's not an option for me. I have to stay close to my parents to take care of them. It's just too far.\"",
    "gen_sit": "I wish I lived in Cambridge because the weather is amazing, but I can't move there because I have to stay close to my parents to take care of them."
  },
  "MUL0489": {
    "exchange": "'User: I normally really dread Mondays but this time, its different.',\n'System: Oh is that so?',\n\"User: Yup! I'm going to visit my friend.\",\n\"System: That's dope!\",\n\"User: I can't wait oh my gosh.\"",
    "gen_sit": "I normally dread Mondays, but this time it's different because I'm going to visit my friend. I'm very excited     about it."
  },
  "PMUL1400": {
    "exchange": "'User: Time really flies.',\n\"System: Yes it does, more so if you're enjoying yourself.\",\n\"User: I wouldn't say that. More like I'm really busy.\",\n'System: I see. You should really take a break once in a while.',\n'User: Agreed. My friend is getting married at a lovely chapel in Peterborough. I guess attending the wedding counts as a break.',\n\"System: I wouldn't say so, but if you insist.\",\n'User: Well in that case, I could always just relax before the event.'",
    "gen_sit": "I'm really busy. My friend is getting married at a lovely chapel in Peterborough. I could always just relax before the event."
  },
  "MUL1503": {
    "exchange": "'User: My my the number of Covid cases around stansted airport is quite worrying.',\n\"System: There are a lot of travelers entering and leaving so it's to be expected.\",\n'User: Even so, it is rather scary.',\n\"System: It is indeed. I'm sure the authorities are doing their best.\",\n\"User: I'd hope so.\"",
    "gen_sit": "There are a lot of Covid cases around Stansted Airport, which is quite worrying. Even so, it is rather scary.     The authorities are doing their best."
  },
  "MUL0598": {
    "exchange": "'User: I wonder what Norwich is like this time of year.',\n'System: Pretty splendid if I dare say so myself.',\n\"User: That's good to know. Have you been there?\",\n'System: Once. It was utterly amazing!',\n\"User: Look at what you've gone and done. Now I'm all hyped up.\"",
    "gen_sit": "I wondered what Norwich is like this time of year. I've been told it's pretty splendid. I'm now hyped up     about visiting."
  },
  "MUL0985": {
    "exchange": "'User: Wow I got into Magdalene College.',\n\"System: That's great news! Is that your first choice?\",\n'User: It sure is!'",
    "gen_sit": "I got into Magdalene College, which is my first choice."
  },
  "MUL1415": {
    "exchange": "\"User: Suddenly there's so much hype surrounding Catalan food.\",\n'System: Hmm curious.',\n\"User: One day it just kept popping up on all my social media feeds. Apparently it's trending?\",\n\"System: I didn't know food could be a trend.\",\n'User: It caught me by surprise too! Now I want to try it out myself.'",
    "gen_sit": "Suddenly, there's a lot of hype surrounding Catalan food. It's been popping up on all my social media feeds and     apparently it's trending. I'm interested in trying it out myself."
  },
  "SNG1055": {
    "exchange": "'User: For history nerds, there is nothing better than going to a museum.',\n'System: Have to agree with that.',\n\"User: My sister falls in that category. So, since she's coming to visit in a couple days, we might check out some places.\",\n'System: Good move.',\n'User: I should probably search for some good ones to see.'",
    "gen_sit": "My sister, a history nerd, is visiting me in a couple of days. I'm considering taking her to a museum. I should probably search for some good ones to see."
  },
  "PMUL0687": {
    "exchange": "'User: Hi! It’s finally the holidays and I can’t wait to travel!',\n'System: This sure is a great time to take a break!',\n'User: Yes, I’m so excited! I have to visit all the famous attractions and have so much fun!',\n'System: Wow, you sure sounds excited!',\n'User: I am! I can’t wait to leave this weekend.  I also want to try the food at Michaelhouse Cafe. My friend told me that their dishes are absolutely fabulous!'",
    "gen_sit": "I'm so excited for the holidays! I can't wait to travel, visit all the famous attractions, and have so much fun!     I'm planning to leave this weekend and try the food at Michaelhouse Cafe. My friend told me that their dishes are absolutely fabulous!"
  },
  "MUL0032": {
    "exchange": "'User: Hi! I’m hosting some of my high school friends this weekend!',\n'System: Oh, that sounds cool!',\n'User: Yes, they’re coming from another city for a short stopover this weekend!',\n'System: I’m sure you will have a great time with them!',\n'User: I sure do hope so. They’ve told me that they want to try some French food here! I’ll try my best to arrange.'",
    "gen_sit": "I'm hosting some of my high school friends this weekend! They're coming from another city for a short stopover     this weekend and want to try some French food here. I'll try my best to arrange."
  },
  "PMUL0036": {
    "exchange": "'User: Hi. My parents in law from vietnam are coming to visit this summer!',\n'System: Wow, that sounds exciting! Has it been a long time since you’ve met them?',\n'User: Yes, it sure has. My wife misses them a lot.',\n'System: I’m sure she does. It’s hard living so far from her parents.',\n'User: I’m looking to bring them to a vietnamnese restaurant! I hope they like it.'",
    "gen_sit": "My parents-in-law from Vietnam are coming to visit this summer! It's been a long time since we've seen them. My wife misses them a lot. I'm planning to take them to a Vietnamese restaurant, I hope they like it."
  },
  "PMUL2970": {
    "exchange": "'User: Time to add other places to the list! All the restaurants have been settled!',\n'System: What do you mean?',\n'User: Haha, having a trip soon, and planning the itinerary. Was thinking of what else to add...',\n\"System: Somewhere you've never been to?\",\n\"User: I know! We haven't been to a museum in ages! Let's find one!\"",
    "gen_sit": "I'm planning a trip and have settled on restaurants. I'm now considering adding a museum to the itinerary     since I haven't been to one in ages."
  },
  "MUL1433": {
    "exchange": "'User: How I wish they provided more information...',\n\"System: What's going on?\",\n\"User: Read online about some nice looking food, but can't seem to find out where it is...\",\n'System: Oh dear...',\n'User: Hmm. Ever heard of Tang Chinese? Seems like they have fantastic food over there!'",
    "gen_sit": "I wish they provided more information... I read online about some nice looking food, but can't seem to find out     where it is... Ever heard of Tang Chinese? They have fantastic food over there!"
  },
  "MUL1858": {
    "exchange": "'User: Gotta get back to taking some photos!',\n'System: Why is that?',\n\"User: Haha. Haven't been doing so for couple of weeks. Don't wanna get rusty.\",\n\"System: That's wise of you!\",\n'User: Wonder what shall I shoot this time? Perhaps some architecture? My favourite subject!'",
    "gen_sit": "I haven't been taking photos for a couple of weeks and I don't want to get rusty. I'm thinking of shooting some architecture, my favorite subject."
  },
  "MUL0229": {
    "exchange": "'User: Too bad we need to go back soon...',\n'System: What is wrong?',\n\"User: I have work coming up soon after this trip, so we can't stay any longer.\",\n'System: Oh, I am sorry to hear that.',\n\"User: Haha. It's all good. Had a really fantastic time here, so we'll be back before long! Now, back home to Cambridge!\"",
    "gen_sit": "I have work coming up soon after this trip, so we can't stay any longer. Had a really fantastic time here, so we'll be back before long! Now, back home to Cambridge!"
  },
  "PMUL3728": {
    "exchange": "'User: Feel like having something more steamed to eat this time...',\n'System: Why is that?',\n'User: Haha. Have been eating quite some fried stuff last few days, so felt like changing it up a bit.',\n'System: Good choice, especially for your health!',\n\"User: Hmm. Seems like some Chinese food would be perfect for our coming meet up! Can't wait!\"",
    "gen_sit": "I've been eating a lot of fried food lately and I'm craving something steamed. I'm thinking of having Chinese food for my upcoming meet up."
  },
  "MUL2489": {
    "exchange": "'User: Must be nice to be able to travel for business...',\n'System: Why would you say that?',\n\"User: You get visit new places, and usually food and other expenses are paid for! What's not to love?\",\n'System: It does sound pretty good!',\n'User: Haha, my friend ate at The Nirala while on business not too long ago, and recommended it!'",
    "gen_sit": "I wish I could travel for business... It must be nice to visit new places and have expenses paid for! My friend     recommended The Nirala, a restaurant they ate at while on business."
  },
  "MUL1676": {
    "exchange": "'User: Boy am I glad to have the budget for this!',\n'System: What is it?',\n'User: I love to go around trying good food, which can turn out to be expensive some times...',\n'System: I know right?',\n\"User: Read online about this place, Clowns Cafe, and it's the next on my list!\"",
    "gen_sit": "I'm glad to have the budget for this! I love to go around trying good food, which can turn out to be expensive     sometimes. I've read online about this place, Clowns Cafe, and it's the next on my list!"
  },
  "PMUL3974": {
    "exchange": "'User: Really satisfied with the variety of food around here!',\n'System: Why is that?',\n'User: I had to eat the same cuisine for months at a time the last place I was posted to, so it got a bit boring...',\n'System: I am sorry to hear that.',\n\"User: It's all good now! Wonder what shall it be this time? Maybe Indian? Haven't ate that in awhile...\"",
    "gen_sit": "I recently moved to a new place and I'm really satisfied with the variety of food around here. The last place I was posted to had limited food options and it got boring. Now, I'm excited to try different cuisines again, maybe Indian this time."
  },
  "MUL0702": {
    "exchange": "'User: Hi. I’m taking a short trip with my husband this weekend!',\n'System: Oh, that sounds exciting!',\n'User: Yes, we haven’t been on a trip since forever!',\n'System: This sounds like a great time for you guys to have some fun!',\n'User: I sure would at Cambridge. I’ve heard that it’s a beautiful city!'",
    "gen_sit": "I'm taking a short trip with my husband this weekend! It's been a while since we've been on a trip together.     I've heard that Cambridge is a beautiful city and I'm excited to visit."
  },
  "PMUL4244": {
    "exchange": "'User: Hello! I’ve been stuck at home for so long! I can’t wait to go out again!',\n'System: Oh, you sure sounds excited!',\n'User: Yes, I am! I feel like going to a nightclub with my friends to have some fun!'",
    "gen_sit": "I've been stuck at home for so long and I can't wait to go out again! I feel like going to a nightclub with my     friends to have some fun!"
  },
  "MUL0819": {
    "exchange": "'User: Hi! My cousin is finally coming to visit me!',\n'System: You sound excited! Are you guys very close?',\n'User: Yes, we grew up together! She has been my partner in crime!',\n'System: I sure am envious if your relationship!',\n'User: I am really thankful for her too! We would like to have some australasian food this time!\\nIt’s the cuisine both of us haven’t had before!'",
    "gen_sit": "My cousin, who I grew up with and consider a partner in crime, is finally coming to visit me! We're excited to try Australasian food together, as it's a cuisine we've never had before."
  },
  "MUL0047": {
    "exchange": "'User: Hello! I’m a food stylist and I’m looking to photograph some new pictures for a client!',\n'System: Wow, that sounds like an exciting job! Do you love food?',\n'User: Yes! I am a food lover. I’m so lucky to be able to have a hobby as a job.',\n'System: I sure am envious of you!',\n'User: Recently I’ve been tasked to photograph some Welsh food. It’s an interesting project.'",
    "gen_sit": "I am a food stylist and I'm looking to photograph some new pictures for a client. I love food and I'm so lucky to have a hobby as a job. Recently, I've been tasked to photograph some Welsh food. It's an interesting project."
  },
  "MUL1636": {
    "exchange": "\"User: Can't wait to go out later this week!\",\n'System: I am happy for you!',\n'User: Thanks! Especially since I have been busy working most of these last few days!',\n'System: Hope you got somewhere fun planned!',\n'User: Hmm. Still got some some arrangements to make for this Sunday.'",
    "gen_sit": "I can't wait to go out later this week! I've been busy working most of these last few days. I still have some     arrangements to make for this Sunday."
  },
  "PMUL1186": {
    "exchange": "'User: Wonder where shall I visit next?',\n'System: Hehe. Any particular idea in mind?',\n'User: Haha. I still have some places to see on my list, but they all seem equally exciting to me!',\n\"System: That's a good thing right?\",\n'User: Definitely! You know what, I will go with Hughes Hall first. Just have to start somewhere...'",
    "gen_sit": "I'm considering where to visit next. I have a list of places I'd like to visit, but I'm having trouble deciding     between them. I've decided to start with Hughes Hall."
  },
  "SNG0730": {
    "exchange": "\"User: Can't wait to chat with my family over dinner again!\",\n'System: I am happy for you!',\n\"User: Haha. There's so much to catch up! Haven't met in some time...\",\n'System: Ooh, sounds great!',\n'User: Perhaps it would be a great idea to eat at one of the Chinese restaurants this time? Been some time since we last went!'",
    "gen_sit": "I am excited to chat with my family over dinner again! Haven't met in some time... Perhaps it would be a great idea to eat at one of the Chinese restaurants this time? Been some time since we last went!"
  },
  "SNG01284": {
    "exchange": "'User: Hi! I have a very urgent matter to attend to.',\n'System: Oh, it sure sounds important!',\n'User: Actually, my dad was recently admitted to the hospital.',\n'System: Oh no, hope he is feeling better now.',\n'User: I’m so worried about him. I’ll have to leave bishops stortford as soon as possible to go and visit him.'",
    "gen_sit": "I have a very urgent matter to attend to. My dad was recently admitted to the hospital and I'm worried about him. I'll have to leave Bishops Stortford as soon as possible to go and visit him."
  },
  "MUL0082": {
    "exchange": "'User: Hello! I’m going on a trip next week!',\n'System: Wow, sounds exciting!',\n'User: Yes, I can’t wait to visit all the attractions! But first, I have to come up with an itinerary.',\n'System: Oh, I see. What do you have in mind?',\n'User: I heard that Golden House serves amazing food! I’m planning to stop by there for lunch.'",
    "gen_sit": "I'm going on a trip next week and I can't wait to visit all the attractions! I'm planning to stop by Golden House for lunch because I heard they serve amazing food!"
  },
  "SNG0736": {
    "exchange": "'User: Hi! Recently I’ve been craving all kinds of cuisines!',\n'System: Oh, are you a food lover?',\n'User: I sure do love trying all kinds of cuisines!',\n'System: How coincidental! I’m also a food lover too!',\n'User: I see, food sure brings me a sense of happiness! My friend told me about Pizza Express Fen Ditton. They serve amazing food there that I have to try!'",
    "gen_sit": "I've been craving all kinds of cuisines lately. My friend recommended Pizza Express Fen Ditton, which serves amazing food.     I'm excited to try it out!"
  },
  "MUL2268": {
    "exchange": "'User: Hi! It’s my dad’s birthday soon and I’m thinking of surprising him!',\n'System: You sure are a filial child.',\n'User: I try my best to make him happy! I’m bringing him on a short trip!',\n'System: I’m sure he would love it!',\n'User: I sure do hope so. Since he loves football, we’re going to London Liverpool street! I hope he would be surprised.'",
    "gen_sit": "I want to surprise my dad for his birthday. I'm bringing him on a short trip to London Liverpool Street,     since he loves football. I hope he'll be surprised."
  },
  "PMUL4850": {
    "exchange": "'User: Hello! I’m finally having a girls day out with my best friend!',\n'System: That sure sounds fun!',\n'User: Yes, we are going to do some shopping and also visit some places.',\n'System: Sounds like a blast!',\n'User: Yes, we also want to go to lynne strover gallery since we both love art so much. I also want to buy a few pieces for my new house!'",
    "gen_sit": "I'm finally having a girls day out with my best friend! We're going to do some shopping and visit some places. We also want to visit the Lynne Strover Gallery because we both love art so much. I also want to buy a few pieces for my new house!"
  },
  "PMUL2880": {
    "exchange": "'User: Hello! It’s my 21st birthday next week and I’m planning my birthday party!',\n'System: Happy birthday to you!',\n'User: Thank you. I’m thinking about going to a nightclub after having a sumptuous dinner! How does that sound? I hope my friends like it.'",
    "gen_sit": "It's my 21st birthday next week and I'm planning my birthday party! I'm thinking about going to a nightclub after having a sumptuous dinner!"
  },
  "SNG02077": {
    "exchange": "'User: Hi! I’ve been feeling rather lethargic lately.',\n'System: Oh no. Is there something wrong?',\n'User: I’ve just been really busy with work.',\n'System: I see. I’m sure you need some rest time.',\n'User: Yes, that’s why I’m here at Riverboat Georgina today. I managed to do some exercising!'",
    "gen_sit": "I've been feeling rather lethargic lately because I've been really busy with work. I'm here at Riverboat     Georgina today and managed to do some exercising."
  },
  "MUL1988": {
    "exchange": "'User: Hi! I’m feeling rather unhealthy lately!',\n'System: Oh, I see why is it so?',\n'User: I haven’t been working out for a long time.',\n'System: Oh no. Maybe you need more time for yourself!',\n'User: I sure do think so too! That’s why I’m looking to go for a hike at Cambridge University Botanic Gardens soon!'",
    "gen_sit": "I'm feeling rather unhealthy lately because I haven't been working out for a long time. I'm looking to go for a hike at Cambridge University Botanic Gardens soon!"
  },
  "SNG0406": {
    "exchange": "\"User: I hope the trains aren't too crowded this weekend...\",\n'System: Why would you say that?',\n\"User: I need to attend an interview for job next week. It's far, so I am travelling down earlier.\",\n'System: I see. Hope it goes well!',\n\"User: Definitely! Being such important interview, I don't even mind travelling this Sunday!\"",
    "gen_sit": "I have an interview for a job next week that is quite far away, so I'm traveling down earlier to avoid the crowds     this weekend. It's an important interview, and I'm willing to travel on a Sunday to make sure I'm prepared."
  },
  "PMUL0958": {
    "exchange": "\"User: Hi. It's the summer holidays soon and I'm so excited to travel!\",\n'System: You sure do sound excited. Do you love traveling?',\n\"User: I sure do! I just love exploring all the different cities! I'm still deciding where should I go this time!\",\n\"System: You should try visiting some places that you haven't been to before!\",\n\"User: Hmm, that's a great idea! I think I can go to Leicester.\"",
    "gen_sit": "I'm excited for the summer holidays and I love traveling! I'm still deciding where to go this time, but I'm considering     Leicester."
  },
  "SNG0344": {
    "exchange": "'User: Hi. I have a very important meeting coming up.',\n'System: Oh, what is it about?',\n\"User: It's for a client in my company. But, I'll have to travel for the meeting.\",\n'System: I see, that sure sounds important.',\n\"User: Yes, it is. I'll have to go to meet the client from Leicester! I hope I do well for it.\"",
    "gen_sit": "I have an important meeting coming up with a client in my company. I'll have to travel to Leicester for the meeting.     I hope I do well for it."
  },
  "MUL0398": {
    "exchange": "\"User: Hi. I'm bringing my family out this weekend for a short trip!\",\n'System: Oh, that sounds fun!',\n\"User: Yes, we haven't been out in so long! I hope we would be able to have some family bonding time.\",\n'System: Family time sure is important!',\n'User: We often like to visit London Liverpool street there are just so much to see there!'",
    "gen_sit": "I'm bringing my family out this weekend for a short trip. We haven't been out in so long and hope to have some family bonding time. We often like to visit London Liverpool Street as there are just so much to see there!"
  },
  "SNG01962": {
    "exchange": "\"User: Can't wait to eat that braised duck again...\",\n'System: Ooh, mind telling me more?',\n'User: Peking braised duck. The meat is usually so tender and flavourful!',\n'System: Sounds delicious!',\n\"User: Haha. I know right? And it's so close! I'll be able to taste that the Peking restaurant later!\"",
    "gen_sit": "I'm looking forward to eating Peking braised duck, which is known for its tender and flavourful meat. It's conveniently located near me, and I'll be able to enjoy it later at the Peking restaurant."
  },
  "MUL2366": {
    "exchange": "\"User: Hi! It's the summer holidays and I'm looking to bring my young nieces and nephews for a day out!\",\n'System: Wow, that sure sounds fun!',\n'User: Yes, as they are stuck in school all day, I hope that a field trip would benefit them.',\n\"System: I'm sure they would learn a lot from the experience.\",\n\"User: I sure do hope so. Since they do not know much about history, I'm bringing them to whipple museum of the history of science. I hope they would be able to widen their knowledge there.\"",
    "gen_sit": "It's the summer holidays and I'm looking to bring my young nieces and nephews for a day out! I hope to bring them to the Whipple Museum of the History of Science as they are stuck in school all day and I believe they would benefit from a field trip and learn a lot from the experience."
  },
  "MUL2092": {
    "exchange": "'User: Hi. I have to visit a library this week!',\n'System: Oh, is there a book you would like to borrow?',\n'User: Yes, I have an important research paper to complete.',\n'System: I see. It sure sounds like a difficult one.',\n\"User: Sadly, I'll have to go out of town to complete my paper as there isn't a library here in Birmingham New Street. I'll have to take a day trip. I hope I get a good grade for it.\"",
    "gen_sit": "I have to visit a library this week to complete an important research paper. Unfortunately, I'll have to take a day trip out of town to complete it as there isn't a library in Birmingham New Street. I hope I get a good grade for it."
  },
  "PMUL1650": {
    "exchange": "'User: I hope there is enough time for us to travel there...',\n\"System: Where's it gonna be?\",\n\"User: Haha. Have planned lots to see on Thursday, just hope we didn't bite off more than what we can chew...\",\n'System: Better to plan everything properly then!',\n\"User: I know right? Can't wait to finally see Cambridge again after so long! You know what? We haven't been back since our university days.\"",
    "gen_sit": "I hope there's enough time for us to travel there. We've planned a lot to see on Thursday, but I hope we haven't bitten off more than we can chew. I can't wait to finally see Cambridge again after so long! We haven't been back since our university days."
  },
  "MUL0425": {
    "exchange": "'User: Hi! I would like to bring my newborn out for a short trip! I hope she likes it.',\n'System: I see, how old is she?',\n'User: She is only 1 year old! I want to expose her more to mother nature and breathe in some fresh air!',\n'System: That sure is healthy for her.',\n\"User: Yes, I've heard that there are multiple national parks in broxbourne. I want to bring her there!\"",
    "gen_sit": "I want to bring my 1-year-old newborn out for a short trip to expose her to mother nature and breathe in some fresh air. I've heard that there are multiple national parks in Broxbourne and want to bring her there."
  },
  "PMUL0207": {
    "exchange": "\"User: Hi! I'll be finally going back to the office after taking a long break!\",\n'System: I hope you have enjoyed your break!',\n\"User: I sure did. It helped me to unwind and relax, but I've been home a lot myself. Going back to the office makes me crave some Greek food.\"",
    "gen_sit": "I'll be finally going back to the office after taking a long break! I've been home a lot myself and crave some Greek food."
  },
  "SNG0463": {
    "exchange": "\"User: Hi! It's my wife's birthday soon!\",\n'System: Wow, what do you have in store for her?',\n\"User: I'm still deciding where to bring her. But I'll definitely bring her for dinner!\",\n\"System: I'm sure she would love it!\",\n\"User: She loves greek food as she's lived in Greece when she was young. She always mentioned that the food there is amazing. I hope she would be happy to try some on her birthday.\"",
    "gen_sit": "My wife's birthday is coming up and I'm deciding where to bring her. She loves Greek food, having lived in Greece when she was younger, and I'm hoping to find a great Greek restaurant to take her to for dinner."
  },
  "SNG01206": {
    "exchange": "'User: Hello! I recently have a project that I would have to complete.',\n'System: I see, what is it about?',\n\"User: It's about archaeology!\",\n'System: That sounds interesting! Is that your major?',\n\"User: Yes, I love exploring all the different caves. But for this project, I'll have to gather information from Museum of Classical Archaeology.\"",
    "gen_sit": "I recently have a project that I would have to complete. It's about archaeology, which is my major and I love     exploring all the different caves. I'll have to gather information from Museum of Classical Archaeology."
  },
  "SNG02071": {
    "exchange": "'User: I never knew I could learn so much just by reading some blogs!',\n\"System: The more you learn, the better isn't it?\",\n'User: Haha. I guess I have always been used to reading travels guides to find new places, but the other day I found some interesting dining places online!',\n'System: Mind telling me more?',\n'User: Heard of Cotto? I would love to try their intriguing dishes.'",
    "gen_sit": "I never knew I could learn so much just by reading some blogs! I've always been used to reading travel guides to find new places, but the other day I found some interesting dining places online! I'd love to try Cotto's intriguing dishes."
  },
  "SNG01504": {
    "exchange": "'User: Hi! My cousin has just recently moved into her dorm!',\n'System: Oh, is she a college student?',\n'User: Yes, she just entered college last month! She invited me to visit her during my summer holidays!',\n'System: I see. I hope you have fun with her!',\n\"User: She's very smart! She managed to major in Biology at sidney sussex college. I sure am excited to visit her.\"",
    "gen_sit": "My cousin has just moved into her college dorm. She's a college student at Sidney Sussex College, majoring in Biology. I'm excited to visit her during my summer holidays."
  },
  "PMUL0936": {
    "exchange": "\"User: Hi! I've finally managed to get tickets for this famous rugby match!\",\n'System: Wow, are you a fan?',\n\"User: Yes, I sure am a fan of this team! I'm so excited to be able to watch them in Cambridge with my friends!\"",
    "gen_sit": "I have finally managed to get tickets for a famous rugby match. I'm a fan of the team and I'm excited to watch     them in Cambridge with my friends."
  },
  "PMUL1057": {
    "exchange": "'User: Hi! My friend is coming to visit me this weekend!',\n'System: Sounds like a hearty reunion!',\n\"User: Yes, I missed her a lot. However, I'm in a dilemma on where should I bring her to?\",\n'System: Hmm, that sure is something to ponder about. What does she like?',\n\"User: Oh, that reminds me! She's an art lover. I'm sure she would love to go to a local museum.\"",
    "gen_sit": "My friend is coming to visit me this weekend! I'm in a dilemma on where should I bring her to. She's an art lover,     I'm sure she would love to go to a local museum."
  },
  "SNG01184": {
    "exchange": "'User: Hi! I have some friends from overseas coming to visit this summer!',\n'System: Oh, that sounds exciting! Where are they from?',\n\"User: They're from Thailand!\",\n'System: I see! How did you meet them then?',\n\"User: I used to live in Thailand when I was young! I'm looking to bring them to a thai restaurant. I hope they would enjoy the food there.\"",
    "gen_sit": "I have some friends from Thailand coming to visit this summer! I used to live in Thailand when I was young and I'm looking to bring them to a Thai restaurant. I hope they would enjoy the food there."
  },
  "SNG01935": {
    "exchange": "\"User: Hi! It's finally my off day tomorrow!\",\n'System: You sound excited! What do you have planned?',\n\"User: I want to go for a good breakfast! I've been looking forward to trying carolina bed and breakfast, the place down the street from my house.\"",
    "gen_sit": "I have a day off tomorrow and I'm excited! I'm planning to go for a good breakfast at Carolina Bed and Breakfast,     the place down the street from my house."
  },
  "SNG02346": {
    "exchange": "\"User: Can't wait to get back home!\",\n'System: I am happy for you! Any plans?',\n'User: Thanks! Wait till my family sees all these nice souvenirs I got for them!',\n'System: Hope they love them!',\n'User: Wonder how has Cambridge changed? Been awhile since I was last home...'",
    "gen_sit": "I can't wait to get back home! I've got some nice souvenirs for my family. It's been a while since I was last home...     I wonder how Cambridge has changed."
  },
  "MUL0995": {
    "exchange": "\"User: Hi! I've recently been really into cycling!\",\n'System: Oh, that is an interesting hobby.',\n\"User: I've been gaining weight lately and took on cycling as a form of exercise. I've been really loving it so far!\",\n\"System: That's great news! It's important to stay active.\",\n\"User: Yes, it's important to stay healthy! I'm looking for parks where I can cycle at.\"",
    "gen_sit": "I've recently taken up cycling as a form of exercise to lose weight. I'm looking for parks where I can cycle."
  },
  "PMUL2841": {
    "exchange": "\"User: Hi! My mom is coming to visit me this weekend! I'm still pondering about where I should bring her to.\",\n'System: What are her hobbies?',\n\"User: Oh, she loves art. She's an artist!\",\n\"System: Seems like she's an art lover.\",\n'User: Yes, she sure is. She sells her pieces online too! Hmm, I should bring her to a museum then!'",
    "gen_sit": "My mom is coming to visit me this weekend! She loves art and is an artist herself. I'm planning to bring her to a museum."
  },
  "PMUL3397": {
    "exchange": "\"User: Hi! I've heard that a really good film has just been released recently.\",\n'System: Oh really, what film is that?',\n\"User: It's a family movie produced by a famous director!\",\n'System: I see, I should catch it sometime.',\n\"User: Yes, I'm so excited to watch it at the cinema when it releases soon!\"",
    "gen_sit": "I've heard that a really good film has just been released recently. It's a family movie produced by a famous     director and I'm so excited to watch it at the cinema when it releases soon!"
  },
  "MUL1934": {
    "exchange": "\"User: Hi. It's been a really long time since I've traveled with my husband.\",\n'System: Oh, I see, are you both very busy with work?',\n'User: Yes, we are. The hectic city life sure demands a lot from us.',\n'System: I sure do understand how you feel.',\n\"User: I believe we need a well-deserved trip to Norwich! It's my favorite city and it's where we first met!\"",
    "gen_sit": "I haven't traveled with my husband in a long time. We're both very busy with work and the hectic city life     demands a lot from us. I believe we need a well-deserved trip to Norwich, my favorite city and where we first met."
  },
  "PMUL4109": {
    "exchange": "\"User: Hi! I've recently started attending college!\",\n'System: I see, which major are you in?',\n\"User: Since I love sketching buildings, I'm in architecture.\"",
    "gen_sit": "I've recently started attending college, majoring in architecture since I love sketching buildings."
  },
  "SNG0651": {
    "exchange": "\"User: Hi! It's my 3rd anniversary with my girlfriend this weekend!\",\n'System: Wow, congratulations!',\n\"User: Thank you. I'm preparing a feast at a british restaurant for her! I'm looking to buy some flowers too!\"",
    "gen_sit": "It's my 3rd anniversary with my girlfriend this weekend! I'm preparing a feast at a British restaurant for her!     I'm looking to buy some flowers too!"
  },
  "PMUL0959": {
    "exchange": "\"User: I've been eating at the same few places for so long. It's getting quite boring.\",\n'System: Time to switch it up!',\n'User: You bet! Not sure what to try or where to go though.',\n'System: How about something completely random?',\n'User: Hmm probably not. I was talking to my sister the other day and Meghna restaurant came up.',\n'System: Oh. Did she like it?',\n'User: It was okay I guess. She did mention that it was probably more up my alley.'",
    "gen_sit": "I've been eating at the same few places for so long. It's getting quite boring. My sister and I talked about     Meghna restaurant, which she said was probably more up my alley."
  },
  "MUL1900": {
    "exchange": "\"User: It's been ages since I've last been to the theatre.\",\n\"System: Interesting. I didn't know you were into such things.\",\n'User: Well now you do.',\n'System: I suppose so.',\n\"User: The last time I went, I had such a wonderful time. I've always wanted to go again but I've been putting it off.\",\n\"System: That's new. If you enjoyed it that much, shouldn't you go back for more?\",\n\"User: I'm just worried nothing would quite live up to that experience.\"",
    "gen_sit": "It's been ages since I've last been to the theatre. I had a wonderful time the last time I went, but I've been putting     off going again because I'm worried nothing will live up to that experience."
  },
  "MUL0899": {
    "exchange": "'User: Time to splurge some!',\n'System: Any specific occasion?',\n'User: Haha. Just felt like doing it, since we have eating at home for a few weeks now.',\n'System: Ah, sounds great now that you got the chance!',\n'User: My partner loved it at the last gastropub, so I was thinking maybe we could find another one this week? Since its our anniversary and all?'",
    "gen_sit": "I've been eating at home for a few weeks now and I'm feeling like splurging. My partner and I are celebrating our     anniversary this week and I'm thinking of finding another gastropub to dine at."
  },
  "PMUL0589": {
    "exchange": "\"User: There's this new restaurant that recently. I can't wait to try it! I believe it's called Golden Wok.\",\n'System: Wow! Has anyone you know been there?',\n\"User: Nope. I'm the guinea pig.\",\n\"System: Haha that's exciting!\",\n\"User: It is indeed. I hope it's really amazing.\"",
    "gen_sit": "There's this new restaurant that recently opened. I can't wait to try it! It's called Golden Wok. No one I know has been     there, so I'll be the guinea pig. I hope it's really amazing."
  },
  "MUL1908": {
    "exchange": "\"User: I've never been to the fabled land that is Cambridge.\",\n\"System: It's not too great this time of year to be honest. It rains a lot and is pretty chilly.\",\n'User: Oh well. Thanks for the headsup I guess. I should probably pack more coats.',\n\"System: That's a good idea.\",\n\"User: Too bad the weather isn't the best.\",\n\"System: You could always head there in a few months. I'm sure it'll be much better then.\",\n\"User: That's true! Then again, it's a little too late to cancel my trip there.\"",
    "gen_sit": "I've never been to Cambridge before. I've heard it's not the best time to visit because of the rain and     chilly weather. I'll have to pack more coats. It's a shame about the weather, but I'm still planning to go."
  },
  "PMUL2383": {
    "exchange": "\"User: Man it's always one thing after another.\",\n\"System: What's the matter?\",\n'User: I just finished my A levels and just when I thought I could relax, now I have to start considering which universities I want to apply to.',\n\"System: Oh. That's a good problem to have no?\",\n\"User: I suppose so. My brother went to Pembroke, so I guess that's a good place to start?\"",
    "gen_sit": "I just finished my A levels and now I have to start considering which universities I want to apply to. My brother     went to Pembroke, so I guess that's a good place to start."
  },
  "MUL1549": {
    "exchange": "\"User: I can't wait! I'm finally meeting my best friend in Cambridge!\",\n\"System: That's great news! I hope you two have a good time catching up.\",\n\"User: Definitely! There's so much to talk about and do. I can't wait!\"",
    "gen_sit": "I'm finally meeting my best friend in Cambridge! I can't wait to catch up and spend time together."
  },
  "PMUL4386": {
    "exchange": "\"User: I think I'm weird.\",\n\"System: I'm sure you're not.\",\n\"User: I came across this video on Youtube talking about architecture. Now I'm hooked.\",\n\"System: That isn't so bad...\",\n\"User: Yeah but I've never been interested in such things. But now thanks to the autoplay algorithm, I'm just constantly reading and watching videos related to architecture.\",\n'System: I see. Well do you at least like it?',\n\"User: I'm starting to find it interesting I guess? I saw this series called The World's Most Extraordinary Homes. The designs are amazing!\"",
    "gen_sit": "I think I'm weird. I recently came across a video on Youtube talking about architecture and now I'm hooked. I never had an interest in such things before, but thanks to the autoplay algorithm, I'm now constantly reading and watching videos related to architecture. I'm starting to find it interesting, I guess. I saw this series called The World's Most Extraordinary Homes and the designs are amazing!"
  },
  "MUL1158": {
    "exchange": "'User: Wohoo! I just got my results!',\n'System: You sound happy. I presume you did well.',\n'User: Yes I did!',\n'System: Congratulations!',\n\"User: Thanks! But now I'm not sure what to do.\",\n'System: Oh really? Do tell.',\n\"User: It's just that I put in a crazy amount of effort to score well for my exams. I'm not sure if college is right for me.\"",
    "gen_sit": "I just received my results and did well. However, I'm unsure if college is right for me, despite putting in a lot of effort     to score well for my exams."
  },
  "MUL1879": {
    "exchange": "\"User: Hmm. Apparently there's this amazing place Wandlebury Country Park.\",\n'System: Oh my! I love that place!',\n'User: Really? I was thinking of visiting it sometime next week.',\n\"System: You won't regret it!\",\n'User: Strong advocate now are we?'",
    "gen_sit": "I was thinking of visiting Wandlebury Country Park sometime next week."
  },
  "PMUL3344": {
    "exchange": "\"User: Normally I'd say I dread work but next week I'll be based in Cambridge, and that makes things bearable.\",\n\"System: Isn't that good?\",\n'User: Yup. But you know what would make it even better? If my job was more rewarding!'",
    "gen_sit": "Normally, I'd say I dread work, but next week I'll be based in Cambridge, and that makes things bearable. However, I wish my job was more rewarding."
  },
  "MUL2330": {
    "exchange": "\"User: Oh god, I can't remember the last time I've been to Jamaican Spice.\",\n'System: Is that a restaurant or a shop?',\n\"User: The best Caribbean restaurant I've been to. There must be others, though.\"",
    "gen_sit": "I haven't been to Jamaican Spice in a long time. It's a Caribbean restaurant that I really enjoy, but I'm not sure if there are others like it."
  },
  "MUL1472": {
    "exchange": "\"User: The head editor lives in Stevenage, and he's really on my case.\",\n'System: Oh no, sounds bad.',\n'User: Going to need to wine and dine him along with the other editors. Hopefully that will calm him down.'",
    "gen_sit": "The head editor, who lives in Stevenage, is on my case. I'm planning to wine and dine him along with the other     editors to calm him down."
  },
  "SNG0374": {
    "exchange": "'User: Ugh, why did I have to choose this assignment...',\n'System: Why would you say that?',\n'User: Haha. If I knew this assignment would entail travelling so early on a Monday morning to get there, I would have reconsidered.',\n'System: Not a morning person, eh friend?',\n'User: Oh well, but it pays well anyway. You know how to get there from here in Peterborough?'",
    "gen_sit": "I have an early morning assignment on Monday and have to travel to get there. I'm not a morning person, but the assignment pays well. Do you know how to get there from Peterborough?"
  },
  "MUL0344": {
    "exchange": "'User: MY SON AND MY WIFE ARE COMING BACK HOME FINALLY!',\n'System: Great news, sir! But you should be calm.',\n\"User: They went to Cambridge to visit the in-laws first. I'll surprise them!\"",
    "gen_sit": "My son and wife are coming back home finally! They went to Cambridge to visit the in-laws first. I'll surprise them!"
  },
  "MUL2013": {
    "exchange": "'User: I just want to get out of England. I was supposed to be in Corfu this time of the year.',\n'System: A staycation is cheaper. And right now, safer.',\n'User: WHY IS CAMBRIDGE SO BORING?! WHY MUST I LIVE HERE?! GET ME OUT OF CAMBRIDGE!',\n'System: Deep breaths, sir.',\n\"User: For the next week or so, I'm getting out of here. Cambridge is going to be as far away in mind as the Falklands.\"",
    "gen_sit": "I was supposed to be in Corfu this time of the year, but due to circumstances, I'm stuck in Cambridge. I find Cambridge boring and want to get out for the next week or so."
  },
  "PMUL2179": {
    "exchange": "\"User: Really don't what to eat this time...\",\n'System: Why would you say that?',\n\"User: Sometimes I wonder if too much choice is a bad thing... Because then I don't know what to choose.\",\n\"System: Haha, it's a double-edged sword...\",\n'User: Maybe Jamaican food would be great for a weekend meal? Seemed interesting enough in pictures online.'",
    "gen_sit": "I don't know what to eat this time. Sometimes I wonder if too much choice is a bad thing... Because then I don't know what to choose. Maybe Jamaican food would be great for a weekend meal? It seemed interesting enough in pictures online."
  },
  "SNG1125": {
    "exchange": "\"User: Can't wait to see some plays!\",\n'System: Why is that?',\n\"User: Haha, since things are finally opening up again, it's so freeing to be not cooped up at home all the time!\",\n'System: Yeah! I know right?',\n'User: I used to go to The Cambridge Corn Exchange some years ago, heard of it?'",
    "gen_sit": "I'm excited to see some plays! I used to go to The Cambridge Corn Exchange some years ago."
  },
  "SNG0497": {
    "exchange": "'User: Feel like eating some pasta now...',\n\"System: That's nice! Any reason?\",\n'User: Haha. Have been mostly eating rice at home for the last few days. Time to change it up!',\n'System: Ooh, sounds exciting!',\n'User: I know! Somewhere Italian would be perfect for a meal! Since I want pasta anyway...'",
    "gen_sit": "I've been eating mostly rice at home for the last few days and I'm craving a change. I'm in the mood for pasta and     would love to go somewhere Italian for my meal."
  },
  "MUL2389": {
    "exchange": "\"User: Ooh, can't wait to eat pasta together with my family!\",\n'System: Ooh, a special ocassion?',\n\"User: Nope. It's just our favourite food, for all of us. So having it together makes it even better, since we finally get to catch up with one another!\",\n'System: I am happy for you!',\n\"User: All that's left is to find somewhere Italian for us meet at! So looking forward to have fun with them again!\"",
    "gen_sit": "I can't wait to eat pasta with my family! It's our favorite food and we're excited to catch up with each other.     I'm looking forward to finding an Italian restaurant for us to meet at."
  },
  "PMUL2421": {
    "exchange": "'User: I have heard many great things about the food here!',\n'System: What do you mean?',\n'User: Have been researching the local food before I arrived, especially the fish and chips here!',\n\"System: I see. Can't argue with that!\",\n\"User: Since I am meeting with my friends too, might as well have some real British food! Can't wait to have catch up over great food!\"",
    "gen_sit": "I have been researching the local food before arriving, especially the fish and chips here! I'm meeting my friends     too, so might as well have some real British food! Can't wait to have catch up over great food!"
  },
  "PMUL1791": {
    "exchange": "'User: How I wish it would be easier for me collect my new camera...',\n'System: Any problems?',\n\"User: Since I don't live that close by, still have to make a special trip down to the store.\",\n\"System: But it'll be worth it, right?\",\n\"User: Can't wait to try it out! Hope it doesn't take too long though, being in Cambridge. Got other things to do.\"",
    "gen_sit": "I wish it were easier to collect my new camera. I don't live close to the store, so I'll have to make a special trip     down. I'm excited to try it out, but I hope it doesn't take too long since I have other things to do in Cambridge."
  },
  "PMUL1683": {
    "exchange": "\"User: Can't wait finally meet my family once they are here!\",\n'System: I am happy for you!',\n\"User: I know right? There's so much we need to catch up on!\",\n\"System: There's time right?\",\n'User: Definitely! So ready to meet them at Stansted Airport in a few days.'",
    "gen_sit": "I can't wait to finally meet my family when they arrive! I'm excited to catch up with them and ready to meet them at Stansted Airport in a few days."
  },
  "MUL1967": {
    "exchange": "'User: Looks like I could visit some of the sights around there...',\n'System: Why is that?',\n'User: Haha. I was here for some appointments with clients, but since I am done and still have time, I suppose I could see some of the famous places around here!',\n\"System: I'd say that's a win-win!\",\n'User: I know right? Heard about a famous College, what was it called? I wanna visit.'",
    "gen_sit": "I was in the area for work, but since I'm done and have some extra time, I'd like to visit some of the famous places around here! I've heard there's a famous college nearby, does anyone know the name?"
  },
  "MUL2249": {
    "exchange": "'User: Hmm. Wonder if that place is still open?',\n'System: Is it a special place?',\n'User: Not really. My friends and I have visited this place before, and found a really nice cafe a few years ago! Wanna go back there!',\n'System: Oh, sounds good!',\n'User: Was one of the highlights of our last trip to Cambridge. The ambience there was fantastic!'",
    "gen_sit": "I'm wondering if a place I've visited before is still open. My friends and I found a really nice cafe a few years ago in Cambridge and we want to go back there. It was one of the highlights of our last trip."
  },
  "PMUL0835": {
    "exchange": "\"User: Can't wait for the weekend to come!\",\n'System: Any special plans?',\n'User: I have a short jaunt with my friends out of town to see the countryside!',\n'System: I am happy for you!',\n'User: Wonder what other fun things will we do this Sunday? Ooh, the anticipation!'",
    "gen_sit": "I can't wait for the weekend to come! I have a short jaunt with my friends out of town to see the countryside!     Wonder what other fun things will we do this Sunday? Ooh, the anticipation!"
  },
  "SNG0422": {
    "exchange": "\"User: Can't wait to for this trip to finally happen!\",\n'System: Why would you say that?',\n'User: Haha. Finally get to go Japan with my family! We have been planning for some time. Gonna be my first time there!',\n'System: I am happy for you!',\n'User: Wonder how does it like to leave Cambridge? Never been overseas before.'",
    "gen_sit": "I am excited about my upcoming trip to Japan with my family. It's been a while since we started planning and it's going to be my first time there! I'm curious about what it's like to leave Cambridge and travel overseas for the first time."
  },
  "MUL0187": {
    "exchange": "'User: Wonder if my relatives would like it here?',\n'System: What do you mean?',\n\"User: I have some uncles and aunts coming from overseas, and they've never been here before!\",\n'System: Hope you got things planned!',\n\"User: Yep! Bet they can't resist good old fish and chips! I'm certain British food would be perfect for their taste!\"",
    "gen_sit": "Relatives are coming from overseas and have never been here before. I'm planning to introduce them to British food,     such as fish and chips, which I believe they will enjoy."
  },
  "PMUL0555": {
    "exchange": "'User: Wonder what should we have this time?',\n'System: Ooh, is it a dinner this time?',\n\"User: Haha. We are having a birthday celebration for my brother next week, but still aren't sure where we want to eat at...\",\n\"System: Anything he'd love?\",\n\"User: You know what? Can't go wrong with Chinese food, it's what we are most comfortable with anyways.\"",
    "gen_sit": "I'm planning a birthday celebration for my brother next week, but we're still deciding where to eat. We're considering Chinese food since it's what we're most comfortable with."
  },
  "PMUL4702": {
    "exchange": "'User: Wonder why some places have weird names...',\n'System: Why would you ask that?',\n'User: Haha. Remembered a place I saw last time, and this thought just crossed my mind...',\n'System: I see. Perhaps to stand out in the crowd?',\n'User: I agree! Bet there are other reasons. But now I am wondering if that place called Ask is still in business? Might want to pay them a visit.'",
    "gen_sit": "I was thinking about weird names of places and wondered if a place called Ask is still in business. I might want to pay them a visit."
  },
  "SNG01527": {
    "exchange": "'User: Now would be as good a time as any to live a little!',\n'System: Something special happen?',\n'User: Not really, just that I got some extra income this month, and so was thinking of eating out.',\n'System: Ah, good idea!',\n'User: Bangers and mash sounds great to me now. Mmm... Guess some British food should do wonders for dinner!'",
    "gen_sit": "I have some extra income this month and was thinking of eating out. Bangers and mash sounds great to me now.     I'm considering having some British food for dinner."
  },
  "PMUL2441": {
    "exchange": "'User: Thinking one of the more pricey options would be great to treat ourselves... Hope it suits our tastes!',\n'System: Ooh, it is a special meal?',\n\"User: Haha. We don't travel often, so figured might as well eat well at least once just to enjoy it!\",\n'System: Good idea.',\n'User: Heard of this place, Kymmoy, online, and it seemed really delicious! We wanna go try their food!'",
    "gen_sit": "I want to treat myself and my friends to a nice meal at a more pricey restaurant. I heard of a place called Kymmoy online and it seemed really delicious! We want to go try their food!"
  },
  "MUL0055": {
    "exchange": "'User: Something different this time should spice things up!',\n\"System: What's the surprise?\",\n'User: Haha. Just another weekly family dinner. Except that we have been eating the same for a month now...',\n'System: Wow, I see.',\n'User: Heard great things about Hungarian food online, and my family agrees too!'",
    "gen_sit": "I'm looking to spice things up and try something different. My family and I have been eating the same thing for a month now, and we're all agreeing to try Hungarian food this time."
  },
  "PMUL1282": {
    "exchange": "'User: Can wait to visit all the attractions!',\n'System: Haha. Why is that?',\n\"User: It's my first time here! Read up online and found many great places to see!\",\n'System: I am happy for you!',\n\"User: Reaching Stansted Airport in less than a week, so won't be any longer until I am there! Ooh, the excitement!\"",
    "gen_sit": "I'm super excited to visit Stansted Airport in less than a week! It's my first time here and I've read up on all the great places to see! I can't wait to experience all the attractions!"
  },
  "PMUL0515": {
    "exchange": "\"User: Can't wait to catch up with brothers again!\",\n'System: I am happy for you!',\n\"User: There would be so much to talk about! Haven't seen them for the past year man...\",\n'System: Wow, I hope you have fun!',\n'User: Certainly! Haha. It would seem like Wednesday is suddenly so far away...'",
    "gen_sit": "I am excited to catch up with my brothers again! I haven't seen them for the past year and there's a lot to talk about. I'm feeling impatient as our meeting is still a few days away."
  },
  "SNG01523": {
    "exchange": "'User: Been awhile since I last went to an art gallery...',\n'System: Why is that?',\n'User: Haha. Everything has been closed the last few months, so had no choice, really.',\n'System: Ah, I see.',\n'User: Gonna need to visit somewhere else after seeing the gallery at twelve a high street, so hope I have time...'",
    "gen_sit": "I haven't been to an art gallery in a while because everything has been closed the last few months. Now that     things are opening up, I'm planning to visit a gallery on 12A High Street, but I'm not sure if I'll have enough time     to see everything I want to see."
  },
  "MUL1617": {
    "exchange": "'User: Wonder what is up with me nowadays?',\n'System: Is there anything wrong?',\n'User: Nothing really. Just curious actually. I have been obsessed with anything Mexican lately.',\n\"System: Sounds fun anyway, doesn't it?\",\n'User: Haha. Not that I mind going to some Mexican restaurant this week, just because everything looks interesting!'",
    "gen_sit": "I've been obsessed with anything Mexican lately. I'm curious and interested in trying out Mexican restaurants."
  },
  "MUL2360": {
    "exchange": "'User: Wonder how it feels like to not like spicy food?',\n'System: Why would you ask that?',\n\"User: Haha. Just curious, since I've always loved spice in my food.\",\n'System: Ah, I see.',\n'User: Hungry now. Curry at some Indian restaurant would hit the spot!'",
    "gen_sit": "I'm feeling hungry and would love to have some curry at an Indian restaurant. I've always loved spicy food,     but I'm curious about how it feels like to not like it."
  },
  "MUL0713": {
    "exchange": "'User: My uncle bought a new house in Cambridge.',\n\"System: That's nice, congratulations to him!\",\n\"User: I haven't seen him in three years.\",\n\"System: Wow, that's a long time!\",\n'User: He loves travelling, just like me.'",
    "gen_sit": "My uncle bought a new house in Cambridge. I haven't seen him in three years, but we both share a love for travelling."
  },
  "SNG0327": {
    "exchange": "\"User: Can't wait for the next week to start!\",\n'System: I sense something fun is coming up?',\n\"User: Got a small outing with my friends. It's gonna be fun!\",\n'System: I am happy for you!',\n'User: Ah! Almost forgot. Still need to make arrangements for this Monday.'",
    "gen_sit": "I can't wait for the next week to start! I have a small outing with my friends and it's going to be fun! However, I still need to make arrangements for this Monday."
  },
  "MUL1758": {
    "exchange": "\"User: It's time I went somewhere for a trip!\",\n'System: Like a holiday?',\n'User: Haha. Yeah! Just kinda tired of been cooped up here in this town for the last few months.',\n'System: Great idea!',\n'User: Ah! Just remembered something! Have to secure a seat for my passage outta Cambridge... Can never afford to forget THAT!'",
    "gen_sit": "I'm feeling tired of staying in this town for months and I want to go on a trip! I need to book a seat for my trip out of Cambridge."
  },
  "MUL0962": {
    "exchange": "'User: Still got some places I wish I could travel to...',\n'System: Why is that?',\n\"User: Haha. Been watching some travel shows, and there's always some interesting country out there that I haven't been to!\",\n'System: Oh, sounds good.',\n'User: Guess I could add them to my list! Saw that New Zealand food looked delicious, feel like trying some now!'",
    "gen_sit": "I still have some places I wish I could travel to. I've been watching some travel shows and saw that New Zealand food looked delicious, feel like trying some now!"
  },
  "MUL0276": {
    "exchange": "'User: Ah, looks like my time here is coming to an end...',\n'System: Sorry to hear that. Why is that?',\n'User: Haha. Travelling through this country, gotta move from place to place to see it all!',\n'System: That makes sense. Hope you have fun!',\n\"User: Leicester is the next interesting place on my list. Wonder how shall I travel there? Can't wait to see all the sights!\"",
    "gen_sit": "I'm about to leave this place. I'm travelling through the country and want to see as much as possible. My next destination is Leicester, but I'm not sure how to get there. I'm excited to see all the sights!"
  },
  "MUL0401": {
    "exchange": "\"User: Can't wait for short trip outta town this weekend! Been waiting for this for so long!\",\n'System: Why is that?',\n'User: Just that I have been cramming for exams the last month. Now that they are finally over, I can let loose a bit!',\n'System: I am happy for you!',\n\"User: Really can't wait to depart Cambridge on this trip already! Any ideas how? Been awhile since I last travelled in a foreign country...\"",
    "gen_sit": "I've been waiting for this short trip out of town for a long time! I've been cramming for exams for the last month and now that they're over, I'm ready to let loose a bit! I'm planning to depart Cambridge and travel abroad, but I'm not sure how. It's been a while since I last traveled to a foreign country."
  },
  "PMUL2412": {
    "exchange": "\"User: Yay, been like forever since we've last been on a family vacation like this!\",\n'System: I am happy for you!',\n\"User: There's so many place to be at! Ooh, can't wait for the great food too!\",\n\"System: That's always something to look forward to, I feel!\",\n\"User: My parents were talking about seeing some famous college around here... Let's start with that!\"",
    "gen_sit": "My family and I are going on a vacation soon. We're excited to visit many places and enjoy great food. My parents     want to see some famous colleges around here, so we'll start with that."
  },
  "MUL0631": {
    "exchange": "\"User: Wonder what's up with that place?\",\n'System: Is there something wrong?',\n\"User: Haha, nope. Really don't know why, but I find myself going back there again and again...\",\n'System: Oh, mind telling me more?',\n'User: Gotta be in Cambridge to meet my family. Wonder why do they wanna go there anyway?'",
    "gen_sit": "I find myself going back to Cambridge again and again. I have to be there to meet my family, but I wonder     why they want to go there."
  },
  "PMUL0569": {
    "exchange": "'User: Ugh. Here we go again.',\n\"System: What's up?\",\n\"User: Really don't know why my friends wanna keep meeting there?\",\n'System: Mind telling more?',\n'User: Haha. Gotta meet them in Cambridge this week. At least I get to see them...'",
    "gen_sit": "I have to meet my friends in Cambridge this week. I don't know why they want to keep meeting there. At least I get to see them..."
  },
  "MUL0206": {
    "exchange": "'User: Oh no, here we go again.',\n\"System: What's going on?\",\n'User: Wonder why my parents wanna keep going back there?',\n'System: What do you mean?',\n\"User: Ah, they wanna go Cambridge together again... As if we've not been there enough times already! At least we get to catch up over delicious food...\"",
    "gen_sit": "My parents want to go back to Cambridge again, even though we've been there enough times already. At least we get to catch up over delicious food..."
  },
  "MUL0362": {
    "exchange": "\"User: I can't stand cheese. Too bad my friend loves it...\",\n'System: Why is that?',\n'User: The smell. When we eat out, sometimes I have to eat that since we are dining together...',\n'System: I am sorry to hear that.',\n\"User: Ah, here we go again. I don't mind as long as he's happy though. He wants to go Pizza Express this time.\"",
    "gen_sit": "I can't stand cheese, unfortunately, my friend loves it. The smell of cheese bothers me, but I don't mind     eating it when I'm dining with my friend. My friend wants to go to Pizza Express this time."
  },
  "MUL2291": {
    "exchange": "'User: Here we go again.',\n\"System: What's up?\",\n'User: I need to go back there again...',\n'System: Where is that?',\n'User: Looks like I need to be in Cambridge for a job assignment again. At least the pay is good...'",
    "gen_sit": "I need to go back to Cambridge for a job assignment again. At least the pay is good..."
  },
  "MUL2111": {
    "exchange": "'User: At least I get to leave this place...',\n'System: Why is that?',\n\"User: Getting tired of this place. Can't wait to go somewhere else.\",\n'System: Ooh, any concrete plans?',\n\"User: Maybe? Finally, I get to leave Cambridge to continue on my journey! Can't wait to experience more!\"",
    "gen_sit": "I'm feeling tired of my current place and can't wait to leave Cambridge and continue on my journey. I'm excited to experience new things."
  },
  "MUL0209": {
    "exchange": "'User: I wonder what the cuisine on the other side of the ocean is like?',\n\"System: What's on your mind, friend?\",\n'User: Haha. Was watching some videos about international cuisine on YouTube, and got curious.',\n'System: Understandable!',\n'User: Perhaps some North American food would be perfect for dinner? Getting hungry already...'",
    "gen_sit": "I was watching some videos about international cuisine on YouTube and got curious about North American food.     I'm now feeling hungry and thinking about what to have for dinner."
  },
  "MUL2263": {
    "exchange": "'User: Wonder why do I keep going back there?',\n'System: Is there something wrong?',\n'User: Maybe. I find myself visiting the same place again and again...',\n'System: Why is that?',\n\"User: Oh well, at least it's with my friends this time. Should be fun, at least, even if it's at Cambridge again.\"",
    "gen_sit": "I find myself visiting the same place again and again. This time, it's with my friends. We're going to Cambridge."
  },
  "MUL0219": {
    "exchange": "'User: Really curious about all these food!',\n'System: What is it?',\n\"User: Found some of the food I don't usually see around here. Seems delicious!\",\n'System: Would you be trying them out?',\n'User: Why not? Kosher food seems great to start with!'",
    "gen_sit": "I'm curious about the food around here. I've found some food that I don't usually see and it seems delicious!     I'm thinking of trying out some Kosher food."
  },
  "MUL0386": {
    "exchange": "'User: Hmm. Where would be great for lunch?',\n'System: Anywhere in particular? Is it a special occasion?',\n\"User: Haha. Been catching up with a friend who runs a food blog now. Didn't see him for so long! Gave me some places to eat at!\",\n'System: Wow, sounds great!',\n'User: Considering to dine at Golden Wok for lunch...Hopefully it can settle my Chinese food craving? Hungry now...'",
    "gen_sit": "I'm considering dining at Golden Wok for lunch, hoping to satisfy my Chinese food craving. I'm feeling hungry now.     I've been catching up with a friend who runs a food blog and he recommended some places to eat at."
  },
  "SNG0490": {
    "exchange": "\"User: Wondering if there's somewhere with some refreshing soups?\",\n'System: Why would you say that?',\n'User: Haha. Was reading some cookbook about various soups, and now I feel like going out to get some!',\n'System: Ooh, sounds great!',\n'User: Hmm, soups. You know what? I am sure that Thai food will be satisfying to this end!'",
    "gen_sit": "I was reading a cookbook about various soups and now I feel like going out to get some! I'm sure that Thai food     will be satisfying to this end!"
  },
  "PMUL3052": {
    "exchange": "'User: Wonder how much has changed over there?',\n'System: Where is this?',\n'User: Haha. Reminiscing about my travels in Africa a few years ago. Feel like having some of their food again!',\n'System: That might be a great place to start!',\n'User: You know what? I still remember that Eritrean food was really fantastic! Maybe I can find some here?'",
    "gen_sit": "I'm reminiscing about my travels in Africa a few years ago. I really miss their food, especially Eritrean food. Maybe I can find some here?"
  },
  "PMUL4623": {
    "exchange": "'User: Can wait to meet my university pals again!',\n'System: I am happy for you!',\n\"User: Wonder what have they been up to? It's been so long!\",\n'System: Looking forward to that?',\n'User: Yep! We finally settled on somewhere to eat after much discussion! Some Indian restaurant, I think?'",
    "gen_sit": "I am excited to meet my university pals again! It's been a while and I'm curious about what they've been up to.     We've decided on an Indian restaurant to eat at after much discussion."
  },
  "MUL0512": {
    "exchange": "'User: Wonder if that store is still there?',\n'System: Hmm. What store is it?',\n'User: Haha. Used to visit this antique store when I used to live elsewhere. Been a few years.',\n'System: Sounds like somewhere interesting!',\n'User: Wonder if I should swing by Broxbourne and check it out? Hope to meet the owner again.'",
    "gen_sit": "I'm thinking about visiting an antique store in Broxbourne that I used to visit when I lived elsewhere. It's been a few years, but I'm curious if it's still there and if the owner is still around."
  },
  "SNG02121": {
    "exchange": "'User: Hmm. Wish I could cook other cuisines more easily at home...',\n'System: Why is that?',\n'User: Haha. Often read online about food from other countries, and that makes me so want to try them!',\n'System: Ooh, sounds exciting!',\n\"User: But...too bad my kitchen isn't big enough for all the tools and appliances I need. Oh well. You know what? Feel like Chinese food would be perfect for lunch!\"",
    "gen_sit": "I wish I could cook other cuisines more easily at home. I often read online about food from other countries and want to try them! However, my kitchen isn't big enough for all the tools and appliances I need. I'm craving Chinese food for lunch."
  },
  "PMUL2154": {
    "exchange": "'User: Wonder what would they want to eat this time?',\n'System: Someone special?',\n'User: Oh. My family is coming over, but I forgot to check with them what to eat for our dinner...',\n'System: Oh dear...',\n'User: Oh well! Just gonna wing it and stick with British food. Had it before and they loved it!'",
    "gen_sit": "My family is coming over, but I forgot to check with them what to eat for our dinner... Oh well! Just gonna     wing it and stick with British food. Had it before and they loved it!"
  },
  "PMUL3262": {
    "exchange": "'User: Oh well, looks like I need to go back there again...',\n'System: Why is that?',\n'User: Haha. My parents are coming over and I need to go receive them. At least I get to catch up again...',\n'System: Family time is always important!',\n\"User: Can't wait to finally travel Cambridge with my dear parents! It's been so long! You know how to go there?\"",
    "gen_sit": "My parents are coming over, and I need to receive them. I'm looking forward to spending time with them and traveling to Cambridge. I'm not sure how to get there."
  },
  "PMUL0759": {
    "exchange": "'User: Spicy, or non-spicy?',\n'System: Food, is it?',\n'User: Haha, looking forward to a dinner with my dad in a few days. Just deciding on the food...',\n'System: Haha, you still got some time!',\n'User: Since we are both neutral about spicy food, perhaps some Indian food would do us some good this time!'",
    "gen_sit": "I'm looking forward to a dinner with my dad in a few days. We're deciding on the food and considering Indian food since we both don't like spicy food."
  },
  "PMUL4488": {
    "exchange": "'User: Why does food always look so good in pictures?',\n\"System: What's going on?\",\n'User: Haha, just looking through old photos of my trip in Hungary. The food actually still looks interesting!',\n'System: Oh, wonderful!',\n'User: And I still remember that it was really delicious too! Maybe Hungarian food would be perfect for later?'",
    "gen_sit": "I was looking through old photos of my trip to Hungary and noticed that the food still looks interesting. I     remember it being delicious too. Maybe Hungarian food would be perfect for later?"
  },
  "PMUL4400": {
    "exchange": "'User: Wonder why do my friends keep going there?',\n'System: Where is it?',\n'User: Haha. Was chatting with my friends, and it seems like they are all quite familiar with the nightlife around here!',\n\"System: Let me guess, you're curious?\",\n\"User: Maybe visiting the nightclub just to see what they're going on about would be a great idea?\"",
    "gen_sit": "I was chatting with my friends and it seems like they are all quite familiar with the nightlife around here! I'm curious     and considering visiting the nightclub to see what they're going on about."
  },
  "PMUL3776": {
    "exchange": "\"User: Wonder if we'll end up going back to the same food as last time?\",\n'System: Ooh, is it some occasion?',\n\"User: Haha. Catching up with my friends over a meal soon, just wondering what we'll be eating!\",\n'System: I am happy for you!',\n'User: The last time we had Korean food and they loved it, so perhaps we can get something similar this time.'",
    "gen_sit": "I'm meeting up with my friends for a meal soon, and I'm wondering what we'll be eating. The last time we had Korean food     and they loved it, so perhaps we can get something similar this time."
  },
  "PMUL1917": {
    "exchange": "\"User: I have been living here for a long time and can't say that I like it.\",\n'System: Where are you at? Is it the lifestyle that you are not use to.',\n\"User: I moved here to Peterborough about 4 years back. I think it is more like I didn't manage to meet any new people so it is really boring.\",\n\"System: I see. Well you won't meet new people if you just stay at home, probably need to actively go out and socialise.\",\n\"User: I have tried that for a while actually but honestly I can't get use to it, too much energy cost for me.\"",
    "gen_sit": "I have been living in Peterborough for 4 years and find it boring. I haven't been able to meet new people and find it difficult to socialize. I have tried going out but find it too energetically costly."
  },
  "MUL1379": {
    "exchange": "'User: I think Russian is a really cool language, been wanting to learn it for a long time.',\n\"System: You sound like you didn't quite get started, what is holding you back?\",\n\"User: Well honestly I just don't have enough time, work is extremely busy and I still got other commitments to handle.\",\n'System: Ah, honestly I think that is more of a time management issue.',\n\"User: I agree! But I can't really bring myself to start just keep procrastinating.\",\n'System: Maybe you could find a buddy and then you guys can do it together and you will be pressured to continue.',\n'User: I actually plan on doing that. Was planning on going to a Russian restaurant and maybe I will meet a better speaker there.'",
    "gen_sit": "I think Russian is a really cool language and have been wanting to learn it for a long time. However, I haven't     started learning it yet due to lack of time. I have a busy work schedule and other commitments to handle. I agree that it's a time management issue and I procrastinate a lot. I plan on finding a language learning buddy to motivate me to continue learning. I might go to a Russian restaurant to meet a better speaker and practice my language skills."
  },
  "PMUL1408": {
    "exchange": "'User: I have visited a few colleges before and to be honest they were not that impressive.',\n'System: Wow why do you like visiting colleges in the first place?',\n'User: Well I guess it is for the atmosphere, just feels like it is very energetic yet scholarly.',\n\"System: Oh I see! So I guess most you have been to didn't quite meet the expectation huh.\",\n\"User: Honestly they didn't, I am not sure if I am just unlucky or are they really that different from what I had in mind.\"",
    "gen_sit": "I have visited a few colleges before, but they were not impressive. I like visiting colleges for their atmosphere, which     feels energetic and scholarly. However, most of the colleges I have visited didn't meet my expectations."
  },
  "PMUL0512": {
    "exchange": "\"User: My son is returning from his overseas trip this sunday, can't wait to see him.\",\n'System: Is he out there for work or studies?',\n'User: Work, he is in a transnational corporation so they tend to send him to various places.',\n\"System: I see! How long was he gone for this time? I hope it wasn't too long.\",\n\"User: This time was not long, just about 3 months, they get really good renumerations for being overseas as well so it's quite worth it\"",
    "gen_sit": "My son is returning from his overseas trip this Sunday, can't wait to see him. He's been gone for 3 months this time,     working for a transnational corporation."
  },
  "PMUL4482": {
    "exchange": "'User: For some reason college food is a lot cheaper than outside food.',\n\"System: Well they are probably just accommodating to the students! Most of them don't really have income after all.\",\n'User: Yeah that is fair, but I always take advantage of this and eat in colleges hahaha.',\n\"System: Do they not check your identity or something, aren't most offers only for their own students.\",\n'User: Some do! But many just assume that because I look really young so I am probably a student there.'",
    "gen_sit": "I have noticed that food at college is cheaper than food outside of college. I have taken advantage of this and     eat at colleges often. Some colleges check identity, but many assume that I am a student because of my youthful appearance."
  },
  "PMUL2648": {
    "exchange": "'User: I bought a new swimsuit for my daughter and she really liked it.',\n'System: I see! That is not a common gift though why did you choose that.',\n'User: Well she is actually semi-pro now, the swimsuit has special technologies on it so it is actually really expensive!',\n'System: Oh I see! Is she planning to become a full time athelete in the future?',\n'User: Well I am sure she would if she can make it! Recently she said there is an abbey pool and astroturf pitch that just opened with really good facilities.'",
    "gen_sit": "I bought a new swimsuit for my daughter and she really liked it. She's actually semi-pro now, and the swimsuit has special technologies on it, so it's quite expensive! She's planning to become a full-time athlete in the future. She mentioned that there's an abbey pool and astroturf pitch that just opened with really good facilities."
  },
  "MUL2041": {
    "exchange": "\"User: This year's comic-con is going to be held in Cambridge, what a surprise.\",\n'System: What is so surprising about that though, is it very rare?',\n'User: Cambridge is a really small town and lacks the proper facilities so usually they rarely have big events.',\n'System: Then how come they are able to hold that there this time?',\n'User: I am going to assume that they are probably holding it in one of their universities.'",
    "gen_sit": "This year's comic-con is going to be held in Cambridge, which is surprising because Cambridge is a small town that lacks the proper facilities to hold big events. However, it's probably going to be held in one of the universities."
  },
  "MUL1492": {
    "exchange": "'User: All the germans I have met are always so attentive to details.',\n\"System: Well that is a very good thing isn't it, means they are reliable.\",\n'User: Yeah but sometimes it gets really tiring as well! Because they keep asking for every small thing.',\n\"System: Ah that is true, I didn't think of the possible things you'd have to deal with haha.\",\n'User: Yeah but that is also why I love German restaurant, you can really trust them with their food.'",
    "gen_sit": "I have noticed that all the Germans I have met are very attentive to details. They are reliable, but sometimes it gets     tiring because they keep asking for every small thing. However, I love German restaurants because I can really trust them with their food."
  },
  "MUL1426": {
    "exchange": "'User: Leicester has really changed quite a bit since I last came here.',\n'System: Which part are you referring to exactly, like public transport or.',\n\"User: It is mainly the architecture, last time you see a lot of old buildings but you can't really find much of them nowadays.\",\n'System: I see, well I guess you can say that they are also slowly catching on to modernisation huh.',\n\"User: Hahaha! Maybe they will become a proper modern place in about 20 years. I don't have high hopes.\"",
    "gen_sit": "I was last at Leicester a while back and noticed that the architecture has changed significantly. There are fewer old buildings nowadays.    \n\n\n    Exchange: \n    'User: I am planning to go to the gym later today.',\n    'System: That's great! Do you have a gym in mind?',\n    'User: I was thinking of going to the one near the train station.',\n    'System: That's a good choice. Do you need help finding the way there?'\n    \n    Summarized situation: \n    I am planning to go to the gym later today. I was thinking of going to the one near the train station.\n\n\n    Exchange: \n    'User: I am planning to go to the gym later today.',\n    'System: That's great! Do you have a gym in mind?',\n    'User: I was thinking of going to the one near the train station.',\n    'System: That's a good choice. Do you need help finding the way there?'\n    \n    Summarized situation: \n    I am"
  },
  "MUL0046": {
    "exchange": "'User: I remember the first time I heard about Singapore was for their water treatment.',\n'System: Are they that good in it? Or are you like in that line of work.',\n'User: Erm it was when I was studying environmental sciences in university and we had a case study about them.',\n'System: I see! Did you go and find out more about them afterwards?',\n'User: Yea! And I have really fallen in love with Singaporean food, really like the kind of variety they have in their dishes.'",
    "gen_sit": "I remember the first time I heard about Singapore was for their water treatment. I studied environmental sciences in university and we had a case study about them. I have really fallen in love with Singaporean food, really like the kind of variety they have in their dishes."
  },
  "MUL2448": {
    "exchange": "'User: I tried really hard to overcome my sea-sickness but damn I am making really little progress.',\n\"System: Well why do you want to do something about it? I don't assume it is that necessary to overcome.\",\n\"User: Well it isn't, but my daughter is a boat captain so I want to be able to ride on her boat and enjoy it.\",\n'System: Hahahah I see! So it is for your daughter, familial love is really amazing, maybe you can take it step by step.',\n'User: Well I tried, but damn no matter what kind of boats I go on, I just immediately feel sick as hell'",
    "gen_sit": "I tried really hard to overcome my sea-sickness but I'm making little progress. I want to be able to ride on my daughter's boat and enjoy it, but no matter what kind of boats I go on, I immediately feel sick."
  },
  "PMUL0729": {
    "exchange": "\"User: Oh no I woke up late now I can't meet my friend on time.\",\n\"System: I hope your friend don't mind, some people really hate others coming late.\",\n'User: He is okay with it usually! pizza express Fen Ditton at 1, he can also just go in first and order.',\n\"System: Well don't get too comfortable, you should still try your best to be there as soon as possible.\",\n'User: Certainly! Maybe I should also inform him about it first so that he knows.'",
    "gen_sit": "I woke up late and now I can't meet my friend on time. My friend is okay with me coming late usually, but I still     want to inform him about it. We are meeting at Pizza Express Fen Ditton at 1 pm, and he can go in first and order."
  },
  "MUL0326": {
    "exchange": "'User: My interview results are coming out this Wednesday I really hope it goes well.',\n\"System: Don't be too pressured about it! No matter the results as long as you've tried your best you can be proud.\",\n'User: Thanks! I try to tell myself that too but it is really hard to get rid of the stress inside.',\n'System: Do something else then! Anything that can take your mind somewhere else.',\n'User: Hahaha I will try, but honestly it is okay, wednesday is not that far away so I just have to tolerate it a little longer.'",
    "gen_sit": "My interview results are coming out this Wednesday. I really hope it goes well. I'm feeling stressed about it, but I'm     trying to stay positive and take my mind off of it until Wednesday."
  },
  "PMUL1661": {
    "exchange": "'User: I feel like for business owners, if they are generally kind and nice people are more willing to support their business.',\n'System: I mean that is why many corporations do charity and all as well! It is all about the images.',\n'User: True! I met the owner of Kings Lynn recently, really a pleasant guy to interact with, very generous as well.',\n'System: Well the problem with meeting them is that sometimes it is hard to tell if they are sincere or just putting up a front.',\n'User: True! He feels pretty genuine to me though, guess I will visit Kings Lynn during my trip this time.'",
    "gen_sit": "I met the owner of Kings Lynn recently, a very pleasant and generous man. He feels pretty genuine to me, so I'm planning to visit Kings Lynn during my trip this time."
  },
  "SNG0414": {
    "exchange": "'User: The lottery with the biggest prize pool is happening this saturday, how exciting.',\n'System: Hahaha why would you be actually? I mean not trying to discourage you but the chances are so low.',\n'User: Well I mean you got to believe in something right, and honestly I got a pretty good feeling about it so you never know.',\n'System: Wow I am so sorry but you could really put your faith somewhere else that is much more believable.',\n\"User: Well we shall see! This Saturday is also my birthday, a lot of coincidences are happening isn't it.\"",
    "gen_sit": "I'm excited about the upcoming lottery with the biggest prize pool, happening this Saturday. Despite the low     chances, I have a good feeling about it. This Saturday is also my birthday, which I believe is a sign of good things to come."
  },
  "PMUL0863": {
    "exchange": "'User: I have been trying to cook different cuisines recently and some are definitely harder than others.',\n'System: Oh that is a really nice hobby! So which one was the hardest for you?',\n'User: Definitely Indian food, the raw materials are super hard to find, and you need to add in very exact portions.',\n'System: I see! Does the end product taste good though I think that is the most important thing.',\n\"User: Well honestly for some reason it doesn't taste as nice as outside food, I have been pondering about the reason why.\"",
    "gen_sit": "I have been trying to cook different cuisines recently. I find Indian food to be the hardest as the raw materials are     super hard to find and exact portions are required. Despite my efforts, the end product doesn't taste as good as outside food.     I have been pondering about the reason why."
  },
  "MUL0202": {
    "exchange": "'User: My daughter was really upset during her birthday last year.',\n'System: Why did some bad happen on that day?',\n'User: Well usually she will tell us what she wants as a gift and we will get it for her but last year we bought the wrong one.',\n'System: Oh man, well I can understand that she will be sad but honestly getting gifts in itself should be something to be happy about.',\n\"User: Hahah clearly she didn't think so, so we promised that we will take her to an Italian restaurant this year, it is her favourite.\"",
    "gen_sit": "My daughter was upset on her birthday last year because we got her the wrong gift. We promised to take her to her favorite Italian restaurant this year to make up for it."
  },
  "MUL0418": {
    "exchange": "'User: Dude Peterborough just built this new library! It is so amazing, it is so huge and advance.',\n'System: What kind of cutting-edge technology did they put into a library?',\n'User: They replaced librarians with robots, so they are much more efficient at finding books for you, also everything is sorted automatically.',\n'System: Wow, unbelievable people these days literally will stuff technology anywhere they can just for the sake of it.',\n'User: Well honestly yeah, it is like cool but honestly not that useful compared to humans. But Peterborough has been known for their preferences for technology.'",
    "gen_sit": "Peterborough has built a new library with cutting-edge technology. They have replaced librarians with robots, making it     more efficient at finding books. However, some people may find it less useful compared to human librarians."
  },
  "MUL1622": {
    "exchange": "'User: I think I arranged too many things on Sunday I probably need to cancel some.',\n'System: Why did you do it in the first place then did you not know how good you are with time management.',\n\"User: Honestly not my fault, the calendar didn't sync so I didn't kown I was already occupied.\",\n'System: I see, oops then it is really not on you! Which one are you going to cancel though.',\n'User: Probably just cancel the dental appointment I made, that one is the most flexible to reschedule.'",
    "gen_sit": "I think I arranged too many things on Sunday and I probably need to cancel some. I made a dental appointment     that I'll probably cancel since it's the most flexible to reschedule."
  },
  "SNG0329": {
    "exchange": "'User: The olympics is finally happening! After all these accidents and postponing I am so glad it is happening.',\n'System: Oh cool! When is the actual commencing date of the event.',\n'User: It is this Saturday, I am already all prepared to stay up late to watch the opening ceremony.',\n'System: Is it really that exiciting that it is worth skipping sleep for?',\n'User: Yeah I think it is really an event that demonstrates the human spirit, to surpass ourselves.'",
    "gen_sit": "The Olympics is finally happening! I'm so glad it's happening after all the postponements and accidents. It's this Saturday and I'm all prepared to stay up late and watch the opening ceremony. I believe it's really an event that demonstrates the human spirit, to surpass ourselves."
  },
  "SNG1122": {
    "exchange": "'User: Now would be as good a time as any to go out and take some photos!',\n'System: Why is that?',\n'User: Haha. Finally have some time on my hands after my exams! My camera is really collecting dust...',\n'System: Ooh, sounds great!',\n'User: Hmm. Should be a great chance to shoot architecture again? Need to get back up to speed...'",
    "gen_sit": "I have finally have some time on my hands after my exams. My camera is really collecting dust and I'm thinking     of going out to take some photos, perhaps of architecture, to get back up to speed."
  },
  "MUL0888": {
    "exchange": "\"User: Hmm. Can't remember where I found this from...\",\n'System: What is it?',\n\"User: Guess what? Found this scribbling of what seems to be an address while sorting my stuff! Can't really remember what it's for...\",\n'System: Hmm. Tell me more?',\n\"User: Yes! Think it's a dining place, The Copper Kettle. Maybe I went there before?\"",
    "gen_sit": "I found an address scribbled down while sorting my stuff, can't remember what it's for. It seems to be a dining place called The Copper Kettle, maybe I went there before?"
  },
  "PMUL0764": {
    "exchange": "'User: Should be a great idea to try some regional food while I am at it!',\n'System: We do have lots of great stuff around here!',\n\"User: Haha. We are going on long trip starting with Britain! This will be our first stop, and we'll definitely looking forward to try some regional stuff!\",\n'System: Wise choice!',\n\"User: Was thinking European food would be a good first step for us? Can't wait to start on some of the delicacies already!\"",
    "gen_sit": "I'm planning a long trip starting with Britain. I'm excited to try some regional food, and I'm considering European cuisine as a good first step. I'm looking forward to trying some delicacies."
  },
  "PMUL4744": {
    "exchange": "\"User: What's the best dish you ever had?\",\n'System: Mine was a beef wellington.',\n'User: Sounds tasty. Mine was a fried rice dish that I had when I was young.',\n'System: Where was it from?',\n\"User: It's been very long, but I vaguely remember my father mentioning it was from a place called rice house.\"",
    "gen_sit": "I had a conversation with someone about the best dish we've ever had. I had a beef wellington, while the other person had a fried rice dish from a place called Rice House."
  },
  "PMUL4198": {
    "exchange": "\"User: I'm getting married.\",\n\"System: Congratulations! How's your preparation going?\",\n\"User: Everything's going well. We're now thinking of locations for the wedding photoshoot.\",\n'System: Couples usually take them at parks or beaches. You could consider those.',\n\"User: I've heard that colleges are also a popular spot due to their beautiful architecture.\"",
    "gen_sit": "I'm getting married and everything's going well. My partner and I are thinking of locations for our wedding     photoshoot. We've heard that colleges are a popular spot due to their beautiful architecture."
  },
  "PMUL4424": {
    "exchange": "'User: Wonder if it is really as nice as they show on television?',\n'System: What is it?',\n'User: Haha. Actually saw a travel show about some delicious food in the area! Looked so good I wanna go try!',\n'System: Ooh, sounds exciting!',\n'User: I know right? The Turkish restaurant was the one that caught my eye!'",
    "gen_sit": "I saw a travel show about delicious food in the area and now I want to go try it! The Turkish restaurant caught my eye."
  },
  "MUL0517": {
    "exchange": "'User: Hope we can all make it for this trip...',\n\"System: The more the merrier, isn't it?\",\n\"User: Haha. Got a small trip with my friends coming up! Haven't been able to go on one for ages because of our schedules!\",\n'System: I see. Hope it works out then!',\n\"User: Can't wait to visit all these nice places in Cambridge with them! Won't be long now that we finally have some fun together!\"",
    "gen_sit": "I'm looking forward to a trip with my friends. We haven't been able to go on one for ages because of our     schedules, but we're finally able to make it work. We're planning to visit some nice places in Cambridge together."
  },
  "PMUL4107": {
    "exchange": "'User: Time to make arrangements for our next leg!',\n'System: What is it?',\n'User: Haha. Having lots of fun on our trip around the country, but we still gotta make some plans for the next parts.',\n'System: I am happy you like it here!',\n\"User: Oh well, that wraps up our time in Cambridge... We'll be back soon enough. Can't wait already!\"",
    "gen_sit": "I am currently on a trip around the country with friends and we are having lots of fun. We need to make     arrangements for the next part of our trip."
  },
  "MUL2649": {
    "exchange": "'User: The new Black Widow movie is finally out!',\n'System: Are you a huge Marvel fan?',\n\"User: Absolutely! I've been looking forward to this movie for ages.\",\n'System: Will you be catching it with your friends?',\n'User: Sadly, they have all watched it already while they were checking out the newly opened Vue Cinema.'",
    "gen_sit": "I'm a huge Marvel fan and have been looking forward to the new Black Widow movie for ages. Unfortunately, my     friends have already watched it at the newly opened Vue Cinema."
  },
  "MUL0539": {
    "exchange": "'User: I recently moved to London Liverpool Street.',\n\"System: How's the new place?\",\n'User: The apartment is a bargain for its size. The only downside is that the neighbourhood is a little lacking in amenities.'",
    "gen_sit": "I recently moved to London Liverpool Street. The apartment is a bargain for its size, but the     neighbourhood lacks amenities."
  },
  "MUL1738": {
    "exchange": "'User: Guess it never hurts to be prepared, huh?',\n'System: Definitely true! What are you preparing for?',\n'User: Going for a little trip outta town, so was considering how to travel.',\n'System: I see. In that case, I agree even more!',\n\"User: Hope it doesn't take too long to reach London Liverpool Street from here... Can't afford to be late to see my friend!\"",
    "gen_sit": "I'm preparing for a trip out of town and considering how to travel. I hope it doesn't take too long to reach London     Liverpool Street from here, as I don't want to be late to see my friend."
  },
  "MUL1409": {
    "exchange": "'User: Looks like this week will be a great week!',\n'System: Why would you say that?',\n\"User: Finally time for a short break after all of that work! Can't for all the stuff I have planned!\",\n'System: I am happy for you!',\n'User: Man am I glad to leave on Monday already, since I got so much to do!'",
    "gen_sit": "I am excited about this week because I have a short break from work and have many plans. I am leaving on Monday and have a lot to do."
  },
  "PMUL1464": {
    "exchange": "'User: My grandmother is celebrating her 90th birthday soon.',\n'System: Wow, congratulations to her!',\n\"User: She's always led a healthy lifestyle and is still fit as a fiddle to this day.\",\n\"System: That's really respectable. Not many can achieve that.\",\n\"User: Yeah, so while she could still walk around, we're bringing her to a restaurant this Sunday to celebrate.\"",
    "gen_sit": "My grandmother is turning 90 years old soon. She's always been healthy and fit. We're bringing her to a restaurant     this Sunday to celebrate."
  },
  "SNG0340": {
    "exchange": "\"User: I'm making plans to visit E. M. Forster's old home, and maybe Lord Lytton's. Not much time to do so, though.\",\n\"System: I'm not familiar with those names.\",\n'User: Both are writers, and both lived in Stevenage.'",
    "gen_sit": "I'm planning to visit the old homes of E. M. Forster and Lord Lytton in Stevenage, but I have limited time."
  },
  "PMUL4075": {
    "exchange": "'User: Bloody hell, I miss home.',\n'System: You can always plan to go back home.',\n'User: Not yet. But the family and I miss proper Chinese food.'",
    "gen_sit": "I miss home and proper Chinese food."
  },
  "PMUL0575": {
    "exchange": "'User: This funny comedian guy keeps talking about this Nandos fast food place.',\n'System: What does he say about it?',\n'User: A few jokes here and there. My sister passed by Nandos City Centre earlier this week, she said.'",
    "gen_sit": "A comedian has been talking about Nandos fast food place, making a few jokes here and there. My sister passed by Nandos City Centre earlier this week."
  },
  "MUL2487": {
    "exchange": "'User: My aunt is visiting me next week.',\n\"System: That's nice, hope you have fun!\",\n'User: She loves visiting churches.',\n'System: I have always wanted to go to one.',\n'User: Her favourite one is the All Saints Church.'",
    "gen_sit": "My aunt is visiting me next week. She loves visiting churches, and her favorite one is the All Saints Church."
  },
  "MUL0549": {
    "exchange": "\"User: I'm really stressed out lately.\",\n\"System: What's going on?\",\n'User: My final exams are really taking a toll on me.',\n'System: Hang in there! Just think of the activities you could enjoy afterward.',\n\"User: When it's finally over on Wednesday, I'm going to go clubbing with my friends.\"",
    "gen_sit": "I'm really stressed out lately. My final exams are really taking a toll on me. When it's finally over on Wednesday,     I'm going to go clubbing with my friends."
  },
  "PMUL0318": {
    "exchange": "\"User: My friend's coming over this weekend.\",\n\"System: That's nice!\",\n\"User: I'm hoping to catch up with him over a nice meal. Just not entirely sure where to eat.\",\n'System: You should probably look around while you have time.',\n'User: Good point. Just a slight problem, I think he only eats halal food and I have no idea which restaurants are halal.'",
    "gen_sit": "My friend's coming over this weekend and I'm hoping to catch up with him over a nice meal. The problem is, he only eats halal food and I have no idea which restaurants are halal."
  },
  "SNG01953": {
    "exchange": "\"User: Hopefully it's not too crowded at that hour...\",\n'System: Ooh, where would you be going? Somewhere fun?',\n'User: Haha. Meeting my family later tonight. Nothing like a night outing!',\n'System: Hope you have fun!',\n\"User: Definitely! Hmm. Very cerain they said to meet at the Ruskin Gallery? If I'm not mistaken...\"",
    "gen_sit": "I'm planning to meet my family later tonight. We'll be meeting at the Ruskin Gallery. I hope it's not too crowded.     I'm looking forward to a night outing!"
  },
  "SNG01609": {
    "exchange": "'User: Wonder what would they love to eat this time?',\n\"System: Hmm. Sounds like someone'e coming?\",\n'User: My parents are joining me for a meal soon. Just considering our meal choices...',\n'System: Ooh, sounds great!',\n\"User: Hmm. We hadn't had some Mediterranean food in a long while, so maybe that might be perfect? Hope they like it!\"",
    "gen_sit": "My parents are joining me for a meal soon. I'm considering our meal choices. We hadn't had some Mediterranean food in a long while, so maybe that might be perfect? Hope they like it!"
  },
  "PMUL4289": {
    "exchange": "\"User: Ooh, can't wait! We've been waiting for this for years!\",\n'System: Sounds exciting! Mind telling me more?',\n'User: Finally going to Britian for a tour! Gonna move on to the rest of the country with my family too!',\n'System: I am happy for you!',\n'User: Just cannot wait for all the nice things in Cambridge we saw online! Only a few more days.'",
    "gen_sit": "I've been waiting for this for years! I'm finally going to Britain for a tour with my family! We're excited to     see all the nice things in Cambridge we saw online! Only a few more days."
  },
  "PMUL3362": {
    "exchange": "\"User: Maybe it'll be a great chance to refresh my memory too?\",\n\"System: What's going on?\",\n\"User: Haha. Gonna meet up with a couple of friends over some food. Decided to try something they haven't had.\",\n'System: Great idea, friend!',\n'User: Might as well let it jog my memory, since the last time I had French food was a few years ago!'",
    "gen_sit": "I'm planning to meet up with some friends and try some new food. I haven't had French food in a few years, so it'll be a great chance to refresh my memory."
  },
  "SNG0567": {
    "exchange": "\"User: Hope they'll enjoy their time here!\",\n\"System: I'd bet they would! But, who?\",\n\"User: Haha. My extended family is coming from overseas for the first time! It's gonna be fun!\",\n'System: I am happy for you!',\n\"User: Figured might as well let them try good old British food! Can't wait to see what they say!\"",
    "gen_sit": "My extended family is coming from overseas for the first time! They're here to enjoy themselves and try good old British food! I can't wait to see what they say!"
  },
  "PMUL0605": {
    "exchange": "\"User: Can't wait to finally leave on this trip!\",\n'System: Sounds exciting!',\n'User: Been working for the last few months, and now I finally get to have a small vacation!',\n'System: Ooh, I am happy for you!',\n'User: Just a few more days to Thursday! Ugh, feels so long sometimes!'",
    "gen_sit": "I've been working for the last few months and I'm finally taking a small vacation! I'm excited but     it feels like Thursday is taking forever to arrive."
  },
  "PMUL0622": {
    "exchange": "\"User: The weekend just can't come soon enough, huh?\",\n'System: Is there something wrong?',\n'User: Haha. Nothing at all. In fact, I just cannot wait to meet my family for a gathering this weekend!',\n'System: Ooh, sounds exciting!',\n'User: Gotta meet them on Saturday! Wonder what other things can we do?'",
    "gen_sit": "I'm excited about meeting my family for a gathering this weekend! I'm thinking of other things we can do together."
  },
  "PMUL4793": {
    "exchange": "'User: Glad I live around here.',\n'System: Love it here! But, may I ask, why is that?',\n\"User: Guess it's because I grew up here? Loved the memories I made here. The convenience to get around is just a bonus.\",\n'System: I fully agree!',\n\"User: Sometimes I don't even feel like leaving Cambridge! Eh, travelling's fun enough anyway.\"",
    "gen_sit": "I love living in Cambridge because I grew up here and have many fond memories. The convenience of getting around is a bonus, but sometimes I don't even feel like leaving Cambridge. I enjoy travelling, but it's nice to have the option to stay local."
  },
  "SNG0277": {
    "exchange": "'User: Too bad we gotta be home soon...',\n'System: Hmm. Why is that?',\n'User: Haha. Our trip is coming to an end! Still gotta go back to normal life again! Ugh.',\n'System: Oh, but it was fun right?',\n\"User: Definitely! Eh, it's great to go back home anyway. Won't be long before another trip back here in London Kings Cross like this!\"",
    "gen_sit": "I'm on a trip and it's coming to an end. I'll be returning home soon, but I'm looking forward to another trip back to London Kings Cross in the future."
  },
  "SNG0384": {
    "exchange": "\"User: Can't wait to go home already!\",\n\"System: Great! Home is always where I'd be happy to be!\",\n\"User: Haha. Bought some new gadgets that I'd love to try at home! So exciting!\",\n'System: Sounds fantastic!',\n\"User: Wonderful that it doesn't take that long to reach home in Cambridge from here! Love how it's so convenient!\"",
    "gen_sit": "I can't wait to go home! I've bought some new gadgets that I'm excited to try. I live in Cambridge and it's convenient that it doesn't take long to get home from here."
  },
  "PMUL3817": {
    "exchange": "'User: What a great time to be alive!',\n'System: Indeed! But may I ask your reason?',\n\"User: Since I've been here, it's been wonderful seeing all the places I used to see only online! Learnt so much here!\",\n'System: I am happy for you!',\n'User: Haha. Still have some museums left if I recall correctly. Ugh, forgot which they were...'",
    "gen_sit": "I have been here and it's been wonderful seeing all the places I used to see only online! I've learnt so much     here! I still have some museums left to visit, but I can't recall which ones."
  },
  "PMUL4439": {
    "exchange": "\"User: Suppose they wouldn't mind Oriental food later right? Been awhile since we last had that together!\",\n'System: Ooh, who are you dining with?',\n\"User: Haha. Just felt like my family wouldn't mind sticking with our favourite cuisine.\",\n\"System: I see. That's fine too!\",\n'User: Hmm. Dinner at some Chinese restaurant sounds like a plan to me!'",
    "gen_sit": "I was thinking of having dinner with my family at a Chinese restaurant. We haven't had Oriental food in a while,     so I thought it would be a good idea to stick with our favorite cuisine."
  },
  "MUL0302": {
    "exchange": "'User: Hope this meeting goes well...',\n'System: Hope so too! But what is it?',\n\"User: Haha. Gotta meet with a client next week. There's potential for a great deal for our company!\",\n'System: I am happy for you!',\n\"User: Going down earlier to prepare coming Monday! Can't wait!\"",
    "gen_sit": "I have a meeting with a client next week. There's potential for a great deal for our company! I'm going down earlier to prepare for the meeting on Monday."
  },
  "MUL1326": {
    "exchange": "'User: Perhaps now would be a great time to be adventurous?',\n\"System: Any time would be great time, isn't it?\",\n\"User: Haha. Got a trip with friends coming up, and figured we'd try something new for our meals!\",\n'System: Sounds exciting!',\n'User: Wonder if some of the Afghan restaurants would be perfect?'",
    "gen_sit": "I have a trip with friends coming up and we're looking to try something new for our meals. I wonder if some of the Afghan restaurants would be perfect?"
  },
  "PMUL1052": {
    "exchange": "\"User: Guess it's back to the hotel early for me! Looking forward to watch some local television anyway...\",\n'System: Oh, something happen?',\n\"User: My friends want to check the the nightlife in the area, but I'm not interested.\",\n'System: Ah, I see.',\n'User: Hope you have ideas to help get my friends to a nightclub?'",
    "gen_sit": "I'm returning to my hotel early. My friends want to check out the nightlife in the area, but I'm not interested.     I'm hoping for ideas to help get my friends to a nightclub."
  },
  "PMUL1142": {
    "exchange": "\"User: Can't wait to meet my family again after so long!\",\n'System: Why is that?',\n\"User: Haha. Just that we've been so busy, we hadn't had the time to properly meet up in months!\",\n'System: Oh, I am happy for you!',\n'User: Yes! Finally get to catch up with them! Going to London Kings Cross is just a bonus!'",
    "gen_sit": "I haven't had the chance to properly meet up with my family in months, so I'm excited to catch up with them soon.     Going to London Kings Cross is just a bonus!"
  },
  "MUL0227": {
    "exchange": "'User: Good time to have something different this time round!',\n'System: What is it?',\n\"User: Meeting my parents for dinner this weekend, and that's what they said.\",\n'System: I am happy for you!',\n'User: Different? Perhaps Mediterranean food for a change then? Hope they like it!'",
    "gen_sit": "I'm meeting my parents for dinner this weekend and they suggested trying something different. I'm thinking of trying     Mediterranean food for a change."
  },
  "PMUL0607": {
    "exchange": "'User: Hope we have time to do more this time...',\n'System: Might I ask, do more of what?',\n'User: Haha. Bringing my parents over to my house. Just hoping that I have more free time from work this time to bring them around!',\n'System: Sounds exciting!',\n'User: Always feels great going home to Cambridge! Really feels like home!'",
    "gen_sit": "I'm hoping to have more free time from work to bring my parents, who live in Cambridge, around. I always feel     great going home to Cambridge! It really feels like home!"
  },
  "PMUL0356": {
    "exchange": "'User: Only one way to find out!',\n'System: To find what out?',\n'User: Was watching some videos on YouTube and they gave this place great reviews, and now I wanna go!',\n'System: Sounds exciting!',\n\"User: Wonder if De Luca Cucina and Bar is as good as they say? I don't wanna waste my money and time!\"",
    "gen_sit": "I was watching some videos on YouTube and they gave this place great reviews, and now I wanna go! I'm wondering if De Luca Cucina and Bar is as good as they say? I don't wanna waste my money and time!"
  },
  "MUL0376": {
    "exchange": "'User: Hope to see you again soon...',\n'System: Me too! Wait?',\n\"User: Just kidding, I'm just going away for a short trip, not going away permanently!\",\n'System: Mm-hm?',\n\"User: I just can't wait to finally escape Cambridge after so much work, even if it's just a few days! Ooh, yes!\"",
    "gen_sit": "I'm going away for a short trip, not permanently. I can't wait to finally escape Cambridge after so much work, even if it's just a few days! Ooh, yes!\n\n\n1.  Which of the following best describes the user's situation in the first exchange?\nA. The user is planning a trip to London.\nB. The user is getting married.\nC. The user is meeting a friend at a train station.\nD. The user is looking for help with travel plans.\n\n2.  Which of the following best describes the user's situation in the second exchange?\nA. The user is looking for a new job.\nB. The user is going on a holiday.\nC. The user is moving to a new city.\nD. The user is planning a wedding.\n\n3.  Which of the following best describes the user's situation in the third exchange?\nA. The user is planning a trip with friends.\nB. The user is looking for a new job.\nC. The user is going on a holiday.\nD. The user is moving to a new city."
  },
  "MUL2421": {
    "exchange": "'User: Love to read all these food blogs!',\n'System: Why is that?',\n\"User: There's hidden gems like good writing, and of course, great food waiting to be discovered!\",\n'System: Sounds exciting!',\n\"User: Ah! I remember now! There's this place I saw a while back. The Jinling Noodle Bar, I am certain!\"",
    "gen_sit": "I love reading food blogs because of the hidden gems like good writing and great food waiting to be discovered.     I remember a place I saw a while back, the Jinling Noodle Bar."
  },
  "PMUL1054": {
    "exchange": "\"User: Wonder if there's enough time for everything?\",\n\"System: What's going on?\",\n'User: Going to have a dinner outside with my family, but we plan on shopping too! Just thinking about time...',\n'System: Ah, I see. Sounds like fun to me!',\n\"User: We'll make it work! Wonder if you know how to get us to Bishops Stortford? Hoping to cram as much into the time we have, haha.\"",
    "gen_sit": "I'm planning to have dinner outside with my family and go shopping, but I'm worried about time. I'm hoping to cram as much     as possible into the time we have. I'm considering going to Bishops Stortford."
  },
  "PMUL4791": {
    "exchange": "\"User: Can't wait to go back there again!\",\n'System: Haha, mind telling me where?',\n\"User: Planned for a short jaunt outta town, at somewhere I've been wanting to go back to see in a long time!\",\n'System: Sounds exciting!',\n\"User: Cambridge here I come! Since now that work's finally been done with, yay!\"",
    "gen_sit": "I'm planning a short trip out of town to a place I've been wanting to visit again for a long time. I'm excited to go to Cambridge! Work has finally been completed, and I'm looking forward to my trip."
  },
  "SNG02057": {
    "exchange": "'User: Hope they like it there!',\n\"System: Ooh, who's coming?\",\n'User: Found some great places to see online, planning to bring my parents along!',\n'System: Sounds fun!',\n\"User: We'd be seeing Old Schools first! Heard great things about it!\"",
    "gen_sit": "I'm planning to bring my parents on a trip and have found some great places to see online. We'll be seeing Old Schools first."
  },
  "MUL0445": {
    "exchange": "'User: Hope they are still staying there...',\n'System: What is it?',\n'User: Haha. Planning to go back to my hometown and maybe see my old neighbours!',\n'System: Sounds exciting!',\n\"User: Sadly, I don't really know what's the best way to Norwich...  Hope you know better than me, haha!\"",
    "gen_sit": "I'm planning to go back to my hometown and see my old neighbors. I don't know the best way to Norwich."
  },
  "MUL0093": {
    "exchange": "\"User: I'm bringing my family to a 1 Star Michelin restaurant called The Lucky Star.\",\n'System: Wow, I bet the food there cost quite a bit.',\n'User: My friend is the manager there. He said he could get me a discount.',\n'System: That would certainly hurt your wallet less.',\n\"User: Haha, I would've never thought of dining there if it wasn't for that offer.\"",
    "gen_sit": "I'm bringing my family to a 1 Star Michelin restaurant called The Lucky Star. My friend is the manager there and     has offered me a discount."
  },
  "MUL2309": {
    "exchange": "'User: Been awhile since I last tried their food...',\n'System: Hmm. Where are you thinking of?',\n'User: Haha. Just looking through photos of old celebrations, and remembered some places I used to eat at.',\n'System: I see.',\n\"User: Hmm. Why don't I go eat at some Turkish restaurant? Craving their food now...\"",
    "gen_sit": "I have not eaten at a Turkish restaurant in a while and I'm craving their food. I'm thinking of going to eat at one."
  },
  "PMUL4612": {
    "exchange": "'User: Wonder how are they doing right now?',\n'System: Who are you thinking of?',\n'User: Happened to think back to my travels overseas, and just wondering how are the friends I made doing now...',\n'System: I see.',\n\"User: Haha, why don't I go get some South Indian food for lunch? I still have fond memories of travelling there.\"",
    "gen_sit": "I was thinking about my friends whom I made during my travels overseas and wonder how they are doing now. I still have fond memories of travelling and thought about getting some South Indian food for lunch."
  },
  "PMUL0717": {
    "exchange": "\"User: Sometimes I wish travelling weren't such a two-edged sword...\",\n'System: Oh. Would you mind telling me why?',\n\"User: On one hand, it's really fun! But then sometimes it feels like such a hassle.\",\n'System: I get what you mean!',\n\"User: You know what? Travelling from Cambridge this week feels like the latter this time. At least the job's good, and I get to do what I want...\"",
    "gen_sit": "I wish travelling weren't such a two-edged sword... Sometimes it feels like a hassle, especially this week travelling from Cambridge.     However, my job is good and I get to do what I want."
  },
  "MUL2152": {
    "exchange": "'User: I will be meeting my brother after three years.',\n\"System: Wow, that's a long time!\",\n'User: He loves travelling, just like me.',\n'System: I love it too!',\n'User: He is going to start his training from next week at Stansted airport.'",
    "gen_sit": "I will be meeting my brother after three years. He loves travelling, just like me. He is going to start his training from next week at Stansted airport."
  },
  "PMUL1721": {
    "exchange": "'User: Sometimes it feels so great travelling on a weekday, you know?',\n\"System: What's your reason?\",\n'User: When other people are working 9 to 5, feels great to be doing non-work related stuff on such days!',\n'System: I get what you mean!',\n\"User: Looks like Thursday would be that kind of day this time! I can't wait!\"",
    "gen_sit": "I love traveling on weekdays because it feels great to do non-work related stuff while others are working 9 to 5. This     Thursday will be one of those days and I can't wait!"
  },
  "PMUL3591": {
    "exchange": "\"User: Haven't been out in awhile man...\",\n'System: Why is that?',\n'User: Haha. Work, I guess? Been pushing deadlines for weeks now.',\n'System: Oh dear.',\n\"User: Got some free time coming up! I can't wait to go visit a college somewhere!\"",
    "gen_sit": "I haven't been out in a while because I've been busy with work, pushing deadlines for weeks. However, I have some free time coming up and I'm looking forward to visiting a college somewhere."
  },
  "SNG0068": {
    "exchange": "'User: Hope I can make it for this appointment...',\n'System: Anything wrong?',\n'User: Oh dear, I woke up later than planned, and I still got a meeting to catch!',\n\"System: Hope there's still time!\",\n'User: Seems like I really gotta hurry down to Travellers Rest... I wonder if the traffic is bad?'",
    "gen_sit": "I woke up later than planned and I still have a meeting to catch! I wonder if the traffic is bad on the way to Travellers Rest."
  },
  "MUL2693": {
    "exchange": "'User: Seems like all these places are ones which I want to see!',\n'System: Hmm? Tell me more!',\n'User: Reading some travel guides, and found some interesting places to visit!',\n'System: I am happy for you!',\n'User: This one seems nice! I wanna go to the Whipple Museum of the History of Science, heard of it?'",
    "gen_sit": "I have been reading travel guides and found some interesting places to visit. I want to go to the Whipple Museum of the History of Science."
  },
  "SNG01320": {
    "exchange": "\"User: My aunt's family recently moved into their new house near Rajmahal.\",\n'System: Congratulations to them!',\n'User: I am going to visit them soon.',\n\"System: That's exciting, hope you have fun!\",\n\"User: It's been three years since I met them.\"",
    "gen_sit": "My aunt's family recently moved into their new house near Rajmahal. I'm planning to visit them soon,     it's been three years since I last met them."
  },
  "MUL1669": {
    "exchange": "\"User: Can't wait for the good times ahead!\",\n'System: Why is that?',\n'User: Finally get to travel with my best friends after so long! So much to do, haha!',\n'System: I am happy for you!',\n'User: And this week, we finally get to go back to the Maharajah Tandoori Restaurant! Miss the food there so much!'",
    "gen_sit": "I'm excited about the good times ahead! I get to travel with my best friends after a long time and we're looking     forward to going back to the Maharajah Tandoori Restaurant, which we miss a lot!"
  },
  "SNG1119": {
    "exchange": "\"User: Haven't seen a film in what feels like forever!\",\n'System: Why is that?',\n\"User: Hmm. Just that there wasn't anything interesting to me screening, really.\",\n'System: Ah, I see.',\n'User: Think there should be some out now! To the cinema it is for me then!'",
    "gen_sit": "Haven't seen a film in what feels like forever! There hasn't been anything interesting screening, but I think     there should be some out now. I'm planning on going to the cinema!"
  },
  "PMUL1132": {
    "exchange": "\"User: Can't wait to finally leave town for awhile!\",\n'System: Why is that?',\n\"User: Haven't got the chance to travel until now! So exciting!\",\n'System: Exciting indeed!',\n\"User: Hmm. Let's see, our first stop is Norwich! Got some food to try there! I remember we went there once before...\"",
    "gen_sit": "I haven't got the chance to travel until now and I'm excited to leave town for a while. Our first stop is Norwich, where we'll try some food and reminisce about our past visit."
  },
  "MUL2277": {
    "exchange": "'User: Cannot wait for this weekend to begin! Ugh!',\n'System: What will you do?',\n\"User: I'm going on a short jaunt with my friends just to relax! Been some months!\",\n\"System: I'm happy for you!\",\n\"User: Yay! Gonna depart on Friday. Hope I didn't miss anything else of note! I don't know why it still feels kinda far away...\"",
    "gen_sit": "I cannot wait for this weekend to begin! I'm going on a short trip with my friends to relax, it's been some months!     I'll be departing on Friday."
  },
  "MUL1995": {
    "exchange": "\"User: Can't wait to go on a short vacation already!\",\n'System: Why is that?',\n'User: Feel like unwinding, since my exams are finally over!',\n\"System: I'm happy for you!\",\n\"User: Glad my family are all coming along! We'd love to see some famous college!\"",
    "gen_sit": "I can't wait to go on a short vacation already! My exams are finally over and I feel like unwinding. My family     are all coming along and we'd love to see some famous college!"
  },
  "MUL1341": {
    "exchange": "'User: Feels great to be able to travel solo!',\n'System: Why is that?',\n\"User: Feels like less hassle and more freedom, doesn't it? I can do as I please.\",\n'System: Ah, I see!',\n'User: Ah, I know! Wanna go to some Chinese restaurant for breakfast on the first day!'",
    "gen_sit": "I'm feeling great about traveling solo. I feel like it's less hassle and more freedom. I can do as I please. I'm planning to go to a Chinese restaurant for breakfast on the first day."
  },
  "MUL1476": {
    "exchange": "\"User: I've been away on business for quite some time, but I'm finally coming home soon.\",\n\"System: It must have been tough. What's the first thing you want to do when you get back?\",\n\"User: I'm actually planning to surprise my wife. I told her that I would be returning next week instead of this week.\",\n\"System: Haha, she would've never seen it coming.\",\n\"User: Yeah, I'll drop by her cafe in Cambridge the moment I land back in the UK. I can't wait to see her reaction!\"",
    "gen_sit": "I've been away on business for quite some time, but I'm finally coming home soon. I'm planning to surprise my wife by     returning earlier than expected and visit her at her cafe in Cambridge."
  },
  "PMUL3756": {
    "exchange": "\"User: Looks like they all can't wait to go home...\",\n'System: Why is that?',\n\"User: Haha. Have been out the whole week shopping with the family, so it's natural that they are tired already...\",\n'System: Must have been fun, right?',\n\"User: Definitely! I hope it isn't too crowded for us when we gotta head home to Cambridge. We've got lots to carry...\"",
    "gen_sit": "I've been out shopping with my family the whole week and everyone's tired. We're planning to head home to Cambridge,     but I'm worried about the crowd and all the things we have to carry."
  },
  "MUL0321": {
    "exchange": "\"User: Ooh, can't wait to try all of those delicacies!\",\n'System: What are you referring to?',\n'User: Looking online at some Japanese restaurant! Everything looks so mouth-watering...',\n'System: Haha, I concur!',\n\"User: Wagamama is the place, have you heard of it? We'd love to go there.\"",
    "gen_sit": "I am looking forward to trying out some delicacies at a Japanese restaurant, possibly Wagamama."
  },
  "PMUL3835": {
    "exchange": "\"User: Hmm. How I wish I've been there before!\",\n'System: What is it?',\n\"User: Ah, watching a travel show just now! Maybe it's because it's so unfamiliar, that I want to try it so much!\",\n'System: I see.',\n\"User: Especially the Russian cuisine! Haven't seen, much less tasted, anything like that in my life before!\"",
    "gen_sit": "I was watching a travel show and saw a place I've never been to before. It looks interesting and I wish I could     experience it for myself, especially the Russian cuisine."
  },
  "MUL0657": {
    "exchange": "\"User: This weekend's gonna be exciting!\",\n'System: Why is that?',\n\"User: Gonna go on another solo trip outta town! Can't wait!\",\n\"System: I'm happy for you!\",\n\"User: Suddenly, Sunday seems like it's so far away! But I'm sure to manage...\"",
    "gen_sit": "I'm going on another solo trip out of town this weekend. I'm excited, but I'm also feeling a bit anxious     about the wait until Sunday."
  },
  "PMUL2301": {
    "exchange": "'User: Wonder what will they bring this time?',\n'System: What is it?',\n'User: Got family over on one of their yearly visits! They always bring gifts!',\n\"System: Now I'm wondering, what would they bring this time?\",\n\"User: Ah well, will find out soon! Onto more important things: we're gonna eat at Sitar Tandoori again!\"",
    "gen_sit": "Family is visiting on one of their yearly visits! They always bring gifts! We're planning to eat at Sitar Tandoori again!"
  },
  "SNG0381": {
    "exchange": "'User: Hmm. Wonder how the weather will be like?',\n'System: Anything wrong?',\n'User: Haha, nope. Going on a trip this weekend, just thinking about the weather.',\n'System: Hope it stays great then!',\n\"User: Same! Can't wait to set off this Sunday! Been some time since our last outing.\"",
    "gen_sit": "I'm going on a trip this weekend and I'm thinking about the weather. I'm excited to set off this Sunday, it's been a while since our last outing."
  },
  "SNG0442": {
    "exchange": "\"User: Can't wait to travel again!\",\n'System: Why is that?',\n'User: Have been cooped up at home for the last few months for studies! Great time to stretch my legs again!',\n\"System: I'm happy for you!\",\n'User: Been meaning to go Leicester for quite awhile now, finally got my chance!'",
    "gen_sit": "I've been cooped up at home for the last few months for studies and I'm excited to stretch my legs again! I've     been meaning to go to Leicester for quite awhile now and I'm finally getting my chance!"
  },
  "MUL0933": {
    "exchange": "'User: My aunt is visiting me next week.',\n\"System: That's nice, hope you have fun!\",\n'User: I am going to meet her after four years.',\n\"System: Wow, that's a long time!\",\n'User: She wanted to visit downing college the last time she came, but we ran out of time.'",
    "gen_sit": "My aunt is visiting me next week. I haven't seen her in four years. She wanted to visit Downing College     the last time she came, but we ran out of time."
  },
  "MUL2526": {
    "exchange": "'User: My aunt is visiting me next week.',\n\"System: That's nice, hope you have fun!\",\n'User: I am going to meet her after four years.',\n\"System: Wow, that's a long time!\",\n'User: She loves visiting museums.'",
    "gen_sit": "My aunt is visiting me next week. I haven't seen her in four years. She loves visiting museums."
  },
  "MUL1003": {
    "exchange": "\"User: My aunt's family recently moved in to their new house near Cambridge Artworks.\",\n\"System: That's nice, congratulations to them!\",\n'User: I am going to visit them soon.',\n'System: Hope you have fun!',\n'User: I am going to meet her after three years.'",
    "gen_sit": "My aunt's family recently moved into their new house near Cambridge Artworks. I'll be visiting them soon,     after three years."
  },
  "MUL0337": {
    "exchange": "'User: Have you ever been to a game convention?',\n'System: No, what is it like?',\n\"User: It's a dream come true for nerds! There are video game announcements, booth showcases, and tons of cosplays.\",\n'System: That sounds like fun! I would love to check it out.',\n\"User: One of the largest ones this year is happening in Cambridge right now, and you can bet I'll be there.\"",
    "gen_sit": "I have not been to a game convention before. I was told it's a dream come true for nerds! There are video game     announcements, booth showcases, and tons of cosplays. One of the largest ones this year is happening in Cambridge right now, and I'll be there."
  },
  "MUL1770": {
    "exchange": "\"User: I'm thinking hard about what major I would like to pursue.\",\n'System: If you have some idea of your interests, that could be a starting point.',\n\"User: I'm really passionate about art and design, but I'm also inclined towards engineering.\",\n\"System: Those fields aren't necessarily mutually exclusive, you know.\",\n\"User: You're actually right! It seems like architecture is one of the few subjects that combines both.\"",
    "gen_sit": "I'm currently contemplating what major I'd like to pursue. I'm really passionate about art and design, but I'm also     inclined towards engineering. Architecture seems to be a suitable option since it combines both."
  },
  "SNG02221": {
    "exchange": "'User: Being a teacher is tough.',\n'System: You can share your woes with me.',\n\"User: Although we knock off by the time the school is closed, there's always so much work that needs to be brought back home.\",\n'System: I see. Your work-life balance must be greatly affected then.',\n\"User: Indeed. My friends actually wanted to hang out after work on Monday, but I'm worried I can't finish marking my scripts.\"",
    "gen_sit": "Being a teacher is tough. There's always so much work that needs to be brought back home, greatly affecting my work-life balance. My friends want to hang out after work on Monday, but I'm worried I can't finish marking my scripts."
  },
  "MUL2100": {
    "exchange": "'User: My hobby is collecting figurines.',\n\"System: That's pretty cool. But I heard that those things are pretty expensive.\",\n\"User: Yeah, they're about as expensive as collecting shoes.\",\n\"System: Hey, if it makes you happy, I don't see any problem!\",\n'User: I get most of my collection from this shop in Peterborough. The owner always reserves the latest releases for me.'",
    "gen_sit": "I collect figurines. They can be pretty expensive, but I get most of my collection from a shop in Peterborough. The owner     always reserves the latest releases for me."
  },
  "PMUL1181": {
    "exchange": "'User: My mom had gone back to stay at Cambridge instead of staying here with us.',\n'System: What happened? Does she not want to stay with you guys?',\n\"User: She just feels that this place is too foreign and different from cambridge, but it is understandable, she's been there her whole life.\",\n'System: I have read before that when people gets older they tend to prefer things to be the same instead of having changes.',\n'User: I think that is one factor! But I really wanted her to stay here instead so that we can take care of her.'",
    "gen_sit": "My mom has gone back to stay at Cambridge instead of staying with us. She feels that this place is too foreign and different from Cambridge, but it is understandable, she's been there her whole life. I wanted her to stay here so that we can take care of her."
  },
  "PMUL4053": {
    "exchange": "'User: I think cooking at home might just be cheaper than going to restaurants.',\n'System: Well that really depends on a lot of things, especially what you cook.',\n'User: That is true! But the general rule is the more people you cook for the more value it gets.',\n'System: Right, that is exactly what economies of scale means haha.',\n'User: Though I must admit some food outside is really good, I especially like Italian restaurants.'",
    "gen_sit": "I think cooking at home might just be cheaper than going to restaurants. The general rule is the more people you cook for, the more value it gets. However, I must admit that some food outside is really good, especially Italian restaurants."
  },
  "MUL1160": {
    "exchange": "'User: I think it is extremely important to cultivate the kids interest since young.',\n'System: Is it! So what are you trying to get your kid to like?',\n'User: I am trying to get him all interested in things like natural sciences and history!',\n'System: How exactly did you go about doing that actually? Did you draw up a plan.',\n'User: Not really, just expose him more to them. For example whipple museum of the history of science is having an exhibition, and I can use that opportunity!'",
    "gen_sit": "I believe it's important to cultivate kids' interests from a young age. I'm trying to get my kid interested in natural sciences and history. I'm not following a specific plan, but I'm exposing him to more opportunities, such as the Whipple Museum of the History of Science exhibition."
  },
  "MUL1381": {
    "exchange": "\"User: I don't get why so many restaurants dare to charge exorbitant prices these days.\",\n'System: Well honestly it might just be that they have a rising cost of production as well.',\n'User: I highly doubt so! I have a friend in the line of work and he tells me about them all the time.',\n'System: But if they are randomly hiking prices surely there are authorities there to stop it.',\n'User: No one sees it as a problem! The only good and cheap restaurants these days are like Indian restaurant.'",
    "gen_sit": "I am frustrated with the high prices of restaurants. I have a friend in the industry who tells me about their     rising cost of production. However, I believe that the prices are still too high and that there should be authorities to stop     it. The only affordable restaurants I know of are Indian restaurants."
  },
  "MUL0476": {
    "exchange": "'User: The public transport system here in Cambridge is terrible!',\n'System: You sound like you had a very unpleasant experience here.',\n'User: I did! I waited like 1 hr for a bus today! It almost made me late for my meeting.',\n\"System: I am so sorry to hear that, but that might also just be a mere coincidence as well or accidents could've happened.\",\n'User: No way! The exact same thing happened to my friend a few days ago, it is way too frequent to be accidents.'",
    "gen_sit": "I have had a very unpleasant experience with the public transport system in Cambridge. I waited for almost an hour for a bus and it almost made me late for my meeting. My friend also had a similar experience a few days ago."
  },
  "PMUL4126": {
    "exchange": "'User: My friend living at bishops stortford called me to go over as soon as I can.',\n'System: Oh no! I hope nothing bad happened to him or her?',\n\"User: No but she said that there is some weird person outside her door, and she's really scared.\",\n'System: So instead of calling the police she called you instead? Makes no sense to me!',\n'User: Well actually I am a police myself haha, I am just going to go over and take a look.'",
    "gen_sit": "My friend living at Bishops Stortford called me to come over as soon as possible. She's scared because there's a weird person     outside her door. I'm a police officer, so I'm going to go over and take a look."
  },
  "PMUL1557": {
    "exchange": "'User: My annual check up is on thursday I am so lazy to go for it.',\n\"System: Hey they are really important, don't treat it so lightly!\",\n'User: But I feel perfectly healthy, I can tell when something feels wrong or off.',\n\"System: Well many illness don't show any symptoms until it is really too late! You can never be too careful!\",\n\"User: Well I see it as that if it is your time to go, then you shouldn't fight against it.\"",
    "gen_sit": "I have an annual check-up on Thursday, but I'm feeling lazy and don't want to go. I feel perfectly healthy and don't think it's necessary. However, the system has pointed out that many illnesses don't show symptoms until it's too late, and it's important to be careful. Despite this, I still have a fatalistic view that if it's my time to go, then I shouldn't fight against it."
  },
  "SNG0314": {
    "exchange": "'User: My daughter is graduating from university on Tuesday, I am so proud of her!',\n'System: Wow! Congratulations I am sure it is something off your shoulders as well now that she can support herself.',\n'User: Yes absolutely! The pressure of the whole family depending on you is not funny at all.',\n'System: Well how are you planning to celebrate it for her then?',\n\"User: She's in university! Of course she's got plans with her own friends, we will probably just go out for a simple meal.\"",
    "gen_sit": "My daughter is graduating from university on Tuesday. I am so proud of her! The pressure of the whole family     depending on me is not funny at all. We will probably just go out for a simple meal to celebrate."
  },
  "PMUL1879": {
    "exchange": "\"User: I can finally travel overseas again! It's been years!\",\n'System: What happened in the past few years?',\n'User: I was banned from leaving the country due to some personal financial issues, but now it is all done!',\n'System: Congrats! Where are you going to fly off from then?',\n\"User: I am flying from stansted airport, then meet up with my wife there, we haven't met in years.\"",
    "gen_sit": "I haven't been able to travel overseas for years due to personal financial issues, but now I'm free to go! I'm flying from Stansted Airport, where I'll meet up with my wife. We haven't seen each other in years."
  },
  "SNG0271": {
    "exchange": "\"User: Oh my god I can't wait for Friday to come!\",\n\"System: What is happening on that day? I don't remember anything special.\",\n'User: Hahah I bought the newest earphones from Sony and they are arriving on that day.',\n'System: I see so you are all excited to try it out huh!',\n'User: Absolutely! I have been watching the reviews all over the internet and all of them talks about how good it is.'",
    "gen_sit": "I am excited for Friday to arrive because my new Sony earphones will be arriving. I've been watching reviews all over the internet and they all say it's great."
  },
  "PMUL1159": {
    "exchange": "'User: After so many years of suffering I can finally divorce my husband.',\n'System: What happened between the two of you if I may ask?',\n\"User: He is addicted to gambling, and frequently takes it out on me, I can't stand it anymore.\",\n'System: Great that you are leaving him! Should have done it much earlier to scums like that.',\n'User: Yeah I always had the idea that he might change for the better, but I have come to my senses. The paper signing is on Monday.'",
    "gen_sit": "I have been suffering for many years in my marriage due to my husband's gambling addiction and abuse. I have finally made the decision to divorce him and the paper signing is on Monday."
  },
  "PMUL3363": {
    "exchange": "'User: My teeth is hurting so bad jeez I really need to get it checked.',\n'System: What are  you waiting for then, go and see a dentist now!',\n'User: I am really busy lately, so I scheduled the appointment on Sunday instead.',\n'System: Nothing is more important than your health, could be something serious you never know.',\n'User: It is just a toothache how bad can it be! I have had similar experiences before so it is fine.'",
    "gen_sit": "I have a toothache and need to get it checked. I'm busy and scheduled the appointment on Sunday instead. I've had similar experiences before, so I'm not too worried."
  },
  "MUL0603": {
    "exchange": "'User: My sister is getting married I am so happy for her!',\n'System: Congratulations! What kind of ceremony is it going to be.',\n\"User: She's the type that likes to keep it simple, so just a small private ceremony in Broxbourne\",\n'System: I see! What are you planning to get for her then I am really curious.',\n'User: That is a secret! I spent like a bomb on this gift so I hope she will like it!'",
    "gen_sit": "My sister is getting married and I'm really happy for her! It's going to be a small, private ceremony in Broxbourne. I've gotten her a gift, but it's a secret! I spent a lot on it, so I hope she'll like it!"
  },
  "PMUL2389": {
    "exchange": "'User: I have always been fascinated with the different ways cuisines are prepared around the world.',\n'System: Are you keeping that as a hobby or do you do this full time.',\n'User: Full time! My job is in the food industry so it is actually related.',\n'System: Which cuisine do you think has the best way of preparing their food then?',\n'User: I would say that Mexican restaurants always does it in a very unique way compared to the others.'",
    "gen_sit": "I have always been fascinated with the different ways cuisines are prepared around the world. I work full time in the food industry and think Mexican restaurants have a unique way of preparing their food."
  },
  "MUL0178": {
    "exchange": "'User: I am so tired of eating western food all the time.',\n'System: Well go for a change! No one is stopping you.',\n'User: Hmm well but I am afraid that it will taste bad!',\n'System: Well honestly you always need to take the risk, it is necessary if you want to experience something new',\n'User: Right! Then probably chinese restaurant, they fit my taste a bit more to be honest.'",
    "gen_sit": "I am tired of eating western food all the time. I want to try something different, but I'm afraid it might taste bad.     I'm considering going to a Chinese restaurant because their food fits my taste a bit more."
  },
  "SNG1069": {
    "exchange": "'User: My daughter has been pestering me to bring her out.',\n'System: Well then just do it! Any good reasons not to fulfill her request?',\n'User: She just recovered from a flu, I am not sure if she will get too tired from going out.',\n'System: You could bring her somewhere that is more chill and comfortable, indoors perhaps.',\n'User: Now that you mention it, she has always wanted to visit a museum, seems like a great choice for today.'",
    "gen_sit": "My daughter has been pestering me to bring her out. She just recovered from a flu, so I was hesitant. However,     I've decided to bring her to a museum, seems like a great choice for today."
  },
  "SNG1142": {
    "exchange": "\"User: I'm currently directing and filming a web drama.\",\n\"System: Cool! What's the story about?\",\n'User: It revolves around teenage romance on campus.',\n'System: I see. Is everything going well so far?',\n'User: So far so good, but I still have to find a suitable college to film one of the scenes.'",
    "gen_sit": "I'm currently directing and filming a web drama that revolves around teenage romance on campus. I still have to find a suitable college to film one of the scenes."
  },
  "SNG02214": {
    "exchange": "'User: I have always loved dinosaurs when I was a kid.',\n'System: That is what a lot of people like! Apparently it really stemmed from all the dinosaur movies.',\n'User: Indeed! When I went to find out more I realise that they can be quite different.',\n'System: Are you still interested in it or did you grow out of it?',\n'User: I am still very passionate! The museum of archaeology and antropology is one of those places that I frequent even now.'",
    "gen_sit": "I have always loved dinosaurs when I was a kid. I realise that they can be quite different when I went to find out     more. I am still very passionate! The museum of archaeology and antropology is one of those places that I frequent even now."
  },
  "PMUL0187": {
    "exchange": "'User: Ever since my daughter went to university I have not seen her at all.',\n'System: Does she not come back to visit during the holidays?',\n'User: She is really busy with all the extra curriculum activities, apparently she holds quite an important position',\n'System: Then you should be really happy for her! Kids all grow up one day.',\n'User: Yeah I am, I want to bring her out for some british food the next time she comes back! It is like a mini-celebration for her.'",
    "gen_sit": "Ever since my daughter went to university, I have not seen her at all. She is busy with extra-curricular activities and holds an important position. I want to take her out for British food the next time she comes back, as a mini-celebration."
  },
  "MUL2344": {
    "exchange": "'User: I realised that I have been to many countries but not Italy.',\n'System: Hmm I always thought that is one of the places that people would go to first.',\n'User: Yeah but for some reason I just never thought of going there, maybe because I am rarely exposed to them in the first place.',\n\"System: Aren't they a very dominant culture in general, how did you avoid it altogether.\",\n\"User: Exactly I don't even know how, now I am gearing myself up by first trying food that is italian\"",
    "gen_sit": "I have been to many countries, but not Italy. I'm not sure why, but I've never really been exposed to Italian culture.     I'm trying to familiarize myself with it by trying Italian food."
  },
  "MUL2020": {
    "exchange": "'User: Oh my god I think my meeting is going terribly wrong.',\n'System: What happened? Surely there is a way to resolve that.',\n\"User: Yeah I screwed up the location real bad, it's at London Liverpool Street but I am somewhere else.\",\n'System: You can definitely still rush over! When is the actual thing.',\n\"User: It is this week, but I really don't like to rush things and have no time to prepare my materials properly.\"",
    "gen_sit": "I think my meeting is going terribly wrong. I screwed up the location and I'm somewhere else. The meeting is this week,     but I don't like to rush things and have no time to prepare my materials properly."
  },
  "SNG02260": {
    "exchange": "\"User: My friends had a gathering at The Oak Bistro the other day and I couldn't join them.\",\n\"System: Well there is always a next time, don't see too sad about it.\",\n'User: They really rarely meet up so it is like a once in a blue moon thing.',\n'System: Well you could meet a few of them at a time, then you will eventually meet all of them once!',\n'User: That is not a bad idea actually! But it takes so much effort to meet one by one.'",
    "gen_sit": "My friends had a gathering at The Oak Bistro the other day and I couldn't join them. They rarely meet up, so it's a     shame I missed it. It would be nice to meet them all again, but it takes a lot of effort to meet one by one."
  },
  "SNG02115": {
    "exchange": "'User: I feel like places like the middle east really gets left out of the discussion about culture and stuff',\n'System: That is true, it is like a first world effect where only developed countries are considered.',\n'User: And that is so sad! Like they actually have really rich culture and tradition as well but just zero recognition.',\n\"System: It is indeed very unpleasant but I don't feel there is anything we can do.\",\n'User: I think that is the wrong mindset, I am now trying to introduce my friends to things like afghan restaurants to change the way they think.'",
    "gen_sit": "I feel that places like the middle east are often left out of cultural discussions. I believe this is unfair because they have a rich culture and tradition but receive zero recognition. I am trying to change this by introducing my friends to things like Afghan restaurants."
  },
  "PMUL1274": {
    "exchange": "'User: My parents have already moved to peterborough, hope I can join them soon.',\n'System: I see, any specific reasons why you guys moved.',\n'User: Hahaha we won a lottery, so they just bought a new house.',\n'System: Wow congrats! You are probably the first person I know that is a lottery winner, be frugal though.',\n'User: Yeah of course we agreed the house is the only thing we will get, the rest is going to get saved up.'",
    "gen_sit": "My parents and I won a lottery and they've moved to a new house in Peterborough. We've agreed to put the rest of the     winnings towards savings."
  },
  "PMUL3983": {
    "exchange": "'User: I always felt a little anti-social since I was young and it just got worse over the years.',\n\"System: I don't think that is anything to be concerned about, as long you are happy with your current state.\",\n'User: I truly am, but sometimes I feel like I need to make friends.',\n\"System: They are definitely important but don't force yourself, or you just get low quality ones.\",\n'User: That is really true! Maybe I should just continue my routines of visiting museums and eating alone.'",
    "gen_sit": "I have always felt a little anti-social since I was young and it has worsened over the years. I am happy with my     current state, but sometimes I feel like I need to make friends. I visit museums and eat alone as part of my routines."
  },
  "MUL0182": {
    "exchange": "'User: I have not eaten at Korean restaurant in a long time, feel like I am missing out.',\n'System: If you have not been eating there, then it is probably not that important!',\n\"User: That is not true, I have just been meeting a lot of people and they don't eat it that is all.\",\n'System: Ah, well it is somewhere you can go anytime so no big deal with it there.',\n'User: Hey that is the wrong mindset, you have to seize the moment and do things when you can!'",
    "gen_sit": "I have not eaten at a Korean restaurant in a long time and feel like I'm missing out. I've been meeting a lot of people     lately, and they don't eat Korean food, but I still want to try it. I believe it's important to seize the moment and do things when we can."
  },
  "MUL1762": {
    "exchange": "'User: My friends are coming over soon, and they want to try the pasta here in Cambridge.',\n\"System: What do you mean? I didn't know they had something special about the pasta there.\",\n\"User: I didn't know either. They just said that there is one specific store with special recipes for their pasta.\",\n'System: Ohhh, you better go and find out before bringing them there then, since you are the host here.',\n\"User: Hahah exactly, I really don't want to be the guy that leads them to the wrong place.\"",
    "gen_sit": "My friends are coming over soon and want to try the pasta in Cambridge. They want to go to a specific store with     special recipes, but I don't know where it is. I don't want to be the host that leads them to the wrong place."
  },
  "PMUL4438": {
    "exchange": "'User: There is a football match in Cambridge soon and my favourite team is playing in it!',\n'System: Wow! Are you going to go watch it then? Tickers like that are really hard to get.',\n'User: Exactly but I paid a huge amount of money to get it at double the price hahha so all is good.',\n'System: Wow do you like them that much to warrant buying something at that price?',\n'User: Well they really rarely get into the finals so I am really excited and want to be there to cheer them on.'",
    "gen_sit": "There is a football match in Cambridge soon and my favorite team is playing in it! I paid a huge amount of money to get     the ticket at double the price, but I'm really excited to be there to cheer them on since they rarely get into the finals."
  },
  "MUL0830": {
    "exchange": "'User: My friends and I ate at the cote a few days back and it was just so good.',\n'System: What food did you guys have? And was it expensive?',\n\"User: Well good things don't come cheap I can only tell you that. And we had some pasta.\",\n\"System: Hahaha I get what you are driving at. But hmm pasta is generally easy to cook well isn't it.\",\n'User: Well yes it is but honestly they are a whole new level okay, the flavour is something I have never tasted before.'",
    "gen_sit": "I went to Cote with my friends a few days ago and we had pasta. It was really good but also quite expensive."
  },
  "MUL2341": {
    "exchange": "\"User: If Indian food wasn't so spicy I can eat it all day.\",\n'System: They are not all spicy right, some are done without chili.',\n'User: Yeah but that way they lose the essence of the whole thing and it just taste terrible haha.',\n'System: I am sure there are many with good non-spicy ones, porbably just need to look for it.',\n'User: Now that you mention, Rajmahal is one that I have hear often in that category, maybe I will try that.'",
    "gen_sit": "I love Indian food but I wish they weren't so spicy. I've heard Rajmahal has non-spicy options, maybe I'll try that."
  },
  "PMUL1122": {
    "exchange": "\"User: We are having our annual class gathering soon, can't wait to see how everyone looks like now.\",\n\"System: What do you mean it's only been a year surely people don't change that much.\",\n\"User: No they don't but we haven't had the gathering in a long time, many couldn't make it in the past few years.\",\n\"System: So even though it is called annual it actually isn't huh, when was the last time then.\",\n'User: It was like 3 years back, it is a long time, this year we are having it at Club Salsa, my friend booked the whole place.'",
    "gen_sit": "We are having our annual class gathering soon. It's been 3 years since the last one, and this year it's at Club Salsa,     which my friend booked the whole place."
  },
  "SNG0668": {
    "exchange": "'User: My friends always visits British restaurant but I have had nothing but terrible experiences there.',\n\"System: Surely you are just unlucky, you can't generalise an entire group to be bad.\",\n\"User: Well you can't generalise it to be good as well! I don't know but the food has always been cooked really poorly.\",\n'System: Have you ever check the reviews before visiting one, maybe you should do that to make sure you are experiencing the real standards.',\n'User: Well you have a fair point there, I rarely pay attention to the reviews before visiting a place, perhaps that is the issue.'",
    "gen_sit": "My friends always visit British restaurants, but I've had nothing but terrible experiences there. I don't know if it's just me, but the food has always been cooked poorly. I rarely pay attention to reviews before visiting a place, perhaps that's the issue."
  },
  "PMUL0858": {
    "exchange": "'User: I am kinda craving christmas food but Christmas is still pretty far away.',\n\"System: Aren't there restaurants where they serve these kind of seasonal food all year round.\",\n'User: Hmm there might be but usually they are more expensive because it is out of season and I am not ready to spend too much.',\n'System: Hey life is short, treat yourself when you can and when you know you deserve it.',\n'User: Wow well people say that and people also say you should always save for the rainy day.'",
    "gen_sit": "I am craving Christmas food but it's still pretty far away. I know that there are restaurants that serve seasonal food all year round, but they tend to be more expensive when it's out of season. I'm not ready to spend too much, but I also know that life is short and I should treat myself when I can. However, I also know that it's important to save for the rainy day."
  },
  "MUL0305": {
    "exchange": "'User: I am kind of nervous for my knee appointment this Friday, I hope everything goes well.',\n'System: What happened to your knee? I hope it is nothing too serious.',\n\"User: Injured it when I was playing sports a while back, i really hope it is nothing too serious either, don't want to not be able to play.\",\n\"System: Don't think so much about it, technology is really advanced these days, the doctors definitely have a way to help you.\",\n'User: Thanks for comforting me, I tell myself that too but it is just hard to not worry for something you care about.'",
    "gen_sit": "I have an appointment for my knee injury this Friday and I'm feeling a bit nervous about it. I injured my knee while playing sports and I'm worried about the outcome of the appointment. I hope it's nothing too serious and that the doctors can help me. I'm trying to stay positive but it's hard not to worry about something that's important to me."
  },
  "PMUL3406": {
    "exchange": "'User: I have always had a huge fear of clowns and the movie \"IT\" just made it worse.',\n'System: I am so sorry if you knew you had this fear why did you choose to watch it then?',\n'User: Dude have you never heard of the term peer pressure before! It is super real okay I was pressured into it.',\n'System: Well tell them clearly that you hate it and I am sure they will be more understanding and accomodating.',\n'User: Yeah that is kind of late, they are already discussing to visit this clowns cafe where it is full of clowns I want to run away.'",
    "gen_sit": "I have always had a huge fear of clowns and the movie \"IT\" just made it worse. I was pressured by my friends to watch it.     They are now planning to visit a clown cafe where it is full of clowns and I want to run away."
  },
  "MUL0126": {
    "exchange": "\"User: I think Italian restaurants can always be either really good or really terrible, there just isn't any in betweens.\",\n'System: Hmm, how do you identify the good ones and the bad ones though.',\n'User: surprisingly price is a very good indicator, expensive good cheap bad, almost never go wrong.',\n'System: So I guess for them at least the positive relationship between price and quality exists huh.',\n'User: Absolutely, but sometimes expensive ones can be bad as well.'",
    "gen_sit": "I think Italian restaurants can always be either really good or really terrible, there just isn't any in between. Price is a very good indicator, expensive is good and cheap is bad, almost never go wrong. However, sometimes expensive ones can be bad as well."
  },
  "PMUL3123": {
    "exchange": "'User: Monday is my big day I am getting really nervous wew.',\n'System: Congrats you are getting married! How long have you known each other for?',\n\"User: Ten years. We date since secondary school so it was a long long time, I feel really fortunate we didn't break up.\",\n'System: Wow if I may ask how did you guys sustain this relationship for so long.',\n'User: Hahaha everyone thinks it needs special effort but honestly, just a bit more patience and understanding goes a long way.'",
    "gen_sit": "I am getting married on Monday and I'm getting really nervous. My fiance and I have been together for 10 years,     since secondary school. We've been able to sustain our relationship for so long by being patient and understanding with each other."
  },
  "SNG01201": {
    "exchange": "'User: I just had a first date with a girl I recently met.',\n'System: Oh, did everything go well?',\n'User: It was great! We found out we both like animals and so we had lunch at a pet cafe.',\n'System: Having something in common is a great start!',\n'User: Afterward, we walked around and talked a little more. I just parted with her at old schools.'",
    "gen_sit": "I recently went on a first date with a girl I met. We had lunch at a pet cafe and walked around, talking     more. I just parted with her at Old Schools."
  },
  "PMUL3073": {
    "exchange": "'User: My friends and I were catching up over some coffee just now.',\n'System: How nice! Were they close friends?',\n\"User: Yeah, I've known them since young. We talked about everything under the sun that we lost track of time.\",\n'System: I guess your conversations must have been very interesting.',\n'User: Not sure about that. We basically just talked about random things.',\n\"System: Haha, that's how conversations with close friends always go.\",\n'User: At one point, we talked about food and they kept singing the praises of this restaurant called rice boat. It got me really curious about the food there.'",
    "gen_sit": "I was catching up with some friends over coffee. We talked about everything and nothing in particular,     and also discussed a restaurant called Rice Boat that they recommended."
  },
  "SNG0650": {
    "exchange": "'User: Chinese New Year is coming.',\n\"System: Oh, I'm curious as to how the Chinese usually celebrate the event.\",\n\"User: We usually go around visiting friends and family. But since we don't have any relatives here, my family will just be having a dinner feast outside.\",\n'System: I see. I think a seafood restaurant would be great for a dinner feast.',\n\"User: Actually, we'll probably pick a Chinese restaurant since it's more traditional. Besides, my mom likes them because they make her feel at home.\"",
    "gen_sit": "Chinese New Year is coming. My family will be having a dinner feast outside. We'll probably pick a Chinese restaurant     since it's more traditional."
  },
  "SNG0299": {
    "exchange": "\"User: I'm in the famous shopping district in norwich right now.\",\n\"System: Let me guess. You're shopping?\",\n\"User: Haha, why else would I be here? Of course I'm shopping!\",\n\"System: What's the occasion?\",\n\"User: There's a summer sale ongoing, and many big brands are selling at massive discounts!\",\n'System: No wonder you sound so excited.',\n\"User: Well, I'm done now. My hands are already full from the shopping haul.\"",
    "gen_sit": "I'm in the famous shopping district in Norwich. There's a summer sale ongoing, and many big brands are selling at massive discounts. I'm done shopping now, my hands are already full from the shopping haul."
  },
  "PMUL0743": {
    "exchange": "'User: What cuisines do you like?',\n'System: Some of my favourites are Mediterranean and French. How about you?',\n\"User: Oh, I don't really have any preferences when it comes to cuisines. Although, I do love buffet-style restaurants.\",\n'System: Is it because you like the variety of food?',\n\"User: No, it's simply because I'm a big eater! They're great value for someone with a never-ending stomach like me.\",\n'System: Wow, you must have quite the appetite then.',\n'User: Speaking of buffets, Tang Chinese is a newly opened buffet restaurant. Go check it out if you have time.'",
    "gen_sit": "I don't have any preferences when it comes to cuisines. I love buffet-style restaurants because they offer great value for money. Tang Chinese is a newly opened buffet restaurant that I would recommend."
  },
  "PMUL1453": {
    "exchange": "'User: Video advertisements are so annoying.',\n\"System: They always pop up at the wrong time, don't they?\",\n'User: Yeah, they always ruin the flow of the content. The only advertisement that I ever watched without skipping was one for Scott polar museum.',\n'System: Why is that? Was it very different?',\n'User: It was actually interesting and educational, rather than trying to shove a product in my face.'",
    "gen_sit": "I find video advertisements to be annoying because they always pop up at the wrong time and ruin the flow of the content. However, I once watched an advertisement for the Scott Polar Research Museum without skipping it because it was interesting and educational, rather than trying to sell me a product."
  },
  "MUL1407": {
    "exchange": "\"User: I'm so excited for the football season this year. It's going to be epic!\",\n'System: As always!',\n'User: My friends and I have a ritual of having British food before every league.',\n'System: What a fun idea!',\n'User: Yeah, it definitely gets us amped up to support our country.'",
    "gen_sit": "I'm excited for the football season this year. My friends and I have a ritual of having British food before     every league."
  },
  "PMUL0984": {
    "exchange": "'User: I just witnessed a competitive eating competition.',\n\"System: What's it like?\",\n\"User: Shocking. Right when I thought they couldn't possibly stomach any more food, they shove another hot dog into their mouth!\",\n'System: Wow, that sounds brutal.',\n'User: Yeah, it was eye-opening. Apparently, Cambridge holds this competition annually, but I doubt I want to witness such a scene again.'",
    "gen_sit": "I just witnessed a competitive eating competition. It was shocking and brutal. Cambridge holds this competition annually, but I doubt I want to witness such a scene again."
  },
  "MUL1920": {
    "exchange": "'User: This morning, I brought my family to walk the Broxbourne Woods Sculpture Trail.',\n\"System: Today's weather is pretty nice for hiking. Did you have a good experience?\",\n'User: Yeah, totally. The sculptures along the trail were particularly fascinating.',\n\"System: That sounds really unique. I've never heard of a trail with sculptures before.\",\n\"User: In fact, the whole nature reserve was beautiful. Who would've thought a small town like Broxbourne harboured such a place?\"",
    "gen_sit": "I brought my family to walk the Broxbourne Woods Sculpture Trail this morning. The trail was particularly fascinating     and the whole nature reserve was beautiful. Who would've thought a small town like Broxbourne harboured such a place?"
  },
  "PMUL1518": {
    "exchange": "\"User: I've been meaning to try brewing my own beer.\",\n'System: That sounds fun, but where will you get the equipment?',\n\"User: These days, there are actually places that offer beer brewing workshops. They'll provide everything you need to make your own beer.\",\n'System: Interesting. It could even be a fun little activity to do with your friends or family.',\n\"User: So, I found a brewery in London Kings Cross that offers such workshops. I think I'll go sign up with a couple of friends.\"",
    "gen_sit": "I've been meaning to try brewing my own beer. I found a brewery in London Kings Cross that offers beer brewing workshops and     plan to sign up with a couple of friends."
  },
  "PMUL4688": {
    "exchange": "'User: I am obsessed with cheese these days.',\n\"System: You'll probably like Italian food then. Many of their recipes include cheese.\",\n'User: Oh, I absolutely love Italian food. My favourite dish of all time is lasagna, and just the thought of it already got me drooling.',\n'System: It sounds to me like you could eat that almost every day.',\n\"User: I wish! But sadly, I could only ever find them in Italian restaurants, and there aren't many of them around here.\"",
    "gen_sit": "I am currently obsessed with cheese. I love Italian food, especially lasagna, but sadly, I can only find it in Italian restaurants,     which are not readily available around here."
  },
  "SNG0331": {
    "exchange": "'User: Training has been so tough lately.',\n'System: What are you training for?',\n\"User: There's an upcoming international track-and-field competition, and I'll be representing the country.\",\n'System: Wow, I can only imagine how tough the training regime must be for a national athlete.',\n\"User: Yeah, there's a lot of pressure to do well too.\",\n\"System: Hey, cheer up! Just do your best, and you'll have no regrets.\",\n\"User: Thanks. I'll make sure to work extra hard with the time I have until Friday.\"",
    "gen_sit": "I've been training hard for an upcoming international track-and-field competition, where I'll be representing the country.     The training regime is tough and there's a lot of pressure to do well. I'll make sure to work extra hard until Friday."
  },
  "PMUL2363": {
    "exchange": "\"User: I'm going to be closing a major deal on Tuesday with some customers.\",\n\"System: That's great, what deal will you be closing?\",\n\"User: I'll be closing an insurance deal with them at Rice House.\"",
    "gen_sit": "I'll be closing an insurance deal with some customers at Rice House on Tuesday."
  },
  "SNG0711": {
    "exchange": "'User: Finally, my final terms examination is over!',\n\"System: That's great how did it go?\",\n\"User: I feel pretty confident about my result, and I've been thinking about eating some swedish food since yesterday.\"",
    "gen_sit": "My final terms examination is over! I feel pretty confident about my result, and I've been thinking about eating     some swedish food since yesterday."
  },
  "PMUL0574": {
    "exchange": "'User: What cuisine should I have for lunch today?',\n'System: The weather looks good today, what about some western?',\n'User: I just had it yesterday, I think I would want to go to eat at a European restaurant.'",
    "gen_sit": "I'm thinking of what cuisine to have for lunch today. I had western food yesterday, so I'm considering     European cuisine today."
  },
  "MUL1487": {
    "exchange": "'User: This drama is so touching that I cried after watching it!',\n'System: Was there anything that moved you particularly?',\n\"User: Watching the grandma in the show, she reminded me of mine living in ely. It's unfortunate that I'm living in cambridge and it's so long since I last seen her\"",
    "gen_sit": "I recently watched a drama that moved me to tears! The grandma in the show reminded me of my own grandma who lives in Ely. Unfortunately, I live in Cambridge and haven't seen her in a long time."
  },
  "SNG0386": {
    "exchange": "\"User: It's been a long week of school for me and I'm finally returning home to cambridge\",\n\"System: It's been a tiring week indeed, but it's finally time to return home!\",\n'User: I been looking forward to crashing at home all week.'",
    "gen_sit": "I've had a long week of school and I'm finally returning home to Cambridge. I've been looking forward to     crashing at home all week."
  },
  "MUL1130": {
    "exchange": "'User: This week is the open houses for most of the colleges',\n'System: Indeed, are you planning on going to any?',\n'User: I am going to Trinity College where my friend is at'",
    "gen_sit": "This week is the open houses for most of the colleges. I am going to Trinity College where my friend is at."
  },
  "MUL0957": {
    "exchange": "\"User: It's been so long since I got out of house!\",\n'System: Do you have any activities planned?',\n\"User: It's been so long since I went sightseeing for architectures.\"",
    "gen_sit": "I haven't been out of the house in a while and I'm feeling restless. I'm considering going sightseeing for     architectures."
  },
  "MUL1968": {
    "exchange": "\"User: I'm planning on going to a place to relax myself this Saturday\",\n'System: Did you have a difficult week this week?',\n'User: Indeed, I worked overtime for more than three of the days these week'",
    "gen_sit": "I'm planning on going to a place to relax myself this Saturday. I had a difficult week, working overtime for more than three days."
  },
  "MUL1590": {
    "exchange": "'User: I hooked on water sports lately.',\n'System: What kind of water sports?',\n\"User: Recently, I tried out kayaking and surfing. Now I'm learning wakeboarding.\",\n\"System: Wow, it seems like you're really keen on exploring new things.\",\n\"User: The place that I go to in Cambridge offers lessons for all these sports. I just thought it'll be fun to try them all out.\"",
    "gen_sit": "I've been hooked on water sports lately. I've tried out kayaking and surfing and I'm currently learning wakeboarding.     I go to a place in Cambridge that offers lessons for all these sports and I thought it'll be fun to try them all out."
  },
  "MUL0513": {
    "exchange": "\"User: It's my first time in England, and I'm really looking forward to touring the country.\",\n\"System: I'm sure you'll love it here! Have you planned on where to visit?\",\n\"User: Haha, I'm more of the spontaneous kind of guy.\",\n'System: Nothing wrong with that! Sometimes, you might even get a more genuine experience.',\n'User: I saw the Fitzwilliam Museum being mentioned in a brochure from the airport. It sounds interesting.'",
    "gen_sit": "I'm in England for the first time and I'm looking forward to touring the country. I'm more of the spontaneous kind of guy.     I came across the Fitzwilliam Museum in a brochure from the airport and it sounds interesting."
  },
  "PMUL3498": {
    "exchange": "\"User: I'm overweight right now. I should really go on a diet.\",\n'System: Perhaps. Being overweight could lead to many health complications in the future.',\n\"User: I know, but I'm not sure how I should go about it.\",\n'System: You could try asking those around you who have tried to lose weight before.',\n'User: I asked my sister for advice, and she said that she lost a lot of weight from just eating vegetarian food from yippee noodle bar almost every day.'",
    "gen_sit": "I'm overweight right now and I'm considering going on a diet. I'm not sure how I should go about it, but my sister     recommended eating vegetarian food from Yippee Noodle Bar almost every day, which she claims helped her lose a lot of weight."
  },
  "SNG02220": {
    "exchange": "\"User: I'm meeting my girlfriend's parents tonight.\",\n'System: Ooh, that sounds exciting!',\n\"User: I'm more nervous than anything to be honest.\",\n\"System: Oh no, I hope you'll be able to calm your nerves by then!\",\n\"User: We're eating Indian food at Curry Garden too - I'm not confident I'll be able to manage the spice too!\"",
    "gen_sit": "I'm meeting my girlfriend's parents tonight. I'm more nervous than anything to be honest. We're eating Indian food at Curry Garden too - I'm not confident I'll be able to manage the spice too!"
  },
  "MUL1831": {
    "exchange": "'User: I miss my brother.',\n'System: What happened to him?',\n'User: He went to study abroad and eventually decided to settle down there. We used to play together all the time when we were young.',\n\"System: You must've had many fond memories with him.\",\n'User: Yes, particularly the times spent at museums. We used to have so much fun roleplaying the characters we saw.'",
    "gen_sit": "I miss my brother. He went to study abroad and eventually settled down there. We used to play together all the time when we were young. We had a lot of fun roleplaying characters we saw at museums."
  },
  "PMUL1016": {
    "exchange": "\"User: I'm experiencing serious jet lag right now.\",\n'System: You just landed back in the country?',\n'User: Yes, it was a super long flight from New Zealand.',\n'System: Try to drink more water. It should help.',\n'User: Oh, that reminds me. I have to buy some wine for my dad from the duty-free shop before I leave Stansted Airport.'",
    "gen_sit": "I've just arrived back in the country after a long flight from New Zealand and I'm experiencing jet lag. I need to buy some wine for my dad from the duty-free shop before I leave Stansted Airport."
  },
  "MUL2541": {
    "exchange": "\"User: I'm currently researching the correlation between stress levels and the academic performance of college students.\",\n\"System: That's a pretty meaningful topic. What have you gathered so far?\",\n\"User: I'm actually still in the midst of collecting data.\",\n'System: I look forward to your findings.',\n'User: My professor suggested that I collect data from other colleges as well to prevent biases.'",
    "gen_sit": "I'm currently researching the correlation between stress levels and the academic performance of college students. I'm     still in the midst of collecting data, and my professor suggested that I collect data from other colleges as well to prevent biases."
  },
  "PMUL3744": {
    "exchange": "\"User: My sister has just moved into a place in kings lynn! I'm so excited she's nearby now.\",\n'System: Having family around is always great.',\n\"User: Isn't it? To introduce her to the area, we might go out for dinner together, probably to an Indian restaurant.\",\n'System: Sounds fun.',\n'User: I could really use a hand in planning it out.'",
    "gen_sit": "My sister has just moved into a place in King's Lynn. I'm excited she's nearby now. I'm planning to take her out for     dinner, probably to an Indian restaurant, to introduce her to the area. I could really use a hand in planning it out."
  },
  "PMUL3806": {
    "exchange": "'User: I just got a genetic test done, and the results were quite interesting.',\n'System: How exciting!',\n'User: Yes! Turns out, I have just a little bit of Polynesian in my ancestry.',\n'System: Intriguing.',\n'User: Ever since then, polynesian restaurants have become a new obsession of mine.'",
    "gen_sit": "I just got a genetic test done, and the results were quite interesting. Turns out, I have just a little bit of     Polynesian in my ancestry. Ever since then, Polynesian restaurants have become a new obsession of mine."
  },
  "MUL1295": {
    "exchange": "'User: I know just what I need after that stressful week.',\n'System: What would that be?',\n'User: A solo trip. Just some time with myself, and some good food.',\n'System: Top notch plan.',\n'User: I might pop into the new restaurant that just opened up, the royal spice.'",
    "gen_sit": "I had a stressful week and I know just what I need - a solo trip. I'm planning to treat myself to some good food, possibly at the new Royal Spice restaurant."
  },
  "SNG02105": {
    "exchange": "'User: Whew! I had quite a long day at work today.',\n\"System: That's unfortunate.\",\n'User: Working at the museum of classical archaeology can get quite dull at times.',\n\"System: I'm sure.\",\n\"User: I'm just glad I have something to look forward to now. I'm having dinner with friends.\"",
    "gen_sit": "I had a long day at work today. I work at the Museum of Classical Archaeology, which can get quite dull at times.     I'm glad I have something to look forward to now. I'm having dinner with friends."
  },
  "MUL2258": {
    "exchange": "\"User: It's been so long since my husband and I got to step out of town, just to relax.\",\n\"System: That doesn't sound fun.\",\n'User: I know. But at least we finally get to leave Cambridge for a bit in just a few days.',\n'System: How exciting!',\n\"User: I'm ready to just enjoy!\"",
    "gen_sit": "I haven't been able to step out of town and relax with my husband in a long time. But we're finally leaving     Cambridge in a few days and I'm ready to enjoy myself."
  },
  "MUL2324": {
    "exchange": "'User: Hello! I just moved to Cambridge last week.',\n'System: Hope you like the city.',\n\"User: Well, I'm just waiting to get to know all the places around.\",\n'System: That should be fun.',\n'User: Maybe I could first just grab a bite, feel out the place, then go sightseeing?',\n'System: Solid plan.',\n'User: I love gastropubs. I should go looking for a good one.'",
    "gen_sit": "I just moved to Cambridge last week and I'm waiting to get to know all the places around. I'm planning to     grab a bite at a gastropub first and then go sightseeing."
  },
  "SNG0660": {
    "exchange": "'User: My family is coming to visit me this week.',\n'System: How exciting!',\n'User: Yes! I know they love their food, so I have many things to plan.',\n'System: You should get to it, then.',\n\"User: Panahar was highly recommended to me, so it's definitely on the agenda.\"",
    "gen_sit": "My family is coming to visit me this week. I have many things to plan, including a visit to Panahar, which was highly recommended to me."
  },
  "MUL0060": {
    "exchange": "'User: Cousins are rarely very close, but mine are some of my best friends.',\n'System: That is so sweet!',\n'User: Yeah. Every year, we rent a couple rooms and have a short vacation together, just to reconnect.',\n'System: Great tradition.',\n'User: Not to forget, we also always indulge in a lot of food!',\n'System: Naturally.',\n'User: We are all excited to try the J restaurant, since none of us have been there before.'",
    "gen_sit": "My cousins are some of my best friends. Every year, we rent a couple of rooms and have a short vacation     together, just to reconnect. We are all excited to try the J restaurant, since none of us have been there before."
  },
  "MUL1367": {
    "exchange": "\"User: My company's hosting some foreign guests this week and I've been put in-charge of the logisitics.\",\n'System: Are you done with the preparations to receive the guests?',\n'User: Of course not, I was just told this yesterday.',\n\"System: I see, then you'd better get to it!\",\n\"User: For now I guess I'll start with somewhere for them to dine.\",\n'System: What ideas do you have?',\n'User: Strangely enough, one of them apparently requested to eat at a Japanese restaurant.'",
    "gen_sit": "My company's hosting some foreign guests this week and I've been put in-charge of the logistics. I have just been told this and have not started preparing. I guess I'll start with somewhere for them to dine. One of them apparently requested to eat at a Japanese restaurant."
  },
  "PMUL0928": {
    "exchange": "\"User: I'm meeting up with some friends this week!\",\n\"System: That's great! What'll you all be doing together?\",\n\"User: So far we've only decided that we'll grab a bite together.\",\n\"System: Where're you all eating?\",\n\"User: Unfortunately, we're having trouble deciding. Everyone has such different tastes.\",\n\"System: Oh dear, then what'll you all do?\",\n\"User: I think everyone'll probably be fine with a Spanish restaurant, right? They always have pretty good food.\"",
    "gen_sit": "I'm meeting up with some friends this week! We're having trouble deciding where to eat together.     Everyone has such different tastes, but we're considering a Spanish restaurant."
  },
  "MUL2387": {
    "exchange": "\"User: I'm going on a date next week!\",\n\"System: That's great! What'll you be doing on your date?\",\n\"User: I'm just grabbing dinner with my girlfriend. We're going after work so I doubt we'll have the energy for anything else.\",\n'System: Makes sense. Have you both decided where you want to go?',\n'User: My girlfriend told me to pick and surprise her.',\n\"System: You'd better pick some place special then!\",\n'User: I know that! I was thinking of this restaurant my collegue was talking about awhile back. Rice Boat, I think?'",
    "gen_sit": "I'm going on a date next week! I'm just grabbing dinner with my girlfriend. We're going after work so I doubt we'll have the energy for anything else. My girlfriend told me to pick and surprise her. I was thinking of this restaurant my colleague was talking about awhile back. Rice Boat, I think?"
  },
  "MUL0729": {
    "exchange": "'User: Ugh, I have to go to some work conference.',\n\"System: You don't sound terribly pleased about it.\",\n\"User: That's because I'm not. This is such a pain, I wish I wasn't selected for it.\",\n'System: Is it really that bad?',\n\"User: Well the conference itself isn't the problem, I don't mind that. It's the fact that they're holding it in another city!\",\n\"System: Oh I get it, you don't want to travel, right?\",\n\"User: Yeah! I just don't get why they couldn't have just held it here in Ely.\"",
    "gen_sit": "I have to go to a work conference, which is being held in another city. I don't want to travel and wish it was held in Ely."
  },
  "PMUL4686": {
    "exchange": "\"User: We're coming to visit England!\",\n'System: Welcome to England! By the way, who\\'s \"we\"?',\n\"User: My family and I! We're going on vacation in your country.\",\n\"System: That's great! What'll you be doing here?\",\n\"User: We'll be following a tour group. Didn't want the hassle of planning ourselves.\",\n'System: That makes sense. Are you all completely prepared for your trip?',\n\"User: Mostly. I've just booked our flight! We'll be there Monday!\"",
    "gen_sit": "I'm visiting England with my family on Monday! We'll be following a tour group. I've just booked our flight."
  },
  "PMUL2762": {
    "exchange": "'User: My family and I will be on vacation in town next week!',\n\"System: That's great! What'll you all be doing?\",\n\"User: That's the problem, we have no idea.\",\n\"System: What? You really don't have any ideas at all?\",\n\"User: Yeah, we only knew we wanted to go on vacation. But we didn't think about what we actually wanted to do on said vacation.\",\n'System: Ha ha! What a strange situation.',\n\"User: Maybe we'll catch a movie at one of your cinemas? That sounds fun!\"",
    "gen_sit": "My family and I will be on vacation in town next week! We have no idea what we want to do on our vacation. We thought we could catch a movie at one of the cinemas."
  },
  "MUL0505": {
    "exchange": "'User: I had a good discussion with Jim yesterday.',\n'System: It was good? Nice to hear that.',\n'User: Jim is the producer for a video game. He might just hire me as an art consultant for a project.',\n'System: That sounds like both a fun and engaging project.',\n'User: I got a team, now I just need to find some architecture references.'",
    "gen_sit": "I had a good discussion with Jim yesterday. He's the producer for a video game and might hire me as an art consultant     for a project. Now, I just need to find some architecture references."
  },
  "MUL2486": {
    "exchange": "'User: For five seconds of a music video, I need a boat.',\n'System: Those five seconds may just make a huge difference.',\n\"User: If I wasn't getting paid for this, I'd kick her ass and tell her to find her own damned boat.\"",
    "gen_sit": "I need a boat for just five seconds of a music video. If I wasn't getting paid for this, I'd tell her to find her own     damned boat."
  },
  "MUL2307": {
    "exchange": "'User: I was at a nightclub the other day with my new boyfriend.',\n'System: I hope you enjoyed your time then. How was it?',\n\"User: Oh, we've enjoyed it so much we're going to another one.\"",
    "gen_sit": "I was at a nightclub the other day with my new boyfriend. We've enjoyed it so much we're going to another one."
  },
  "PMUL3105": {
    "exchange": "'User: My friend is arriving from Iran soon.',\n'System: Oh, how is your friend?',\n\"User: He's not feeling too good. He has an arrest warrant out after publishing an academic paper.\",\n\"System: That doesn't seem right. I don't think academic papers can get you arrested.\",\n\"User: I decided to let him have a taste of home. I've been to the Shiraz restaurant before, but I was really really drunk.\"",
    "gen_sit": "My friend is arriving from Iran soon. He's not feeling too good because he has an arrest warrant out after publishing an academic paper. I've decided to let him have a taste of home. I've been to the Shiraz restaurant before, but I was really really drunk."
  },
  "SNG0457": {
    "exchange": "'User: She broke my heart.',\n\"System: I'm sorry to hear that. You have my deepest condolences.\",\n'User: I still love her. I do. We met at a Greek restaurant. I forgot its name.',\n'System: I have never experienced heartbreak before, but I hear that it is painful. I hope to share some of your pain, sir.',\n\"User: I think I'll just go to another one. And drink.\"",
    "gen_sit": "I recently experienced heartbreak. I still love her. We met at a Greek restaurant, but I forgot its name. I'm considering going to another restaurant and having a drink."
  },
  "SNG0700": {
    "exchange": "'User: Ugh, I want to put some prawn on the barbie!',\n'System: Prawn on the what?',\n'User: Prawn! Seafood! Barbie! Barbeque! Aussie slang!',\n\"System: Oh, no, sir. I understood what prawn was. I just was not sure what you meant by 'barbie'.\",\n'User: Ugh, I want to eat barbie! Barbeque!'",
    "gen_sit": "I want to eat barbecue, specifically prawn."
  },
  "MUL1162": {
    "exchange": "'User: I hate the world. I hate nightclubs. I just bought a gun. I will show the world that I mean something.',\n'System: Sir, that is against the law.',\n\"User: Hahahaha, no. I'm just messing with you. Testing your limits.\",\n\"System: Oh. Whew. Don't do that again, please.\",\n\"User: I still want to go to a nightclub. I don't even own anything resembling a gun, so you don't have to worry.\"",
    "gen_sit": "I hate the world and nightclubs. I don't own a gun and I want to go to a nightclub."
  },
  "PMUL3786": {
    "exchange": "\"User: My mother's cat just died. I loved that horrible little furry thing.\",\n'System: Oh, my deepest condolences.',\n\"User: I'll have to take some paid leave. Quit old Cambridge for a bit. The cat's having a funeral.\"",
    "gen_sit": "My mother's cat just died. I'll have to take some paid leave and quit old Cambridge for a bit. The cat's having a funeral."
  },
  "PMUL3880": {
    "exchange": "'User: I remember the last time I went to a museum. I had such a wonderful time!',\n\"System: Wow that's great! I'm sure you learnt a lot too!\",\n'User: Well to be honest, not really. I just enjoyed looking at the artifacts in their expansive collection.',\n'System: The important thing is that you enjoyed yourself.',\n\"User: I most certainly did. Can't wait to go to another.\"",
    "gen_sit": "I remember the last time I went to a museum. I had such a wonderful time! I enjoyed looking at the artifacts in their     expansive collection. I can't wait to go to another."
  },
  "MUL0791": {
    "exchange": "'User: Hump days are the worst.',\n'System: Oh is that so?',\n\"User: Yeah most definitely. Wednesdays are when I'm the busiest.\",\n'System: Well all the best.',\n\"User: Thanks! I'll power through it somehow.\"",
    "gen_sit": "I find Wednesdays to be the busiest days."
  },
  "MUL1881": {
    "exchange": "\"User: I've never been to Norwich. Wonder what that's like.\",\n\"System: It's pretty amazing. But you'd have to see it for yourself. It's pretty hard to describe.\",\n\"User: Oh I see. I'm pretty hyped now.\"",
    "gen_sit": "I've never been to Norwich before and I'm curious about what it's like. I'm now excited to visit after hearing     it's amazing."
  },
  "PMUL0912": {
    "exchange": "\"User: My friend had Asian Oriental food the other day and he simply won't stop talking about it!\",\n'System: Did he like it?',\n'User: Yes! So much so he compares everything to it, and according to him nothing comes close.',\n'System: Wow he must really have had quite the meal.',\n\"User: I should think so. Truth be told, I'm a little jealous.\"",
    "gen_sit": "My friend had Asian Oriental food the other day and won't stop talking about it. He liked it so much that he     compares everything to it and claims nothing comes close. I'm a little jealous."
  },
  "PMUL1322": {
    "exchange": "'User: Wednesdays are the best!',\n\"System: That's weird. Isn't hump day dreaded by most?\",\n\"User: Not for me! I don't have any classes on that day!\",\n'System: Wow perfect time for a break!',\n\"User: I couldn't agree more! I do need to take a breather.\"",
    "gen_sit": "I don't have any classes on Wednesdays, which makes it my favorite day! I couldn't agree more! I do need to take a breather."
  },
  "PMUL2255": {
    "exchange": "'User: Have you ever seen a show in a concerthall?',\n\"System: Nope I haven't.\",\n'User: You really should! It was quite the experience.',\n'System: Oh is that so? In that case, I shall the next time the opportunity arises.',\n'User: Yes you definitely should.'",
    "gen_sit": "I have seen a show in a concert hall. It was quite the experience."
  },
  "PMUL3632": {
    "exchange": "'User: I enjoyed my last time in Cambridge.',\n'System: Oh is that so?',\n\"User: Yeah. My parents live there and it's been a while since I've last visited.\",\n'System: Oh no! You should visit them soon.',\n\"User: That's the plan. We're supposed to have dinner as a family on Tuesday.\"",
    "gen_sit": "I enjoyed my last time in Cambridge. My parents live there and it's been a while since I've last visited. I'm planning to visit them soon and we're supposed to have dinner as a family on Tuesday."
  },
  "MUL0878": {
    "exchange": "'User: My friend is quite the food fanatic. We were chatting the other day and she thought gastropub was the perfect fit for me..',\n'System: Have you ever tried it?',\n\"User: I've never even heard of it.\",\n\"System: Oh. I would tell you but I think it's something you should experience for yourself.\",\n'User: Keeping it mysterious I see.'",
    "gen_sit": "My friend recommended a gastropub to me, but neither of us knows what it is."
  },
  "PMUL1063": {
    "exchange": "'User: I thoroughly enjoyed my time here in Cambridge.',\n\"System: That's great! I'm happy for you.\",\n'User: Sad thing is, all good things must come to an end.',\n\"System: But then again,, that's what allows us to cherish such splendid experiences.\",\n\"User: I couldn't agree more.\"",
    "gen_sit": "I thoroughly enjoyed my time here in Cambridge. Sadly, all good things must come to an end. However,     cherishing such experiences is important."
  },
  "MUL0839": {
    "exchange": "'User: My colleagues went to The Junction. Apparently they had a great time.',\n'System: Did you join them?',\n'User: Sadly no. I had plans on that day. But they did make sure I knew how much fun they had.'",
    "gen_sit": "My colleagues went to The Junction and had a great time. Unfortunately, I was unable to join them as I had plans on that day."
  },
  "MUL1594": {
    "exchange": "'User: My mother turns fifty this week, and we plan on making it a great day for her.',\n'System: How sweet!',\n'User: In fact, my brothers and I will be meeting up at Kings Lynn. Our next stop will be home, to surprise her.',\n'System: She will definitely be moved.',\n\"User: That's the aim! All the planning has been left to me, as usual. So, shall we get to it?\"",
    "gen_sit": "My mother turns 50 this week and we plan on making it a great day for her. My brothers and I will be meeting up at Kings Lynn before heading home to surprise her. I've been left in charge of planning, so I need to get started."
  },
  "PMUL4554": {
    "exchange": "'User: My mom use to bring me to parks a lot when I was younger.',\n'System: Aww that is really cute, what did you do at the park back then?',\n\"User: We have a pet dog so i'd play with it, as I get older I feel less happy living in the moment.\",\n'System: Perfectly normal, you have more things to worrk about after all, but your mom has really set an example for you.',\n'User: I guess so! We used to pick up the trash at the park as well to make sure the place is clean.'",
    "gen_sit": "My mom used to bring me to parks a lot when I was younger. We have a pet dog, so I'd play with it. As I get older,     I feel less happy living in the moment. My mom has really set an example for me. We used to pick up the trash at the park as well to make sure the place is clean."
  },
  "SNG02133": {
    "exchange": "'User: Goodness a few days back I almost drowned.',\n\"System: What! What happened, if you don't mind sharing.\",\n'User: I was at jesus green outdoor pool, then I cramped up during the swim and started to struggle.',\n'System: Goodness! Thank god someone pulled you out in time eh.',\n'User: Yeah it was a lifeguard, I am going there just to thank him!'",
    "gen_sit": "I almost drowned a few days ago at Jesus Green outdoor pool. I cramped up during a swim and started to struggle,     but a lifeguard pulled me out in time. I'm planning to go back and thank him!"
  },
  "SNG0369": {
    "exchange": "'User: Every time I talk to my aunt it ends with her sharing on why people should go to Cambridge',\n'System: Oh, do you happen to know why she gives you that suggestion?',\n'User: Well she always talks about the scenery, atmosphere and bookstores',\n'System: Wow that sounds like it could be a really nice place for holiday.',\n'User: I agree! Which is why I have already planned to go there ! Gotta see it for myself'",
    "gen_sit": "My aunt always tells me to visit Cambridge because of its scenery, atmosphere, and bookstores. I have already planned to go there because it sounds like a great place for a holiday."
  },
  "PMUL0698": {
    "exchange": "'User: Goodness I had Chinese food the other day and I had diarrhoea that night immediately.',\n'System: Damn is it really unhygienic, did you eat from some street food?',\n'User: It is not the processing of the food, it was just way too spicy for my body!',\n'System: HAHAHAHA I see, must have felt like it was burning inside your stomach eh.',\n'User: Yeah god but it is so good at the same time, it is like a sweet suffering.'",
    "gen_sit": "I had Chinese food the other day and had diarrhoea that night. It wasn't because of unhygienic food, but because it was too spicy for my body. It was a sweet suffering."
  },
  "PMUL1121": {
    "exchange": "'User: I am finally go for my dental on Wednesday, but I am still really scared.',\n'System: You are scared that something bad will be found or are you generally afraid of dentists.',\n'User: Generally afraid, I honestly don’t know why I never had any bad experience',\n'System: Sometimes some things are just built into your genes and there is no way to explain it.',\n'User: Well that truly sucks because now I can’t keep my oral health in check.'",
    "gen_sit": "I am finally going for my dental checkup on Wednesday, but I am still really scared. I am generally afraid of dentists,     although I have never had a bad experience. I am worried that I won't be able to keep my oral health in check."
  },
  "SNG01598": {
    "exchange": "'User: I still remember my first date with my girlfriend at Milton country park.',\n'System: Ohhh, what did you guys do on your first date?',\n'User: Nothing special, just a picnic and all but because it was the first it is unforgettable.',\n'System: That’s true! How long have you guys been together for?',\n'User: 5 years now! And recently we are planning to revisit that place.'",
    "gen_sit": "I remember my first date with my girlfriend at Milton country park. We've been together for 5 years now and we're planning to revisit that place."
  },
  "PMUL2721": {
    "exchange": "'User: My son kept telling me to bring him to Cherry Hinton Water Play',\n'System: Oh, that’s interesting did he mention why?',\n'User: He did! Do you want to guess the reason I swear you will never get it',\n'System: Is it because he really likes a restaurant that is near that place?',\n'User: Nope! He met this girl and apparently they promised to meet there!'",
    "gen_sit": "My son wants me to bring him to Cherry Hinton Water Play. He met a girl and promised to meet her there."
  },
  "SNG0368": {
    "exchange": "'User: My favourite band is going to be performing in Cambridge and I am really near there!',\n'System: Oh damn, that is really rare surely you are going to catch the performance',\n'User: Of course! The tickets are really expensive though but I still grabbed them',\n'System: Well opportunities like this don’t come often so there’s nothing wrong with doing that',\n'User: That is what I thought as well! I am so excited and I will be going with my friends'",
    "gen_sit": "My favorite band is going to be performing in Cambridge and I am really near there! I am so excited and I will be going with my friends. The tickets are really expensive though but I still grabbed them."
  },
  "PMUL0529": {
    "exchange": "'User: I just got news that one of my old friend moved to Cambridge',\n'System: Oh, how old is old really, 10 years ?',\n'User: Oh much more than that! I have known him for about 25 years now.',\n'System: Damn! That is hella long! If only I had such friends like you.',\n'User: Right! I am really glad that I know a few of such people in my life, really a blessing.'",
    "gen_sit": "I just got news that one of my old friends moved to Cambridge. I have known him for about 25 years now.     I feel blessed to have such long-lasting friendships in my life."
  },
  "PMUL1152": {
    "exchange": "'User: This new branch of a chain just opened in Cambridge I think it’s worth a visit',\n'System: Oh how did you learn about it? From your friends or somewhere else?',\n'User: I first saw it on the internet! But the pictures looked so good I really want to try it!',\n'System: Damn! No wonder people pay so much to advertise online it really works',\n'User: Hahah honestly I think it only work on foodies like me'",
    "gen_sit": "I learned about a new branch of a chain restaurant in Cambridge from the internet. The pictures looked so good     that I really want to try it! I'm a foodie, so online advertising works on me."
  },
  "PMUL1990": {
    "exchange": "'User: The last time I brought my son to birmingham new street I accidentally left him there',\n'System: Goodness, is he adopted how can you forget',\n'User: I wouldn’t treat an adopted child like that either! It was truly an accident',\n'System: You are really lucky that you manage to find him afterwards',\n'User: Yeah true, a lot of bad things could have possibly happened'",
    "gen_sit": "I accidentally left my son at Birmingham New Street during my last visit. Luckily, I managed to find him     afterwards, and I'm grateful that nothing bad happened to him."
  },
  "MUL0674": {
    "exchange": "'User: Ah the few days of stay here has been great as a break',\n'System: Aww, where are you chilling at',\n'User: I’m in Cambridge, came here with my family for a short getaway hehe.',\n'System: I’m sure you guys had a great time! How’s the scenery',\n'User: The scenery is amazing! Honestly it was the main reason why I chose to come here in the first place.'",
    "gen_sit": "I'm currently on a short getaway with my family in Cambridge. The scenery is amazing, which is why I chose to come here in the first place."
  },
  "MUL0681": {
    "exchange": "'User: Every time I visit London kings cross it is always so damn crowded',\n'System: That’s us to be expected, they are one of the busiest metro stations around!',\n'User: Yeah but I feel like they could really use some renovation.',\n'System: Oh what do you mean? Like expansion to make it bigger?',\n'User: Yeah! Like traffic flow is so huge compared to last time they need an upgrade'",
    "gen_sit": "I visit London King's Cross often and find it to be very crowded. I think it needs renovation,     specifically an expansion to accommodate the large number of people and improve traffic flow."
  },
  "PMUL4955": {
    "exchange": "'User: Feels like some food are really overrated compared to others',\n'System: Oh, what is on your mind when you say that',\n'User: I am thinking African food, it is so diverse and nice but so little people know about it',\n'System: Ah yes, that is truly a pity, just because they have very little cultural influence.',\n'User: Yeah, I only tried it that time because there was no options left and I absolutely loved it'",
    "gen_sit": "I was thinking about food and how some are overrated compared to others. I was specifically thinking about African food, which is diverse and nice but not well known. I tried it once when there were no other options and loved it."
  },
  "MUL1780": {
    "exchange": "\"User: It's finally that time of year!\",\n'System: What is it?',\n'User: My annual Cambridge fiesta. I allow myself to go crazy for this.',\n'System: That sounds like fun!',\n\"User: It is! I also check out new places. This time, it's ballare.\"",
    "gen_sit": "It's finally time for my annual Cambridge fiesta, where I allow myself to go crazy. This year, I plan to check out     Ballare."
  },
  "PMUL1235": {
    "exchange": "'User: Being cooped up in the house is really not helping me. I need to go outside more.',\n'System: The outdoors always refreshes you.',\n'User: True, which is why I want to start working out in a park.',\n'System: That sounds great!',\n'User: Just to get the ball rolling, I can get inspired by others exercising around me.'",
    "gen_sit": "I've been cooped up in the house for too long and need to get outside more. I want to start working out in a park     to get inspired by others exercising around me."
  },
  "MUL1722": {
    "exchange": "\"User: Hello! It's our first time in the city, so we're ready to explore!\",\n'System: I hope you enjoy!',\n'User: Thanks. I think sightseeing is definitely in order.',\n\"System: That's a good place to start.\",\n'User: We all love old architecture. Maybe, we could look for some of those places to visit.'",
    "gen_sit": "I'm in a new city, ready to explore. I'm interested in sightseeing and visiting old architecture."
  },
  "MUL0430": {
    "exchange": "'User: I have always wanted to visit all the historical sights in Cambridge. My upcoming solo trip is going to fix that.',\n'System: How exciting!',\n'User: Yes. I just want to spend some time soaking up all the culture there.',\n'System: Sounds lovely',\n\"User: I'm sure I'll eventually end up in a museum, so I should probably plan that out.\"",
    "gen_sit": "I have always wanted to visit all the historical sights in Cambridge. My upcoming solo trip is going to fix that. I'm sure I'll     end up in a museum, so I should probably plan that out."
  },
  "PMUL4426": {
    "exchange": "\"User: Lately, I've been travelling quite a bit for work.\",\n'System: That must be tiring.',\n'User: Sometimes, it is. But, you have to put in the work to see the results.',\n'System: Very true.',\n'User: I just got back today, and I have to leave again on monday.'",
    "gen_sit": "I've been travelling quite a bit for work lately. I just got back today, and I have to leave again on Monday."
  },
  "MUL2199": {
    "exchange": "'User: Work has me going to norwich pretty often now.',\n'System: Is that so?',\n\"User: I have another one coming up soon, and I still haven't made any bookings.\"",
    "gen_sit": "Work has me going to Norwich pretty often now. I have another one coming up soon, and I still haven't made any bookings."
  },
  "PMUL2594": {
    "exchange": "'User: My friends and I are off to Cambridge soon, just for a little break.',\n'System: How exciting!',\n'User: We are really looking forward to it. Food, cinemas, maybe even a museum.',\n'System: The perfect plan.',\n\"User: Not yet. We still haven't finished planning out everything.\"",
    "gen_sit": "My friends and I are off to Cambridge soon, just for a little break. We are really looking forward to it. Food, cinemas, maybe even a museum. We still haven't finished planning out everything."
  },
  "PMUL4492": {
    "exchange": "'User: This weekend, I will be going to meet my parents.',\n'System: How lovely!',\n\"User: Yes. I've been away for college in Cambridge for so long.\",\n'System: That has got to be hard.',\n\"User: Sometimes. I just can't wait to spend some time with them.\"",
    "gen_sit": "I'll be going to meet my parents this weekend. I've been away for college in Cambridge for so long and I miss them."
  },
  "PMUL1140": {
    "exchange": "\"User: My niece's first birthday is coming up, which means I have to go home.\",\n'System: Finally!',\n'User: Yeah. Work has kept me away from london liverpool street for too long.',\n\"System: That's unfortunate.\",\n'User: At least I get to go now.'",
    "gen_sit": "My niece's first birthday is coming up, which means I have to go home. Work has kept me away from London     Liverpool Street for too long. At least I get to go now."
  },
  "MUL0348": {
    "exchange": "'User: I hear that birmingham has a lot of events going on right now, and I need to go.',\n'System: That sounds fun.',\n'User: As it is, a quick break from Cambridge is always refreshing. The planning part is the one I dread.',\n'System: Why?',\n'User: It is not my strong suit. I could really use some help there.'",
    "gen_sit": "I hear that Birmingham has a lot of events going on right now, and I need to go. I'm not good at planning and     dread it. I could really use some help there."
  },
  "PMUL2307": {
    "exchange": "\"User: I'm fascinated by the different cuisines out there.\",\n'System: It is quite interesting.',\n'User: Even if we just look at European food, there is so much variety under that',\n'System: True.',\n'User: On my trip, I definitely want to try some.'",
    "gen_sit": "I'm fascinated by the different cuisines out there. On my trip, I definitely want to try some."
  },
  "MUL1973": {
    "exchange": "'User: Work has me travelling again this week for some meetings.',\n'System: I see.',\n'User: Between those, I have quite a lot of time on my hands.',\n\"System: That's good.\",\n'User: Definitely. I can roam around Cambridge for a bit.'",
    "gen_sit": "I have to travel for work this week for some meetings. I have quite a lot of time on my hands. I can roam around     Cambridge for a bit."
  },
  "PMUL2093": {
    "exchange": "'User: My stomach has been craving some good Indian food for a while now.',\n'System: It certainly is great.',\n\"User: Isn't it? Luckily, it's not hard to find an Indian restaurant in the city.\",\n'System: Agreed.',\n'User: That being said, I will still need some help with it.'",
    "gen_sit": "I have been craving some good Indian food for a while now. Luckily, it's not hard to find an Indian restaurant     in the city, but I still need some help with it."
  },
  "MUL2058": {
    "exchange": "\"User: My friend's birthday is coming up, so all of us have planned a surprise for her.\",\n'System: As good friends should.',\n'User: We will be going hiking in stevenage.',\n'System: That sounds like fun.',\n\"User: It's been on the birthday girl's bucket list for a while.\"",
    "gen_sit": "My friend's birthday is coming up, and we've planned a surprise for her. We'll be going hiking in Stevenage,     which has been on her bucket list for a while."
  },
  "PMUL0987": {
    "exchange": "'User: There are some things that just automatically make you feel posh.',\n'System: Such as?',\n'User: Having french food is definitely one of them.',\n'System: Agreed.',\n\"User: I've never tried it, but I'm determined to do so now.\"",
    "gen_sit": "I believe that certain things can make a person feel posh. For instance, having French food is one of them. Although I've never tried it, I'm determined to do so now."
  },
  "SNG01974": {
    "exchange": "\"User: I'm so excited for the premiere of the new Disney movie this friday.\",\n'System: It certainly is exciting.',\n\"User: I've always wanted to go for one, since I'm a huge fan of the franchise.\",\n\"System: I'm glad you're getting this opportunity.\",\n'User: Me too. I just want to be there already.'",
    "gen_sit": "I'm excited for the premiere of the new Disney movie this Friday. I've always wanted to go for one, since I'm a huge fan of the franchise. I'm glad I'm getting this opportunity and I can't wait to be there already."
  },
  "MUL1963": {
    "exchange": "'User: After a very long school year, I finally get to go back home this week.',\n'System: That is great news!',\n\"User: I can't believe that in just a couple days, I'll be on my way to Stansted Airport, ready to fly home.\",\n'System: How exciting!',\n'User: Before all that, I have to figure out how to get to the airport.'",
    "gen_sit": "After a very long school year, I finally get to go back home this week. I'll be on my way to Stansted Airport, ready     to fly home. I have to figure out how to get to the airport."
  },
  "PMUL4902": {
    "exchange": "\"User: It's time for the tomatina festival, which means we need to get festive.\",\n'System: I agree.',\n\"User: This calls for a full Spanish feast, wouldn't you say?\",\n'System: One hundred percent!',\n\"User: Then it's settled. Now, we have to scour through the Spanish restaurants in the city.\"",
    "gen_sit": "It's time for the Tomatina Festival, which means we need to get festive. We've decided to have a full Spanish feast and now we need to find a suitable restaurant in the city."
  },
  "SNG01703": {
    "exchange": "'User: High end parties make me feel a little uncomfortable sometimes.',\n'System: Why is that?',\n'User: Sometimes, it gets too much for me.',\n\"System: That's understandable.\",\n'User: Which is why, I usually keep back up plans. Today, I will leave the fez club early to go bowling with my family.'",
    "gen_sit": "I feel uncomfortable at high-end parties sometimes. I usually keep backup plans. Today, I will leave the Fez Club early to go bowling with my family."
  },
  "PMUL2021": {
    "exchange": "'User: My girlfriend shared her name with a restaurant!',\n'System: Oh that is pretty cool! What’s it called?',\n'User: Meghna, I’m not sure how they pronounce it though.',\n'System: Hahaha how did you manage to find out about it?',\n'User: A friend of my spotted it on the street then he texted me.'",
    "gen_sit": "My girlfriend shared her name with a restaurant! Meghna, I'm not sure how they pronounce it though. A friend of mine spotted it on the street and texted me."
  },
  "SNG1121": {
    "exchange": "'User: I think the best part of most people’s life is like college time.',\n'System: Why do? Many has not gone to college at all.',\n'User: Okay but for those who have, because you are old enough to enjoy many things but not the responsibilities.',\n'System: Hahahaha I’m sure you have very fond memories of your college then.',\n'User: Absolutely,I even met my wife there so it says something.'",
    "gen_sit": "Many people consider college the best part of their lives because they are old enough to enjoy many things but not     the responsibilities. I have very fond memories of my college and even met my wife there."
  },
  "SNG02330": {
    "exchange": "'User: Religion has really played an important role in society eh',\n'System: Absolutely, in fact it may be one of the reasons how society came  about.',\n'User: Yeah it’s just hard to believe  that so many still believe in it to this day.',\n'System: I mean that is the nature of faith, you can’t really prove it doesn’t exist.',\n'User: Yeah, they even have colleges like Jesus College, can you imagine naming an educational institute after a religious figure'",
    "gen_sit": "The user has expressed their opinion on the role of religion in society. They find it hard to believe that many people still believe in religion. The user also mentions that there are educational institutions named after religious figures, such as Jesus College."
  },
  "PMUL4354": {
    "exchange": "'User: I love colleges they have like the largest collection of educational resources.',\n'System: Well surely you have to be a student of the college in order to make use of it?',\n'User: Well it really depends, I have been to a few before and their policies vary.',\n'System: What is your take on it.',\n'User: Absolutely, I mean the ultimate goal of a college is to educate, and there should need no exceptions.'",
    "gen_sit": "I love colleges because they have the largest collection of educational resources. However, I have visited a few     colleges before and their policies vary. I believe that the ultimate goal of a college is to educate, and there should be no exceptions."
  },
  "MUL1651": {
    "exchange": "'User: My friend is getting married soon I’m so happy for him!',\n'System: Send him my well wishes! How long has he been engaged for?',\n'User: Like 2 years now, their initial plans got delayed so that’s why.',\n'System: I see! Are they the type to go for simple weddings?',\n'User: Absolutely, they are just holding a small ceremony in Peterborough, with a few close friends.'",
    "gen_sit": "My friend is getting married soon and I'm so happy for him! They've been engaged for about 2 years now, but their initial plans got delayed. They're planning a small ceremony in Peterborough with a few close friends."
  },
  "PMUL3923": {
    "exchange": "'User: Oh god I’m going to meet this friend I met on the internet for the first time.',\n'System: Damn, don’t be too trusting of others alright.',\n'User: Of course I will watch out for my own safety!',\n'System: So where are you guys heading to?',\n'User: There’s a wagamama restaurant, apparently they serve really good tempuras which I love as well.'",
    "gen_sit": "I'm going to meet a friend I met on the internet for the first time. I'll be careful and watch out for my own     safety. We're planning to go to a Wagamama restaurant, they serve really good tempuras which I love."
  },
  "PMUL4264": {
    "exchange": "'User: Creative work is so much more important than review work.',\n'System: I agree. To produce something entirely new is the highest form of intellect and prowess.',\n'User: Absolutely, that is why I love art galleries, seeing people express work never seen before.',\n'System: Are you a collector as well or do you just admire them.',\n'User: I rarely buy, but recently Cambridge artwork is having an exhibition by an artist I really like!'",
    "gen_sit": "I believe creative work is more important than review work. I love art galleries, seeing people express new work. I rarely buy artwork, but I'm interested in an upcoming exhibition in Cambridge featuring an artist I admire."
  },
  "SNG0437": {
    "exchange": "'User: London kings cross is always so filled with people I can’t stand it.',\n'System: Well it is a major interchange so you can’t really expect anything less',\n'User: Yeah but everyone is so rude as well they just push and shove',\n'System: That’s the thing even if everyone started out being nice as long as one person starts being mean everyone will be as well.',\n'User: That is true but it is so sad as well, if only we don’t have those idiots'",
    "gen_sit": "London Kings Cross is always so filled with people and everyone is so rude, they just push and shove.     Even if everyone started out being nice, one person being mean will influence the rest. It's sad that there are idiots     ruining the atmosphere."
  },
  "MUL1462": {
    "exchange": "'User: Finally a long waited holiday this Friday!',\n'System: Nice! What are you going to do on your free day.',\n'User: Absolutely nothing.',\n'System: What! Aren’t you going to waste it away if you don’t do anything.',\n'User: Hahaha I’m just kidding , I will be travelling hehe'",
    "gen_sit": "I'm finally getting a long-awaited holiday this Friday! I'll be traveling."
  },
  "PMUL4446": {
    "exchange": "'User: I feel like there are way too many undergraduates these days.',\n'System: What do you mean, it is literally a supply and demand thing.',\n'User: Well I don’t think the market is working out then, that is why everyone keep advancing their studies these days.',\n'System: Perhaps you are right but only time will tell!',\n'User: Hey but I have to admit, the colleges these days can look really cool!'",
    "gen_sit": "I feel like there are way too many undergraduates these days. I think the market isn't working out, which is why     everyone keeps advancing their studies. However, I have to admit that the colleges these days can look really cool!"
  },
  "PMUL0571": {
    "exchange": "'User: Haven’t been here in Cambridge ever since my child went to primary school.',\n'System: Well how do you feel then coming back after a long time.',\n'User: Honestly it just feels like nothing has changed at all.',\n'System: Hahaha that is literally what everyone tells me about it.',\n'User: Yeah dude it feels like they lack the money to renovate anything.'",
    "gen_sit": "I haven't been to Cambridge since my child went to primary school. It feels like nothing has changed since then,     and it seems like the city lacks the resources to renovate anything."
  },
  "MUL0463": {
    "exchange": "'User: I have always pride myself as someone enjoy arts.',\n'System: Ohh, that’s interesting what kind of arts are you into the most.',\n'User: I really like theatres, they feel like the most interactive form and interesting one to me.',\n'System: Ah yes, getting all dressed up and bringing a date must be pretty nice eh.',\n'User: Well yes that’s nice as well, but I really mean the experience of watching the show itself.'",
    "gen_sit": "I have always prided myself as someone who enjoys arts. I really like theatres, they feel like the most interactive form and interesting one to me. I enjoy the experience of watching the show itself."
  },
  "PMUL1525": {
    "exchange": "'User: I’m having my first meeting as the regional manager phew hope everything goes well.',\n'System: I’m sure it will be just fine, don’t stress yourself too much.',\n'User: Yeah they always say that it will just reduce your performance right.',\n'System: Exactly! I’m sure your abilities and skills will carry you through the meeting just fine.',\n'User: I really hope so! It is held in Cambridge so I still have to travel over.'",
    "gen_sit": "I'm having my first meeting as the regional manager and I'm feeling a bit nervous about it. The meeting is held in Cambridge, so I'll have to travel there."
  },
  "MUL1904": {
    "exchange": "'User: Ahhh I need a drink or something to forget my troubles',\n'System: Oh no what happened to you?',\n'User: I just got fired. And honestly I think the reason was completely invalid.',\n'System: Well then exercise your rights, go and sue them for it.',\n'User: I will but for now I just want to forget about it, a nightclub will do me well'",
    "gen_sit": "I just got fired and I'm feeling down. I think the reason was completely invalid. I'm planning to go to a nightclub to forget about it for a while."
  },
  "SNG0542": {
    "exchange": "'User: My mom really misses her hometown food.',\n'System: Oh where is she from.',\n'User: Panama. She’s really ill and she says that she want to try some Panasian food.'",
    "gen_sit": "My mom is ill and misses her hometown food, which is Panasian food from Panama."
  },
  "MUL1382": {
    "exchange": "'User: I always thought that Indian food was too flavourful so I never tried it until recently.',\n'System: Well I’m sure you must have been pleasantly surprised.',\n'User: Exactly! They actually have such a huge variety and tastes I loved it.',\n'System: Well seems like we have another fan now.',\n'User: Hahaha I really want to know if it was that one or are Indian food good in general though .'",
    "gen_sit": "I never tried Indian food because I thought it was too flavourful, but I recently tried it and loved it. I want to know if it was just that one restaurant or if Indian food is generally good."
  },
  "SNG0535": {
    "exchange": "'User: My uncle just started this new restaurant he told me to go down and support him.',\n'System: Well I don’t see a reason not to do it, have you already been there.',\n'User: He named it Efes restaurant but didn’t say anything about where it is!',\n'System: That’s a really unique name!',\n'User: He named it after his wife, it is pretty cute I know.'",
    "gen_sit": "My uncle just started a new restaurant, Efes, named after his wife. He wants me to go down and support him, but he didn't say where it is."
  },
  "PMUL1346": {
    "exchange": "'User: Just thinking of taking the family for a little excursion this weekend.',\n\"System: I'm sure they'll love that.\",\n'User: Yeah. After ages, all of our schedules have given us a free day this saturday. We have to make full use of it.',\n'System: I agree.',\n'User: A good train ride out to a different scenery, maybe a little bit of sightseeing should be a good relaxation.'",
    "gen_sit": "I'm thinking of taking the family for a little excursion this weekend. We haven't had a free day in ages and I'd like to     take a train ride out to a different scenery and do some sightseeing as a way to relax."
  },
  "PMUL2282": {
    "exchange": "'User: Some of my closest friends and I will be having our own little high school graduation send-off.',\n\"System: That's lovely.\",\n'User: I agree. Nothing screams leaving for college more than some cheap food and roaming around aimlessly while we still can.',\n'System: Very true.',\n\"User: I think we might go to a spanish restaurant, since we've all been craving that.\"",
    "gen_sit": "My closest friends and I will be having our own little high school graduation send-off. We'll be having some cheap food and roaming around aimlessly while we still can. We might go to a Spanish restaurant, since we've all been craving that."
  },
  "MUL1977": {
    "exchange": "'User: Our university has given us history students full control over planning a short excursion.',\n\"System: That's awesome!\",\n\"User: Isn't it? We're all leaning towards a museum, obviously.\",\n'System: Understandable.',\n\"User: There are so many nearby. I'm sure we'll find some pretty cool ones to choose from.\"",
    "gen_sit": "Our university has given us history students full control over planning a short excursion. We're all leaning towards a     museum, obviously. There are so many nearby. I'm sure we'll find some pretty cool ones to choose from."
  },
  "SNG1106": {
    "exchange": "'User: The weather has been so lovely recently.',\n\"System: Hasn't it?\",\n'User: Makes me wish to spend all day in a park, reading and eating and just lazing around.',\n'System: That sounds lovely.',\n\"User: Yeah, I think I need to find time for that. It'll be very relaxing.\"",
    "gen_sit": "The weather has been lovely recently, making me wish to spend all day in a park, reading, eating, and just lazing around. I need to find time for that, it'll be very relaxing."
  },
  "PMUL0521": {
    "exchange": "'User: My best friends from college are in town for a few days.',\n'System: How exciting!',\n\"User: Yeah, it's been years since all of us met up together.\",\n\"System: I'm sure it'll be amazing.\",\n'User: Brunch at michaelhouse cafe is what we are going with, followed by some roaming around.'",
    "gen_sit": "My best friends from college are in town for a few days. We haven't met up together in years!     Brunch at Michaelhouse Cafe is what we are going with, followed by some roaming around."
  },
  "PMUL2105": {
    "exchange": "'User: I love our tradition that my friends and I have going for the last few years.',\n'System: What is it?',\n'User: Brunch every week. We have never missed a single one, since it is so important for us all.',\n'System: What a great bonding idea.',\n'User: What makes it better is that we always try out different places to eat, sometimes different cuisines too!',\n'System: Wow!',\n'User: In fact, a british restaurant is up this week.'",
    "gen_sit": "I love our tradition that my friends and I have going for the last few years. We have brunch every week,     never missing a single one. We try out different places to eat, sometimes different cuisines too! This week, we're     trying a British restaurant."
  },
  "PMUL3966": {
    "exchange": "'User: My grandparents are on their way from India to visit us.',\n'System: How exciting!',\n\"User: It is! It's been a long time since they last came here. I'm looking forward to showing them around a bit.\",\n\"System: I'm sure.\",\n'User: Although, I will definitely have to squeeze in some Indian food there.',\n\"System: Can't forget about that!\",\n'User: Sitar Tandoori Restaurant has been highly recommended by many friends.'",
    "gen_sit": "My grandparents are on their way from India to visit me. I'm looking forward to showing them around and     definitely have to squeeze in some Indian food there. Sitar Tandoori Restaurant has been highly recommended by many     friends."
  },
  "MUL1457": {
    "exchange": "'User: My boss needs me to attend a conference in the city.',\n'System: I see.',\n\"User: Although it's a work trip, I'm looking forward to going down there. It's been a while.\",\n'System: I understand.',\n\"User: While I'm there, I might even try some new restaurants that have opened up.\",\n\"System: That's a solid idea.\",\n\"User: My stomach want me to try out a Chinese restaurant. Can't go wrong with that.\"",
    "gen_sit": "My boss needs me to attend a conference in the city. Although it's a work trip, I'm looking forward to going down     there. I might even try some new restaurants that have opened up, including a Chinese restaurant."
  },
  "SNG01777": {
    "exchange": "'User: I really enjoy my weekly family tradition.',\n'System: What is it?',\n\"User: Every week, no matter what happens, we decide on a day to go for dinner. It's a great way to reconnect.\",\n\"System: That's a great idea.\",\n'User: Works for us. We rotate who gets to pick the cuisine.',\n'System: Who is it this time?',\n'User: My dad, and he is dead-set on Chinese food.'",
    "gen_sit": "Every week, my family has a tradition of going for dinner together, no matter what. We take turns picking the cuisine and this week it's my dad's turn. He wants Chinese food."
  },
  "SNG01579": {
    "exchange": "'User: My parents and I are going to surprise my sister in Cambridge for her birthday.',\n'System: How lovely!',\n\"User: Yes! We thought that since she can't come down to stevenage, we'll just go up to her.\",\n\"System: That's very sweet.\",\n\"User: We're all really looking forward to seeing how she's doing.\"",
    "gen_sit": "My parents and I are going to surprise my sister in Cambridge for her birthday. We thought that since she     can't come down to Stevenage, we'll just go up to her. We're all really looking forward to seeing how she's doing."
  },
  "PMUL1393": {
    "exchange": "\"User: I can't believe I managed to get tickets to the big game this week.\",\n\"System: That's awesome!\",\n'User: Yes, Liverpool all the way!',\n'System: Nice.',\n'User: Sometimes I wish Cambridge had a good team. But, nonetheless, I get an outing!'",
    "gen_sit": "I managed to get tickets to the big game this week. I'm supporting Liverpool. I wish Cambridge had a good team,     but I'm still excited for the outing."
  },
  "SNG01993": {
    "exchange": "'User: Potluck sunday is here!',\n'System: What is that?',\n'User: Well, every month, my mother organizes a family brunch on a weekend where we all get our famous dishes to the meal.',\n'System: That sounds fun.',\n'User: Everyone does look forward to it.'",
    "gen_sit": "Every month, my mother organizes a family brunch on a weekend where we all get our famous dishes to the meal.     Everyone does look forward to it."
  },
  "MUL1626": {
    "exchange": "'User: My aunt flies in from Italy this week.',\n'System: How exciting!',\n\"User: It definitely is. I'll be going to pick her up from the airport this saturday.\",\n'System: I see.',\n'User: I might just make a day out of it. Just roam around a bit before she arrives.'",
    "gen_sit": "My aunt flies in from Italy this week and I'll be going to pick her up from the airport this Saturday. I might just     make a day out of it and roam around a bit before she arrives."
  },
  "PMUL3840": {
    "exchange": "'User: Just the other day, I passed by a place that brought back a lot of memories from my trip to France.',\n'System: Is that so?',\n\"User: Yes, the Cote restaurant just made me feel so giddy, and I didn't even go in! It was lovely.\",\n'System: Sounds lovely as well.',\n'User: I should definitely try out their food. In fact, I can make a full day excursion out of it.'",
    "gen_sit": "I passed by a restaurant called Cote recently and it brought back a lot of memories from my trip to France. I     didn't go in, but it looked lovely and I'd like to try their food. I'm thinking of making a full day excursion out of it."
  },
  "SNG0038": {
    "exchange": "\"User: I'm glad I took some time off to visit my brother at his university.\",\n\"System: That's great!\",\n'User: We had really been missing each other, so we decided to meet up for lunch and just hang out.',\n'System: Great plan.',\n'User: Yes, just some good sibling bonding time at Maharajah Tandoori Restaurant along with tasty food.'",
    "gen_sit": "I'm glad I took some time off to visit my brother at his university. We had really been missing each other, so we     decided to meet up for lunch and just hang out at Maharajah Tandoori Restaurant along with tasty food."
  },
  "MUL0827": {
    "exchange": "\"User: Hello! I've finally graduated high school!\",\n'System: Wow, congratulations to you!',\n\"User: Yes, I'm so happy to finally be able to submit my applications for college.\",\n'System: You sure do sound excited.',\n\"User: I am! I can't wait for the next phase of my life in college.\"",
    "gen_sit": "I've finally graduated high school and I'm so happy to finally be able to submit my applications for college. I'm excited     for the next phase of my life in college."
  },
  "MUL2067": {
    "exchange": "\"User: Hello! I've finally been able to take a break from work on Tuesday.\",\n'System: I see, what do you have in store?',\n\"User: Actually, I'm going on a short trip with a few of my friends.\"",
    "gen_sit": "I've finally been able to take a break from work on Tuesday. I'm going on a short trip with a few of my friends."
  },
  "MUL2004": {
    "exchange": "\"User: Hello! It has already been ages since I've lived here in Cambridge. I can't wait to travel.\",\n'System: I see, what do you have planned?',\n\"User: I've had some recommendations from friends on places that I should visit. I surely need to have it all planned out before I leave.\"",
    "gen_sit": "I've been living in Cambridge for a long time and I'm eager to travel. I've received recommendations from friends on places to visit, but I need to plan my trip carefully before I leave."
  },
  "MUL0960": {
    "exchange": "\"User: Hello! My cousin is coming to visit me this weekend. I'm thinking about the places I should bring her to.\",\n'System: I see, let us first start with her hobbies then.',\n'User: Oh right! That reminds me, she loves art. Maybe a visit to the museum would be appropriate for her.'",
    "gen_sit": "My cousin is coming to visit me this weekend. She loves art, so I'm thinking of bringing her to the museum."
  },
  "MUL0493": {
    "exchange": "\"User: Hello! I'm feeling excited!\",\n'System: Oh no, why is it so?',\n\"User: I'm going to meet my mom over the weekends for a girl's day out.\",\n'System: Wow, that sounds like a lot of fun!',\n'User: Yes. Cambrige is the place we have chosen to visit this time. I hope my mom would like it.'",
    "gen_sit": "I'm feeling excited because I'm going to meet my mom over the weekends for a girl's day out. We have chosen     Cambrige as the place to visit this time."
  },
  "PMUL4033": {
    "exchange": "\"User: Hello! I can't wait to catch the new movie coming out in the cinema!\",\n'System: You sure do sound excited. Are you a movie fan?',\n'User: Yes, I love watching movies.'",
    "gen_sit": "I can't wait to catch the new movie coming out in the cinema! I love watching movies."
  },
  "MUL0300": {
    "exchange": "'User: Hello! I have a date this weekend for dinner.',\n'System: I see, what do you have in store?',\n\"User: She told me that she loves north american food. I'm hoping to bring her to have some for dinner.\"",
    "gen_sit": "I have a date this weekend for dinner. My date loves North American food, and I'm hoping to bring her to have some for dinner."
  },
  "SNG0283": {
    "exchange": "\"User: Hello. I'm feeling rather down lately.\",\n'System: Oh no, why is it so?',\n\"User: My mother hasn't been feeling well. I want to visit her as soon as possible.\",\n'System: I see. I hope she recovers soon',\n'User: Sadly, leicester is too far away from her home for me. I feel so bad for not visiting her frequently.'",
    "gen_sit": "I'm feeling down because my mother hasn't been feeling well. I want to visit her as soon as possible, but     Leicester is too far away from her home. I feel bad for not visiting her frequently."
  },
  "MUL1673": {
    "exchange": "'User: Hello! I have some distant relatives coming to town this week.',\n'System: I see. Are you planning to bring them to somewhere special?',\n'User: Yes, my cousin told me that they love indian food. I want to bring them for that.'",
    "gen_sit": "I have some distant relatives coming to town this week. My cousin told me that they love Indian food, so I want to bring them to an Indian restaurant."
  },
  "PMUL4359": {
    "exchange": "\"User: Hello! Recently, I've been really into healthy living.\",\n\"System: That's great! Being healthy sure is important.\",\n'User: Yes. Actually, I like to brisk walk at parks. The air there is fresher.'",
    "gen_sit": "I've been really into healthy living recently. I like to brisk walk at parks because the air there is fresher."
  },
  "MUL0737": {
    "exchange": "\"User: Hello! I'm going on a business trip this weekend.\",\n'System: I see, it sure sounds like an important trip.',\n\"User: Yes, it is. It's pretty last-minute too. I'll have to reach Stensted airport on time.\"",
    "gen_sit": "I'm going on a business trip this weekend. It's pretty last-minute too. I'll have to reach Stansted Airport on time."
  },
  "PMUL4583": {
    "exchange": "'User: When your best friend turns 21, you have to party hard.',\n'System: Agreed!',\n\"User: It is a special birthday, and broxbourne doesn't have much around. This is why we came up with the perfect idea.\",\n'System: And what is that?',\n'User: We will go looking for fun stuff to do elsewhere.'",
    "gen_sit": "My best friend is turning 21, and we want to party hard. Broxbourne doesn't have much around, so we came up with the perfect idea to go looking for fun stuff to do elsewhere."
  },
  "PMUL4828": {
    "exchange": "\"User: I'm going to watch a play with some friends.\",\n'System: Fancy!',\n\"User: Even fancier, it's going to be held at bishops stortford.\",\n'System: I am definitely jealous now.',\n\"User: Haha. Well, I am in charge of planning the day, and I haven't got a clue.\"",
    "gen_sit": "I'm going to watch a play with some friends. It's going to be held at Bishops Stortford. I'm in charge of planning     the day, and I haven't got a clue."
  },
  "PMUL1257": {
    "exchange": "'User: Seeing as the weekend is right around the corner, a couple of friends and I decided to take a quick trip.',\n'System: Good idea.',\n'User: All of us just need to take some time off to relax, away from our lives in Cambridge.',\n'System: Understandably so.',\n\"User: Also, we won't stray too far from hometo keep it convenient for everyone.\"",
    "gen_sit": "A couple of friends and I decided to take a quick trip seeing as the weekend is right around the corner. We all just need to take some time off to relax, away from our lives in Cambridge. We won't stray too far from home to keep it convenient for everyone."
  },
  "MUL1971": {
    "exchange": "\"User: I've been feeling the need to take a day and spend it just by myself.\",\n\"System: That's a grand idea.\",\n'User: Yeah, I really want some peace and quiet to reconnect with myself.',\n'System: Very wise of you.',\n'User: I could club it with visits to museums. They will allow me to just soak in all the culture.'",
    "gen_sit": "I've been feeling the need to take a day and spend it just by myself. I want some peace and quiet to reconnect with myself and have decided to club it with visits to museums. They will allow me to just soak in all the culture."
  },
  "MUL0571": {
    "exchange": "'User: I am such a cinephile, and there is no decent cinema around.',\n\"System: That's unfortunate.\",\n'User: Every time I feel like visiting one, I have to travel away from home.',\n'System: I see.',\n'User: Thankfully, it is usually worth it, and I hope this thursday will be no different.'",
    "gen_sit": "I am a cinephile, but there is no decent cinema around where I live. I have to travel away from home to visit one,     but it's usually worth it. I'm planning to go to the cinema this Thursday."
  },
  "PMUL1233": {
    "exchange": "\"User: I'm excited to show my parents around my new house in leicester.\",\n\"System: Wow, that's great!\",\n\"User: Yes, I'm really happy with how everything turned out.\",\n\"System: I'm sure.\",\n'User: Now, all that is left to do is to plan their trip.'",
    "gen_sit": "I'm excited to show my parents around my new house in Leicester. Now, all that is left to do is to plan their trip."
  },
  "MUL1126": {
    "exchange": "'User: I have a couple meetings in Cambridge over the next few days.',\n'System: I see.',\n'User: Since I have one early tomorrow morning, I thought it wise to leave today.',\n'System: Makes sense.',\n'User: I could just relax today, maybe visit a museum or two.',\n'System: That sounds fun.',\n'User: Yeah, it could really put me in a peaceful mood for work.'",
    "gen_sit": "I have a couple of meetings in Cambridge over the next few days. I have one early tomorrow morning, so I decided to leave today. I could just relax today, maybe visit a museum or two. That sounds fun. Yeah, it could really put me in a peaceful mood for work."
  },
  "MUL1604": {
    "exchange": "'User: I just got news of my promotion, which means a feast is in order!',\n'System: Congratulations!',\n\"User: My friends and I are huge on gastropub food, so we'll probably look for that.\"",
    "gen_sit": "I just received news of my promotion, which calls for a celebration! My friends and I are huge on gastropub food,     so we'll probably look for that."
  },
  "MUL1357": {
    "exchange": "'User: After spending the summer in China, Jensen has been bugging me to go to a Chinese restaurant with him.',\n'System: Oh, so he really likes the food there?',\n\"User: Growing up, Jensen has always liked spicy food, to my chagrin. It wasn't surprising that he would grow to love mala, a type of peppercorn with a strong spicy flavour.\",\n'System: Asians love their spices. Jensen would fit right in.',\n\"User: That's what I told him too. Did you know that Jensen has family in China? That's why he can speak a little bit of Mandarin as well.\"",
    "gen_sit": "Jensen has been bugging me to go to a Chinese restaurant with him after spending the summer in China. He has a     preference for spicy food, which is not surprising given his exposure to mala, a type of peppercorn with a strong spicy flavour. He     also has family in China and can speak a little bit of Mandarin."
  },
  "SNG0554": {
    "exchange": "\"User: Recently it has come to my attention that I haven't tried a German restaurant before.\",\n'System: Okay, how did you come to that realisation?',\n'User: The other day I was doing some grocery shopping and my sister spotted a German Shepard. We went over to pet it.',\n'System: How has a dog got anything to do with a restaurant?',\n\"User: I'm getting to that part. Since we had fun with the dog, we offered to feed one of the sausages we had just bought. That's when it struck me. I wondered if sausages were German, which then led to the realisation that I hadn't had German food from a German chef!\"",
    "gen_sit": "I haven't tried a German restaurant before. I was doing some grocery shopping and my sister spotted a German Shepard.     We went over to pet it. I wondered if sausages were German, which then led to the realisation that I hadn't had German food from a German chef!"
  },
  "SNG01934": {
    "exchange": "\"User: I'm meeting up with a potential client for dinner this weekend.\",\n\"System: That's great.\",\n\"User: I'm slightly worried about the commute back home, though.\",\n'System: Why is that?',\n'User: The restaurant and ely train station could not be further apart in town.',\n\"System: Don't worry, you'll make it.\",\n'User: Hopefully it all goes according to plan.'",
    "gen_sit": "I'm meeting up with a potential client for dinner this weekend. I'm slightly worried about the commute back home     though, as the restaurant and Ely train station are quite far apart."
  },
  "PMUL1479": {
    "exchange": "\"User: College applications are right around the corner, which means it's time to visit some.\",\n'System: I see.',\n'User: I have so many in mind, and am kind of excited for all of this.',\n\"System: I'm sure you are.\",\n'User: I still have to shortlist my options in Cambridge, so I will be going there first.'",
    "gen_sit": "College applications are coming up, and I have to visit some. I have a lot of options in mind and I'm excited     about it. I still have to shortlist my options in Cambridge, so I will be going there first."
  }
}